{
    "url": "https://course-profiles.uq.edu.au/course-profiles/BSAN7212-64781-7460",
    "full_course_code": "BSAN7212-64781-7460",
    "course_code": "BSAN7212",
    "class_code": "64781",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Develop machine learning solutions for a specific business"
        },
        {
            "number": "LO2.",
            "description": "Critically evaluate the applicability of machine learning solutions"
        },
        {
            "number": "LO3.",
            "description": "Communicate and justify machine learning projects to business and technical audiences"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Classification Assignment",
            "special_indicators": [],
            "weighting": "50%",
            "due_date": "13/09/2024 1:00 pm",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Computer Code, Paper/ Report/ Annotation",
            "task_description": "This assignment is an individual project report on a topic related to machine learning (ML). A project report is a document that presents a predictive model, its evaluation and its advantage and uses for business decision-making.The aim is to provide experience in the steps involved with creating, evaluating, improving classification models and finally presenting and interpreting the model in a business report. You are strongly encouraged to commence this assignment by the end of the third week of the semester, and you should progress thoughtfully through the steps. Hasty decisions made early in the design process may result in much more work later.You will be provided with a dataset, such as one about the direct marketing campaigns of a bank. You will be asked to perform specific tasks and develop related models for decision-making.Your reports should include the following parts:Executive summaryModel buildingModel evaluationArtificial Intelligence (AI) provides emerging tools that may support students in completing this assessment task. Students may appropriately use AI in completing this assessment task.. Students must clearly reference any use of AI in each instance. A failure to reference generative AI use may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "The assignment must be submitted electronically through the Blackboard assessment link.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Text Analytics Assignment",
            "special_indicators": [],
            "weighting": "50%",
            "due_date": "25/10/2024 1:00 pm",
            "learning_objectives": "L01, L02",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Computer Code, Project",
            "task_description": "This assignment is an individual assignment. The aim is to provide experience in the steps involved with creating, evaluating, improving an analytics model and finally, presenting and interpreting the model in a business report.You are strongly encouraged to commence this assignment in week 9, and you should progress thoughtfully through the steps.Hasty decisions made early in the design process may result in much more work later.Artificial Intelligence (AI) provides emerging tools that may support students in completing this assessment task. Students may appropriately use AI in completing this assessment task; however, students must clearly reference any use of AI in each instance. A failure to reference generative AI use may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "The assignment must be submitted electronically through the Blackboard assessment link.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Seminar",
            "topic": "Topic 1.1 ClusteringSelf-Directed Learning: a) Cluster Analysis in Business, b) Partitioning Methods: K- Means, c) Partitioning Methods: k-Mediods, d) Hierarchical Cluster Analysis, and e) Quality of ClustersLearning outcomes:L01, L02, L03",
            "topic_title": "Topic 1.1 Clustering",
            "topic_description": "Self-Directed Learning: a) Cluster Analysis in Business, b) Partitioning Methods: K- Means, c) Partitioning Methods: k-Mediods, d) Hierarchical Cluster Analysis, and e) Quality of Clusters",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Not Timetabled",
            "topic": "Topic 1.2 ClassificationSelf-Directed Learning: a) Introduction to Classification, b) Learning & Classification, c) Decision Tree, d) Decision Tree Induction, and e) Random ForestsLearning outcomes:L01, L02, L03",
            "topic_title": "Topic 1.2 Classification",
            "topic_description": "Self-Directed Learning: a) Introduction to Classification, b) Learning & Classification, c) Decision Tree, d) Decision Tree Induction, and e) Random Forests",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Not Timetabled",
            "topic": "Topic 1.2 Evaluation of ClassificationSelf-Directed Learning: a) Introduction to Evaluation, b) Evaluation Methods, c) Confusion Matrix, and d) Model ComparisonLearning outcomes:L01, L02, L03",
            "topic_title": "Topic 1.2 Evaluation of Classification",
            "topic_description": "Self-Directed Learning: a) Introduction to Evaluation, b) Evaluation Methods, c) Confusion Matrix, and d) Model Comparison",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Not Timetabled",
            "topic": "Assignment 1 working weekSelf-Directed Learning: Work independently to complete your first assessment.",
            "topic_title": "Assignment 1 working week",
            "topic_description": "Self-Directed Learning: Work independently to complete your first assessment.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Not Timetabled",
            "topic": "Topic 2.1 Naive Bayes (NB) and KNNSelf-Directed Learning: a) Foundations of NB for Classification, and b) Foundations of KNN for ClassificationLearning outcomes:L01, L02, L03",
            "topic_title": "Topic 2.1 Naive Bayes (NB) and KNN",
            "topic_description": "Self-Directed Learning: a) Foundations of NB for Classification, and b) Foundations of KNN for Classification",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Not Timetabled",
            "topic": "Artificial Neural Network ANN)Self-Directed Learning: a) Introduction to ANN, and b) ANN for ClassificationLearning outcomes:L01, L02, L03",
            "topic_title": "Artificial Neural Network ANN)",
            "topic_description": "Self-Directed Learning: a) Introduction to ANN, and b) ANN for Classification",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Not Timetabled",
            "topic": "Support Vector Machine (SVM)Self-Directed Learning: a) Introduction to SVM, b) SVM for ClassificationLearning outcomes:L01, L02, L03",
            "topic_title": "Support Vector Machine (SVM)",
            "topic_description": "Self-Directed Learning: a) Introduction to SVM, b) SVM for Classification",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Not Timetabled",
            "topic": "Assignment 1 working weekSelf-Directed Learning: Continue independent work on your assessment.",
            "topic_title": "Assignment 1 working week",
            "topic_description": "Self-Directed Learning: Continue independent work on your assessment.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Lecture",
            "topic": "Topic 3.1 Text preprocessingSelf-Directed Learning: a) BOW & TFIDF, and b) Dimensionality Reduction & SVDLearning outcomes:L01, L02, L03",
            "topic_title": "Topic 3.1 Text preprocessing",
            "topic_description": "Self-Directed Learning: a) BOW & TFIDF, and b) Dimensionality Reduction & SVD",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Mid Sem break",
            "activity_type": "Not Timetabled",
            "topic": "In-semester break",
            "topic_title": "In-semester break",
            "topic_description": "",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Not Timetabled",
            "topic": "Topic 3.2 Model building using textSelf-Directed Learning: a) Topic modelling, b) Sentiment classification, c) Document, sentence and feature level for sentiment classification, d) Sentiment classification methods (unsupervised and supervised), e) Word embeddingLearning outcomes:L01, L02, L03",
            "topic_title": "Topic 3.2 Model building using text",
            "topic_description": "Self-Directed Learning: a) Topic modelling, b) Sentiment classification, c) Document, sentence and feature level for sentiment classification, d) Sentiment classification methods (unsupervised and supervised), e) Word embedding",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Not Timetabled",
            "topic": "Advanced ML topics 1Self-Directed Learning: a) Deep Learning, and b) Human in the Loop AILearning outcomes:L03",
            "topic_title": "Advanced ML topics 1",
            "topic_description": "Self-Directed Learning: a) Deep Learning, and b) Human in the Loop AI",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Not Timetabled",
            "topic": "Advanced ML topics 2Self-Directed Learning: a) Graph Data and Graph NN, b) NLP, and c) Deep FakesLearning outcomes:L03",
            "topic_title": "Advanced ML topics 2",
            "topic_description": "Self-Directed Learning: a) Graph Data and Graph NN, b) NLP, and c) Deep Fakes",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Not Timetabled",
            "topic": "Assignment 2 working weekSelf-Directed Learning: Independent work on assessment.",
            "topic_title": "Assignment 2 working week",
            "topic_description": "Self-Directed Learning: Independent work on assessment.",
            "learning_outcomes": []
        }
    ]
}