{
    "url": "https://course-profiles.uq.edu.au/course-profiles/ADVT7506-20264-7520",
    "full_course_code": "ADVT7506-20264-7520",
    "course_code": "ADVT7506",
    "class_code": "20264",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Evaluate the importance of advertising strategy and planning in generating a successful advertising campaign."
        },
        {
            "number": "LO2.",
            "description": "Develop a successful advertising strategy by conducting research into consumer insights."
        },
        {
            "number": "LO3.",
            "description": "Understand the advertising creative process and examine the role of creative strategy in advertising, including various types of appeals that can be used in development and implementation of an advertising message."
        },
        {
            "number": "LO4.",
            "description": "Gain a deep level of knowledge of the various advertising media available, including features, trends and measurement."
        },
        {
            "number": "LO5.",
            "description": "Work effectively in teams to create and present an advertising campaign in response to a client brief."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Consumer Insight Analysis Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "30%",
            "due_date": "11/04/2025 2:00 pm",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "Understanding the factors that drive consumer behaviour is critical to developing an effective advertising strategy. Advertising managers often undertake a discovery process to gain insights into a client’s brand, its competitors, and the target audience. This assessment tasks you with conducting research on a specific product or service (a client brief will be provided) to identify key consumer insights and develop an advertising strategy statement.Key Requirements:Objective: Research and analyse a specific product/service to uncover consumer insights and create an advertising strategy statement.Individual Work: This is an individual assessment. Collaboration with other students in the cohort is not permitted.Word Count: The report must be 1500 words.Resources: A detailed step-by-step project guide, including instructions for the report, will be available in the assessment folder on the unit’s Blackboard site. Please refer to this guide for comprehensive requirements.Submission Language: All submissions must be written in English.Purpose:The insights gained through this assessment will form the foundation for the final group Advertising Campaign project. Ensure that your analysis is thorough, as it will directly contribute to the success of the subsequent group work.AI Statement:This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "To be submitted via Blackboard",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Group Advertising Campaign Pitch",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "40%",
            "due_date": "19/05/2025 9:00 am",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Oral, Product/ Artefact/ Multimedia",
            "category": "Presentation, Project",
            "task_description": "The purpose of this assessment is to provide valuable experience in critically analysing advertising issues from both academic and practitioner viewpoints, and to explore how these insights can be applied to organisational communication strategies. This group project offers an exciting opportunity to collaboratively develop a comprehensive advertising campaign in response to a client brief. Each team will formally prepare a presentation, referred to as the \"Pitch,\" to showcase their advertising project findings. Insights from individualConsumer Insight Analysis Reportscan be incorporated into this group project.Key Requirements:Group Formation and PresentationsTeam Size: Groups will comprise five (5) students.Presentation Schedule: Pitches will be delivered during tutorials inWeek 12andWeek 13, with scheduling managed by your tutor in a prior class.Submission Deadline: The Pitch presentation document is due on the officialDUE DATE, irrespective of the scheduled presentation week.Duration: Presentations will be restricted to 15 minutes per team, followed by a 5-minute Q&A session.Professional Standards: Presentations must meet a professional standard, suitable for delivery to the client. All group members must speak during the presentation, though the time allocation for each member may vary.Assessment ResourcesGuidelines and Criteria: Detailed assessment guidelines and the marking criteria sheet will be available on Blackboard. These will also be discussed in online lectures and workshops.Language Requirement: The Pitch presentation must be delivered and submitted in English.Self and Peer Review ProcessExpectations of Team MembersGroup members are expected to contribute equally and fulfil the tasks agreed upon at the start of the semester.Clear communication and proactive engagement are essential. Poor communication is often the source of discrepancies and conflicts.Resolving IssuesIf disagreements about contributions arise and cannot be resolved within the group, the issue must be raised with the Lecturer, Course Coordinator, or Teaching Facilitator as early as possible.Late-enrolling students or those who do not engage with their group early may be required to complete the task individually or in a smaller team formed from remaining students.Self and Peer Review EvaluationA Self and Peer Review Evaluation will be required, allowing team members to reflect on their own and others’ contributions.Theteam project gradewill be derived from these evaluations, and the Course Coordinator reserves the right to adjust grades to ensure fairness.Students working in good faith will not experience grade adjustments, while individuals performing below expectations may face a negative grade adjustment.Additional Guidance:Be Proactive: Set clear expectations and establish effective communication early in the semester to minimise conflicts.Raise Concerns Early: Address any team issues well before the submission deadline to avoid last-minute complications.For full details, refer to the assessment guidelines on Blackboard.Please Note:The presentation will be recorded for marking purposes per UQ Policy.AI Statement:This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "To be submitted via Blackboard",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Final Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "30%",
            "due_date": "End of Semester Exam Period7/06/2025 - 21/06/2025",
            "learning_objectives": "L01, L03, L04",
            "mode": "Written",
            "category": "Examination",
            "task_description": "Centrally scheduled final examination that will test knowledge of key concepts and views formed during the semester. Further information about the exam format will be provided on the course Blackboard site and in class towards the end of the semester.AI Statement:This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) tools will not be permitted. Any attempted use of Generative AI may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "You may be able todefer this exam.",
            "deferral_or_extension": "You may be able todefer this exam.",
            "late_submission": null,
            "additional_info": "You may be able to\ndefer this exam\n."
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Lecture",
            "topic": "Introduction to Advertising StrategyCourse overview, discussion of assessment items, the role of Advertising Strategy.NO TUTORIALS THIS WEEK.Learning outcomes:L01, L02",
            "topic_title": "Introduction to Advertising Strategy",
            "topic_description": "Course overview, discussion of assessment items, the role of Advertising Strategy. \nNO TUTORIALS THIS WEEK.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Tutorial",
            "topic": "Advertising Strategy and FoundationsLearning outcomes:L01, L02, L03, L04",
            "topic_title": "Advertising Strategy and Foundations",
            "topic_description": "",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Tutorial",
            "topic": "Advertising PlanningLearning outcomes:L01, L02, L03",
            "topic_title": "Advertising Planning",
            "topic_description": "",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Tutorial",
            "topic": "Target Audience AnalysisLearning outcomes:L01, L02, L03",
            "topic_title": "Target Audience Analysis",
            "topic_description": "",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Tutorial",
            "topic": "Consumer InsightsLearning outcomes:L01, L02, L03",
            "topic_title": "Consumer Insights",
            "topic_description": "",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Tutorial",
            "topic": "Brand PositioningLearning outcomes:L01, L02, L03",
            "topic_title": "Brand Positioning",
            "topic_description": "",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Tutorial",
            "topic": "The Creative BriefLearning outcomes:L01, L02, L03",
            "topic_title": "The Creative Brief",
            "topic_description": "",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Tutorial",
            "topic": "Creative StrategyLearning outcomes:L01, L02, L03",
            "topic_title": "Creative Strategy",
            "topic_description": "",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Mid-sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "In-Semester Break",
            "topic_title": "In-Semester Break",
            "topic_description": "",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Tutorial",
            "topic": "IdeationLearning outcomes:L01, L02, L03",
            "topic_title": "Ideation",
            "topic_description": "",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Tutorial",
            "topic": "Mass MediaLabour Day Public Holiday - Monday 5 May 2025- Check Blackboard for announcements about affected classes.Learning outcomes:L01, L04",
            "topic_title": "Mass Media",
            "topic_description": "Labour Day Public Holiday - Monday 5 May 2025 - Check Blackboard for announcements about affected classes.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Tutorial",
            "topic": "Social MediaLearning outcomes:L01, L02, L03, L04, L05",
            "topic_title": "Social Media",
            "topic_description": "",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Tutorial",
            "topic": "Advertising Project Pitch PresentationsLearning outcomes:L01, L02, L03, L04, L05",
            "topic_title": "Advertising Project Pitch Presentations",
            "topic_description": "",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Lecture",
            "topic": "Course WrapLearning outcomes:L01, L03, L04",
            "topic_title": "Course Wrap",
            "topic_description": "",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        }
    ]
}