{
    "url": "https://course-profiles.uq.edu.au/course-profiles/IBUS7302-20315-7520",
    "full_course_code": "IBUS7302-20315-7520",
    "course_code": "IBUS7302",
    "class_code": "20315",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Evaluate the major contextual issues encountered in international business, including economic, ethical, legal, political, and social aspects external to the firm."
        },
        {
            "number": "LO2.",
            "description": "Apply the fundamental theories explaining international trade and investment to key aspects of international business operations including Australian and world trade/investment patterns."
        },
        {
            "number": "LO3.",
            "description": "Collaboratively work and self-manage multicultural groups."
        },
        {
            "number": "LO4.",
            "description": "Reflect on the impacts of international trade, investment liberalisation, regional economic integration on stakeholders from diverse backgrounds, including Australian Aboriginal and Torres Strait Island peoples."
        },
        {
            "number": "LO5.",
            "description": "Persuasively and succinctly express evaluations of contemporary international business issues."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "In-Semester Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "25%",
            "due_date": "Week 5During class time",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "The exam will take the form of MCQs and short essay questions.The exam will include all materials covered in the course from Weeks 1-4.Missing the examination without legitimate reason will result in zero marks.Only answers in the English language will be marked.Plagiarised materials will be marked zero.NOTE:Similarity with submitted works from other students will be imputed as plagiarism since it implies that previous students used the same exact materials, thus no paraphrasing has been done - which is plagiarism.Criteria & Marking:The examination will be assessed on its completeness and correctness. Knowledge of international business theories, applying theory to practice, and evidence and analysis are the key criteria for assessment, besides answering all parts of the questions. Further details will be made available on Blackboard.AI Statement:This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "To be submitted in class only",
            "deferral_or_extension": "You may be able todefer this exam.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\ndefer this exam\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Topic Analysis Assignment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "25%",
            "due_date": "Week 11 Mon - Week 13 Fri",
            "learning_objectives": null,
            "mode": "Oral, Written",
            "category": "Paper/ Report/ Annotation, Presentation",
            "task_description": "◆ See Bb Announcements and Seminar Slides for full assessment information.The class will be divided into teams of 4-5 students.Each team will be responsible for presenting a topic.Teams and presentation dates will be randomly assigned by the course coordinator.It is important for group members to contact each otheras soon as possible after the teams are formedto avoid potential failure of the group assignment. To reassure students, the Assignment Groups are created to have as equal numbers of students as possible. However, once we proceed past Week 4, it is unfair to ask group members to change groups thus some groups may have unequal numbers. Please see the assignment guide and check Blackboard for more information.◆ Each group member must submit their individual contributions to the team assignment on Blackboard to ensure proper documentation of participation.Although the submission will not be marked, not submitting the individual contribution materials will exclude you from receiving the group’s debate mark, since it implies you did not contribute to the group assignment. Make sure you document your contribution. If your group uses online files, use track changes to show your contribution, and save the files as evidence.A reference list of all materials used should also be included; minimum of three peer-reviewed reference per team member.Late submission penalty applies for Individual Contribution and Group Outline.◆ Academic Integrity policy is in effect.It is the responsibility of each individual and group to adhere to Academic Integrity. Plagiarism (high similarity matches) including translation APPs will result in zero marks for the assignment!All parts of this course assessments evaluate students' abilities, skills, and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologiesto assist writing is prohibitedand may constitute student misconduct under the Student Code of Conduct. This includes dictionary and translation applications. In short,anything that involve copying and pasting and/or uploading into another application, and then copying it and/or downloading it is prohibited– this will be detected. However, like the classic tool, Google, it can be used to suggest ideas.◆ In-class compulsory (formative) Audience Marking of all the presentations are mandatory; each student must submit the Audience Marking sheet at the end of class to validate their own individual mark for this assignment.◆ Group Peer (members) evaluations are mandatory and must be submitted within five calendar days of the assessment due date.Failure to submit a review may result in a decrease in marks. All students in the group will receive the same mark and each member will have the opportunity to evaluate the contributions of their peers using four criteria. If a student is absent from the scheduled presentation without a valid excuse, they will receive no marks for the assignment.Important Mark Moderation Based on Peer Review – highest score is 9, see explanation below.The moderation of individual marks will be based on the following overall average review:8.5 to 9.0 (consistently demonstrated full contribution to group), no deduction from group mark.8.0 to 8.4(demonstrated medium-high level contribution)5% deduction from group mark.6.0 to 7.99(demonstrated medium level contribution),15% deduction from group mark.3.0 to 5.99(demonstrated medium-low contribution),25% deduction from group mark.1.01 to 2.99(demonstrated low contribution in several criteria or submitted contribution passed agreed group deadline),50% deduction from group mark.1, no individual mark will be awarded.◆ Criteria and Marking:Groups will be awarded a group score, and all members will share this same score which may be moderated by Peer Assessment results. There will be adequate out-of-class preparation time for the assignment.Marks will be allocated according to coverage of issues, the depth on analysis, professional presentation and evidence of research.The presentation will be recorded for marking purposes per UQ Policy.Detailed Detailed instructions and criteria are provide in the IBUS7302 Topic Analysis Assignment Guide on Blackboard.Read full task descriptionHide full task description",
            "submission_guidelines": "Additional details are included in the \"Topic Analysis\" handout on the course Blackboard site under the \"Assessment\" folder. Also ,refer to regular announcements on Blackboard.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Final Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "50%",
            "due_date": "End of Semester Exam Period7/06/2025 - 21/06/2025",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "The final exam will cover all materials discussed in the course from Weeks 6 to 13. However, you are expected to also draw upon your knowledge and understanding of the materials covered in weeks 1 to 4 of the course. It is 2 hours duration and will consist of short essay problem solving questions and multiple-choice questions.Only answers in the English language will be marked.Criteria & Marking:The examination will be assessed on its completeness and correctness, and may include case analysis. Knowledge of international business theories, applying theory to practice, and providing evidence and analysis in support of arguments are the key criteria for assessment, besides clear expression and comprehensively addressing all parts of the questions. More information will be provided in the final seminar.AI Statement:This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "You may be able todefer this exam.",
            "deferral_or_extension": "You may be able todefer this exam.",
            "late_submission": null,
            "additional_info": "You may be able to\ndefer this exam\n."
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Seminar",
            "topic": "Course OverviewIntroduction to the course; Defining International Business (IB); IB as a Global Factory, Globalisation. Mock debate.Readings: Hill, Chapter 1; Compulsory Reading in Bb: (Course profile, Topic Assignment Guide)",
            "topic_title": "Course Overview",
            "topic_description": "Introduction to the course; Defining International Business (IB); IB as a Global Factory, Globalisation. Mock debate.\nReadings: Hill, Chapter 1; Compulsory Reading in Bb: (Course profile, Topic Assignment Guide)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Seminar",
            "topic": "CultureDefine culture, Country comparisons, Influence of culture on people, organisations and management. Class exercise, Group creation.Compulsory integrity tutorial must be completed prior to any assignment submission in this course. See: https://www.uq.edu.au/integrity/Readings: Hill, Chapter 4; Compulsory Reading in Bb: (Course profile, Topic Assignment Guide)",
            "topic_title": "Culture",
            "topic_description": "Define culture, Country comparisons, Influence of culture on people, organisations and management. Class exercise, Group creation.\nCompulsory integrity tutorial must be completed prior to any assignment submission in this course. See: https://www.uq.edu.au/integrity/\nReadings: Hill, Chapter 4; Compulsory Reading in Bb: (Course profile, Topic Assignment Guide)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Seminar",
            "topic": "Global Political EconomyInfluence of global environment on political economy. Notions of institutions, Institutional models, Political involvement in economic affairs, Political risk, Impacts on international business. Case: Risk analysis. Team activity.Readings: Hill, Chapter 3 & 9; Compulsory Reading in Bb: Kobrin (1979); Kobrin (1971).",
            "topic_title": "Global Political Economy",
            "topic_description": "Influence of global environment on political economy. Notions of institutions, Institutional models, Political involvement in economic affairs, Political risk, Impacts on international business. Case: Risk analysis. Team activity.\nReadings: Hill, Chapter 3 & 9; Compulsory Reading in Bb: Kobrin (1979); Kobrin (1971).",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Seminar",
            "topic": "National Political EconomyInfluence of global environment on political economy. Influence of environment, culture, and political economies on IB. In-Semester exam information.Readings: Hill, Chapter 2 & 7; Compulsory Reading in Bb: Yeung (2005); Yeung (1998); Powell (1991).",
            "topic_title": "National Political Economy",
            "topic_description": "Influence of global environment on political economy. Influence of environment, culture, and political economies on IB. In-Semester exam information.\nReadings: Hill, Chapter 2 & 7; Compulsory Reading in Bb: Yeung (2005); Yeung (1998); Powell (1991).",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5",
            "activity_type": "General contact hours",
            "topic": "In-Class In-Semester ExamIn-Class Timed Examination. All materials from Weeks 1 to 4 are examinable.NOTE: Missing the examination without legitimate cause will result in the mark of zero.",
            "topic_title": "In-Class In-Semester Exam",
            "topic_description": "In-Class Timed Examination. All materials from Weeks 1 to 4 are examinable.\nNOTE: Missing the examination without legitimate cause will result in the mark of zero.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Seminar",
            "topic": "International Trade TheoryGuest Lecture:Principles and explanations of international trade. Underlying theory for the Multinational Enterprise (MNE), Structure of Australia's trade; Principles and explanations of international trade.Readings: Hill, Chapter 6 & 7.",
            "topic_title": "International Trade Theory",
            "topic_description": "Guest Lecture:\nPrinciples and explanations of international trade. Underlying theory for the Multinational Enterprise (MNE), Structure of Australia's trade; Principles and explanations of international trade.\nReadings: Hill, Chapter 6 & 7.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Seminar",
            "topic": "Foreign Direct InvestmentGuest Lecture.Foreign Direct Investment.  Economic systems, Complexity of economic environment and impact on international business, Foreign direct investment.Readings: Hill, Chapter 8.",
            "topic_title": "Foreign Direct Investment",
            "topic_description": "Guest Lecture.\nForeign Direct Investment.  Economic systems, Complexity of economic environment and impact on international business, Foreign direct investment.\nReadings: Hill, Chapter 8.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Seminar",
            "topic": "Foreign Market EnvironmentSalient issues in IB. Human resourcing of IB firms, Expatriation issues, decisions and practice.Readings: Hill, Chapter 14 & 19.18 April 2025 is Good Friday,it is a public holiday. Therefore, there is no in-person seminar on this day. Depending on class size, this topic will be delivered via recording or in week 13.",
            "topic_title": "Foreign Market Environment",
            "topic_description": "Salient issues in IB. Human resourcing of IB firms, Expatriation issues, decisions and practice.\nReadings: Hill, Chapter 14 & 19.\n18 April 2025 is Good Friday, it is a public holiday. Therefore, there is no in-person seminar on this day. Depending on class size, this topic will be delivered via recording or in week 13.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid-sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "In-Semester Break",
            "topic_title": "In-Semester Break",
            "topic_description": "",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Seminar",
            "topic": "Entering Foreign MarketsVarious entry modes.   International business strategy defined; Complexity of foreign entry, Factors that influence mode choice, Internationalisation, Value chain. Case: Entry mode; Internationalisation, Uppsala Model example.Readings: Hill, Chapter 15 & 16.",
            "topic_title": "Entering Foreign Markets",
            "topic_description": "Various entry modes.   International business strategy defined; Complexity of foreign entry, Factors that influence mode choice, Internationalisation, Value chain. Case: Entry mode; Internationalisation, Uppsala Model example.\nReadings: Hill, Chapter 15 & 16.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Seminar",
            "topic": "International Business OperationsVarious operating modes. Various operating and entry modes; Local responsiveness and global integration; Understanding location and customers. Case: Localisation.Readings: Hill, Chapter 13, 17 & 18.",
            "topic_title": "International Business Operations",
            "topic_description": "Various operating modes. Various operating and entry modes; Local responsiveness and global integration; Understanding location and customers. Case: Localisation.\nReadings: Hill, Chapter 13, 17 & 18.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Seminar",
            "topic": "Topic AnalysisTopic Analysis.A presentation schedule will be posted well before your presentation date so that you can adjust your schedule accordingly.",
            "topic_title": "Topic Analysis",
            "topic_description": "Topic Analysis.\nA presentation schedule will be posted well before your presentation date so that you can adjust your schedule accordingly.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Seminar",
            "topic": "Topic AnalysisTopic Analysis.A presentation schedule will be posted well before your presentation date so that you can adjust your schedule accordingly.",
            "topic_title": "Topic Analysis",
            "topic_description": "Topic Analysis.\nA presentation schedule will be posted well before your presentation date so that you can adjust your schedule accordingly.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Seminar",
            "topic": "Completion Case/Topic Analysis; Exam Briefing (Review)Completion Topic Analysis; Exam Briefing (Review).Depending on class size Week 8 topic may be delivered in Week 13.",
            "topic_title": "Completion Case/Topic Analysis; Exam Briefing (Review)",
            "topic_description": "Completion Topic Analysis; Exam Briefing (Review).\nDepending on class size Week 8 topic may be delivered in Week 13.",
            "learning_outcomes": []
        }
    ]
}