{
    "url": "https://course-profiles.uq.edu.au/course-profiles/IBUS7326-22686-7520",
    "full_course_code": "IBUS7326-22686-7520",
    "course_code": "IBUS7326",
    "class_code": "22686",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Develop research questions anchored in academic literature."
        },
        {
            "number": "LO2.",
            "description": "Conduct a literature review."
        },
        {
            "number": "LO3.",
            "description": "Select and design an appropriate research methodology."
        },
        {
            "number": "LO4.",
            "description": "Collect, analyse and interpret data."
        },
        {
            "number": "LO5.",
            "description": "Draw sound conclusions in line with the theoretical framing of the study."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Research Thesis",
            "special_indicators": [],
            "weighting": "90%",
            "due_date": "30/05/2025",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Thesis",
            "task_description": "The empirical Master’s thesis follows the same basic format as an Honours thesis or PhD thesis. To that end, unless otherwise instructed by the supervisor, the thesis will have a minimum chapter content likely to include:IntroductionLiterature review and/or Theory developmentResearch Design and MethodologyResults (Analysis of research data)DiscussionConclusionThe above structure is an example for an empirical thesis, depending on your specific topic and discipline, your supervisor may suggest different headings or structure. In cases where a theoretical thesis is undertaken, a different structure would be required. Students are advised to seek direction of their supervisor on the appropriate structure in such cases.Ethical ResearchIt is the responsibility of all research students to ensure research undertaken is ethically sound. Ethics approval must be sought prior to any form of primary data collection. For more information on research ethics process, please see below links:All research involving humans that is not greater thanlow or negligible riskcan be reviewed by one our Faculty-based ethics sub-committees. Please direct all questions regarding low or negligible risk process tobellnr@uq.edu.au.Research involving humans that is greater than low or negligible risk will be reviewed by one of UQ’sHuman Research Ethics Committeein a full committee meeting.Please liaise with your UQ Business School academic supervisor for assistance with ethics application process.The ethics committee meet fortnightly to assess ethics applications. The cut-off date for submissions is one week prior to each scheduled meeting.Thesis Format and Word CountThe thesis must be the lesser of 20,000 words in length or 100 pages of double spaced printing in 12-point Times New Roman font on A4 paper.Note: marking will cease should the research thesis exceed 20,000 words (not including cover page, acknowledgements, disclaimer, and appendices)The fly page must show:The University of QueenslandFaculty of Business, Economics & LawUQ Business School(the title)A thesis submitted to the UQ Business School, The University of Queensland, in partial fulfilment of the requirements for the degree of (program title) [e.g. Master of Business].by (student's name)the dateSupervisor: (name)On a separate page, show ‘Acknowledgements’ which must include a signed disclaimer statement which says:''The work presented in this thesis is, to the best of my knowledge and belief, original, except as acknowledged in the text. The material has not been submitted, either in whole or in part, for a degree at this or any other university.\"The marking guide for your thesis provided by course coordinator. This is also available via the Blackboard course site.REFERENCING AND CITINGAssignments must be substantially your own work. If you wish to report another author's point of view you should do so in your own words, and properly footnote the reference in accordance with the school style. Direct quotations should be used sparingly, form a small part of your work, and must be placed in quotation marks and referenced.Any material taken from texts and other references, including electronic resources, CD-ROMS, and the Internet,mustﾠbe acknowledged using the accepted School style.Students are encouraged to discuss issues that arise in this course together, however, the written work you submitmust be entirely your own. Similarly, you must not help another student to cheat by lending assignments (present or past).For more information on referencing styles, visit the library or see:ﾠhttps://web.library.uq.edu.au/research-tools-techniques/referencing/referencing-style-guides.If you do not reference correctly, you could be found guilty of academic misconduct. Please see this link for more information:ﾠhttps://my.uq.edu.au/information-and-services/manage-my-program/student-integrity-and-conduct/academic-integrity-and-student-conduct.Marking of ThesisIn the event a third examiner is required to moderate the research thesis, the following process applies:In the event the variance between the first and second examiner is greater than 10 or across two grade thresholds, a third examiner will be employed for moderation.Upon finalisation of the third examiner marks, the final average mark for the research thesis is taken from the two examiner marks closely aligned (i.e., within 10 marks or same grade threshold).In the event the variance between all three examiners is greater than 10 or across multiple grade thresholds, the final average grade for the research thesis is taken from across all three examiners.Read full task descriptionHide full task description",
            "submission_guidelines": "To be submitted through Turnitin via Learn.UQ",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Research Proposal Presentation",
            "special_indicators": [],
            "weighting": "10%",
            "due_date": "The proposal presentation will most likely take place on Thursday of week 6 in your enrolling semester. The exact date and time will be communicated by the Course Coordinator.",
            "learning_objectives": "L01, L02, L03",
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "This research presentation allows you to present your research question, literature review, and proposed methodology within a small supportive forum comprising academic members of staff and your fellow students. You will be given 15 minutes to present your progress to date and this will take place at a small in-house event at the end of semester one. Further details regarding the precise date will be provided.An assessor will be assigned and detailed feedback will be provided to both you and your supervisor to assist with the progression of your thesis.AI StatementThis assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "Students should upload their slides to Blackboard prior to their presentation.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 13",
            "activity_type": "Not Timetabled",
            "topic": "Independent Research ActivityYou will be expected to meet weekly with your supervisor for at least an hour. This is essential especially in the early phase of your thesis work so that you are effectively guided toward defining your research question and designing your study appropriately. It is very easy to head in the wrong direction early and very difficult to get back on track. A plan should be put in place to accommodate additional supervisors from partner institutions.Learning outcomes:L01, L02, L03, L04, L05",
            "topic_title": "Independent Research Activity",
            "topic_description": "You will be expected to meet weekly with your supervisor for at least an hour. This is essential especially in the early phase of your thesis work so that you are effectively guided toward defining your research question and designing your study appropriately. It is very easy to head in the wrong direction early and very difficult to get back on track. A plan should be put in place to accommodate additional supervisors from partner institutions.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2(03 Mar - 09 Mar)",
            "activity_type": "Seminar",
            "topic": "Week 2: Designing your research project & Literature reviews Planning your project & Literature ReviewsDate, Time & Location6 March 14.00-16.00. 35-112 - Chamberlain BuildingLearning outcomes:L01, L02",
            "topic_title": "Week 2: Designing your research project & Literature reviews Planning your project & Literature Reviews",
            "topic_description": "Date, Time & Location\n6 March 14.00-16.00. 35-112 - Chamberlain Building",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 5(24 Mar - 30 Mar)",
            "activity_type": "Seminar",
            "topic": "Week 5: Method & Data AnalysisDate, Time & Location27 March 14.00-16.00. 35-112 - Chamberlain BuildingLearning outcomes:L03, L04",
            "topic_title": "Week 5: Method & Data Analysis",
            "topic_description": "Date, Time & Location\n27 March 14.00-16.00. 35-112 - Chamberlain Building",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9(28 Apr - 04 May)",
            "activity_type": "Seminar",
            "topic": "Writing the discussion, drawing conclusions from the data analysisDate, Time & LocationMay 1st 14.00-16.00. 35-112 - Chamberlain BuildingLearning outcomes:L05",
            "topic_title": "Writing the discussion, drawing conclusions from the data analysis",
            "topic_description": "Date, Time & Location\nMay 1st 14.00-16.00. 35-112 - Chamberlain Building",
            "learning_outcomes": [
                "L05"
            ]
        }
    ]
}