{
    "course_title": "Impact Academy 1: Discovering New Solutions for Complex Problems",
    "study_period": "Sem 1 2025",
    "location": "Brisbane City",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MGTS7820-22396-7520",
    "full_course_code": "MGTS7820-22396-7520",
    "course_code": "MGTS7820",
    "class_code": "22396",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Synthesise complex data to develop sustainable responses and solutions."
        },
        {
            "number": "LO2.",
            "description": "Respond to complex challenges with authentic and empathetic leadership for society’s benefit."
        },
        {
            "number": "LO3.",
            "description": "Critically reflect on preconceptions, stereotypes and biases that may influence the perception of stakeholders including Indigenous knowledge and/or perspectives."
        },
        {
            "number": "LO4.",
            "description": "Working individually and in teams, demonstrate cognitive empathy with a wide range of stakeholders through application of best practice ethnographic tools."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "A1: Situation Analysis",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 7/04/2025 5:30 pm</p>\n<p>\n</p><p>During Class</p></dd>",
            "learning_objectives": null,
            "mode": "Oral, Written",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Student teams will present their project situational and behavioural systems analysis demonstrating cognitive empathy with key stakeholders including goals, barriers, driving and restraining forces maintaining the status quo and an evaluation of 5 established and 5 new emerging solutions. Student teams should include a synthesis and interpretation of their</p>\n<ol>\n<li>External data analysis,</li>\n<li>Humble Discovery interviews</li>\n<li>Stakeholder observations; and</li>\n<li>Experiments.</li>\n</ol>\n<p>The tools that need to be used to demonstrate contextual understanding and stakeholder cognitive empathy include:</p>\n<ol>\n<li>Data Visualisation tools</li>\n<li>Stakeholder Empathy Map</li>\n<li>Behavioural Systems Analysis</li>\n<li>Stakeholder Persona including Functional, Social and Emotional Jobs To Be Done (JTBD)</li>\n</ol>\n<p>Presentations and submitted slide decks will be assessed on the depth of cognitive empathy and insights emanating from the above processes and tools and the creativity of using experiments to identify and engage stakeholders to test and evaluate assumptions, hypotheses and insights. Student teams will deliver a 7-minute overview of their insights and conclusions in class and submit a detailed slide deck.</p>\n<p><strong>AI STATEMENT</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their spoken, written (and or audio visual) submission independent of AI tools.</p>\n<p>Students cannot have any audio visual (ie AI generated avatar) presenting any part of their assessment.</p>\n<p><strong>Please Note:</strong> The presentation will be recorded for marking purposes per UQ Policy.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "A2: Personal Reflection",
            "special_indicators": [],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p>Written Reflections throughout semester. Week 1 - Week 13</p>\n<p>Video Submission: 2:00 pm on 30/05/2025</p>\n<p>\n</p><p>More details on the submission date of the written reflections will be discussed during class.</p></dd>",
            "learning_objectives": null,
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Part 1 - Progressive Written Learning Journal</strong></p>\n<p>By the completion of the semester, each student will have submitted 7-10 written, (&lt;500-word) reflections, no more than 2 weeks apart summarising their progressive personal and project learning discovery, including:</p>\n<ol>\n<li>Assumptions and hypotheses tested;</li>\n<li>Insights discovered about stakeholders, problems and opportunities; and</li>\n<li>What they learned about themselves, their biases, strengths and weaknesses</li>\n</ol>\n<p><strong>Part 2 - Video reflection</strong></p>\n<p>In the last week of class, students will submit a 5-minute pre-recorded video (without slides) outlining the most surprising and valuable insights and discoveries they made about their</p>\n<ol>\n<li>Project;</li>\n<li>The Humble Discovery Process; and</li>\n<li>Themselves.</li>\n</ol>\n<p>Students should also reflect on the impact of this course on their future work and personal life.</p>\n<p><strong>AI STATEMENT</strong></p>\n<p>AI use is strictly prohibited be used in any form for this assessment.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Complete written journal reflections via Black Board app</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "A3: Final Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 11/06/2025 5:30 pm</p></dd>",
            "learning_objectives": null,
            "mode": "Oral, Written",
            "category": "Presentation, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Each team will prepare and present a 10-minute presentation, comprehensively summarising the primary insights gained throughout the course, along with 2-3 options that could be pursued to address the complex problem or value creation opportunity. In addition to the presentation, each team must submit either a detailed slide deck with explanatory notes and interview data as appendices OR a written report (5000-7,000 words) outlining all the qualitative and quantitative data collected and synthesised.</p>\n<p>the presentation and submitted report/slide deck must include:</p>\n<ol>\n<li>How the hypotheses and understanding of key stakeholders changed through the semester</li>\n<li>A detailed persona for the three most important stakeholders including the Primary Users/Beneficiaries, Financial Partner/Investor and one other, and evidence of their interest.</li>\n<li>Up to 3 options that future project proponents could pursue to ameliorate identified challenges and deliver unlocked latent opportunities.</li>\n<li>Results from experiments undertaken to engage and understand stakeholders and test potential solutions.</li>\n<li>A proposal for the preferred option with the next steps outlined.</li>\n<li>Interview data - A table listing all the interviews undertaken and the associated insights gained (in appendices).</li>\n</ol>\n<p><strong>AI STATEMENT</strong></p>\n<p>This task has been designed to be challenging, authentic and complex. Whilst students may use AI and/or MT technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</p>\n<p>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</p>\n<p>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools.</p>\n<p><strong>Please Note:</strong> The presentation will be recorded for marking purposes per UQ Policy.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>The entire team will deliver the presentation at the UQ City Campus. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Understanding and Influencing Human Behaviour – For good</strong><br/><p>As the world grapples with the uncertainty of the escalating polycrisis of geo-political tensions, income inequality, cost of living pressures, mental health challenges and global warming, we need leaders to respond with deep insight, novel ideas, new solutions and transformational innovations. Many of today’s MBA students are looking for more than just accelerating their career, more than just complying with minimum corporate social responsibilities and ESG. Consequently, many are shifting away from organisations offering the later without the former. In this first session, we will discuss that solving complex problems requires empathy, humility and contextual understanding to influence humans to change their behaviour. This is perhaps one of the hardest tasks leaders need to do. WE start this semester with an overview of the course and UQ's proprietary approach called Humble Discovery.</p></p></div></td>",
            "topic_title": "<strong>Understanding and Influencing Human Behaviour – For good</strong>",
            "topic_description": "Understanding and Influencing Human Behaviour – For good As the world grapples with the uncertainty of the escalating polycrisis of geo-political tensions, income inequality, cost of living pressures, mental health challenges and global warming, we need leaders to respond with deep insight, novel ideas, new solutions and transformational innovations. Many of today’s MBA students are looking for more than just accelerating their career, more than just complying with minimum corporate social responsibilities and ESG. Consequently, many are shifting away from organisations offering the later without the former. In this first session, we will discuss that solving complex problems requires empathy, humility and contextual understanding to influence humans to change their behaviour. This is perhaps one of the hardest tasks leaders need to do. WE start this semester with an overview of the course and UQ's proprietary approach called Humble Discovery.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Discovering and Understanding Your Who</strong><br/><p>This week we will explore the logic, methods, tactics and tools leaders need to navigate through the ambiguity and uncertainty of challenging BAU/Status Quo. We will introduce you to the field of ethnography; understanding people and their worlds and how you can use it to develop and deliver products and services that users, customers and stakeholders will use and love. To develop a new intervention that solves targeted stakeholders' problems or unlocks new value we need confidence and evidence we are solving the right problem or building something people will use. This week we will explore how to gather this evidence.</p>\n<p>An overview of the requirements for Assignment 1 will be provided.</p></p></div></td>",
            "topic_title": "<strong>Discovering and Understanding Your Who</strong>",
            "topic_description": "Discovering and Understanding Your Who This week we will explore the logic, methods, tactics and tools leaders need to navigate through the ambiguity and uncertainty of challenging BAU/Status Quo. We will introduce you to the field of ethnography; understanding people and their worlds and how you can use it to develop and deliver products and services that users, customers and stakeholders will use and love. To develop a new intervention that solves targeted stakeholders' problems or unlocks new value we need confidence and evidence we are solving the right problem or building something people will use. This week we will explore how to gather this evidence. An overview of the requirements for Assignment 1 will be provided.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Building Empathy with Stakeholders Through Mindful Deep Listening</strong><br/><p><strong>Building Empathy with Stakeholders with Deep Listening</strong></p>\n<p>In order to solve unsatisfied jobs, unresolved problems and unrealised or latent opportunities, one must ensure you are solving the right problem and gather evidence people will love what you're creating, before you create it. To do this you need to look beyond what is going on in the foreground, and instead look deeper inside and behind peoples words and behaviours to understand their motivations, fears, hopes and aspirations. </p>\n<p>In this session, we’ll explore the fundamentals of mindful listening as a tool for fostering empathy and deeper connections with stakeholders to gain insight into problems and opportunities. Mindful listening involves actively engaging with others and setting aside personal preconceptions to truly understand other people’s perspectives. The session will cover foundational techniques, for navigating difficult conversations, constructive responding for positive engagement, as well as a values clarification exercise to align listening practices with core values. Practical exercises will be provided for continued application.</p>\n<p>The key aim is to help you enhance both personal and professional interactions by allowing you to build a greater sense of mutual respect and connection with others. This promotes a supportive environment where stakeholders feel valued, heard, and understood.</p></p></div></td>",
            "topic_title": "<strong>Building Empathy with Stakeholders Through Mindful Deep Listening</strong>",
            "topic_description": "Building Empathy with Stakeholders Through Mindful Deep Listening Building Empathy with Stakeholders with Deep Listening In order to solve unsatisfied jobs, unresolved problems and unrealised or latent opportunities, one must ensure you are solving the right problem and gather evidence people will love what you're creating, before you create it. To do this you need to look beyond what is going on in the foreground, and instead look deeper inside and behind peoples words and behaviours to understand their motivations, fears, hopes and aspirations. In this session, we’ll explore the fundamentals of mindful listening as a tool for fostering empathy and deeper connections with stakeholders to gain insight into problems and opportunities. Mindful listening involves actively engaging with others and setting aside personal preconceptions to truly understand other people’s perspectives. The session will cover foundational techniques, for navigating difficult conversations, constructive responding for positive engagement, as well as a values clarification exercise to align listening practices with core values. Practical exercises will be provided for continued application. The key aim is to help you enhance both personal and professional interactions by allowing you to build a greater sense of mutual respect and connection with others. This promotes a supportive environment where stakeholders feel valued, heard, and understood.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Identifying Insights, Testing Assumptions and Finding Stakeholders</strong><br/><p>Perhaps the most important discovery we’ve made about challenging status quo is that we need to test every assumption and do not process until we have validated or invalidated our hypothesis. People are complex so this task is difficult. However, a number of methods, tools and tactics have been developed to enable innovators to test if their understanding of their stakeholders and associated problems and solutions are validate or not. This session is going to introduce you to a series of tools and tactics to increase the scale and extent of your capacity to discovery real problems needing solutions and strategies to exploit new opportunities.</p></p></div></td>",
            "topic_title": "<strong>Identifying Insights, Testing Assumptions and Finding Stakeholders</strong>",
            "topic_description": "Identifying Insights, Testing Assumptions and Finding Stakeholders Perhaps the most important discovery we’ve made about challenging status quo is that we need to test every assumption and do not process until we have validated or invalidated our hypothesis. People are complex so this task is difficult. However, a number of methods, tools and tactics have been developed to enable innovators to test if their understanding of their stakeholders and associated problems and solutions are validate or not. This session is going to introduce you to a series of tools and tactics to increase the scale and extent of your capacity to discovery real problems needing solutions and strategies to exploit new opportunities.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Discover Problems Worth Solving and Opportunities Worth Creating?</strong><br/><p>So how do we discover the right problems to solve and the best new opportunities, products and services to create that people will love? This is the most important question in the process of innovation and entrepreneurship and the hardest skill to develop. This week, we're going to learn how to interact with lots of people in such a way to “discover” their problems without asking them directly and “create” new opportunities they will love.</p></p></div></td>",
            "topic_title": "<strong>Discover Problems Worth Solving and Opportunities Worth Creating?</strong>",
            "topic_description": "Discover Problems Worth Solving and Opportunities Worth Creating? So how do we discover the right problems to solve and the best new opportunities, products and services to create that people will love? This is the most important question in the process of innovation and entrepreneurship and the hardest skill to develop. This week, we're going to learn how to interact with lots of people in such a way to “discover” their problems without asking them directly and “create” new opportunities they will love.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Solving Puzzles and Mysteries by Reducing Uncertainty and Ambiguity</strong><br/><p>Perhaps one of the most helpful ways we have come to understand how new, successful innovations emerge is by using the metaphors of puzzles and mysteries. This session will explore the difference between solving puzzles and mysteries and the best practice tools we have available to reduce ambiguity and uncertainty. Solving a jigsaw-like puzzle problem requires reducing ambiguity by collecting pieces of information or data and assembling them into a picture. The image and opportunity incrementally emerge as the pieces come together. Most innovation is done this way, continuously improving products and services but rarely transforming them. In contrast, disruptive and transformational products and services are often a surprise to incumbents because the insights are unexpected and unknowable in advance. These solutions are often created through cognitive inference, where a person links non-obvious ideas to create an unexpected product or service that embodies a new meaning that consumers, users and stakeholders love. </p></p></div></td>",
            "topic_title": "<strong>Solving Puzzles and Mysteries by Reducing Uncertainty and Ambiguity</strong>",
            "topic_description": "Solving Puzzles and Mysteries by Reducing Uncertainty and Ambiguity Perhaps one of the most helpful ways we have come to understand how new, successful innovations emerge is by using the metaphors of puzzles and mysteries. This session will explore the difference between solving puzzles and mysteries and the best practice tools we have available to reduce ambiguity and uncertainty. Solving a jigsaw-like puzzle problem requires reducing ambiguity by collecting pieces of information or data and assembling them into a picture. The image and opportunity incrementally emerge as the pieces come together. Most innovation is done this way, continuously improving products and services but rarely transforming them. In contrast, disruptive and transformational products and services are often a surprise to incumbents because the insights are unexpected and unknowable in advance. These solutions are often created through cognitive inference, where a person links non-obvious ideas to create an unexpected product or service that embodies a new meaning that consumers, users and stakeholders love.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Assignment 1 Presentation</strong><br/><p>Project teams deliver a 10-minute presentation to the class summarising their stakeholder empathy, insights and potential solutions.</p>\n<p>See assignment for details of the presentation.</p></p></div></td>",
            "topic_title": "<strong>Assignment 1 Presentation</strong>",
            "topic_description": "Assignment 1 Presentation Project teams deliver a 10-minute presentation to the class summarising their stakeholder empathy, insights and potential solutions. See assignment for details of the presentation.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Responsible Venture Creation </strong><br/><p>In this session, we will explore the tensions between doing good and doing well and between for profit and for purpose organisations.</p>\n<p>The global community has grown to accept the potential upsides and downsides of contemporary models of entrepreneurial disruption. Furthermore, the prevailing Neoliberal ideology justifies free markets, free trade, and limited societal governance for supposed corporate and community benefit. This has led to not only growing investment into startup activity but also an increasingly institutionalized myth that entrepreneurial disruption is inseparable from both positive and negative intended and unintended social and environmental consequences. By focusing on the possibility of ventures engaging in more responsible innovation, we aim to facilitate larger-scale societal transition toward a new ideology. We refer to this outcome as a responsible entrepreneurship ideology (REI), which facilitates innovations that do not harm and, ideally, benefit society.</p>\n<p><br/></p>\n<p>\n</p>\n\n      th, td {\n         position: relative;\n      }\n      th {\n         background: #f0f0f0;\n         border: 1px solid #dad7d7;\n         background-clip: padding-box;\n      }\n      td {\n         border: 1px solid lightgray;\n         padding: 4px;\n      }\n      .table-blot-wrapper {\n         position: relative;\n       }\n      .active-cell {\n        outline: 1px solid #066fa9;\n        background: rgba(193, 214, 253, 0.3);\n      }\n      .menu-placeholder {\n         position: absolute;\n         background: #dad7d7;\n         top: 50%;\n         transform: translateY(-50%);\n         right: 2px;\n         visibility: hidden;\n         z-index:1;\n         border-radius: 3px;\n         cursor: pointer;\n      }\n      .active-cell .menu-placeholder {\n       visibility:visible;\n      }\n      .cell-content {\n        line-height: 22px;\n        outline: none;\n        min-width: 120px;\n        min-height: 40px;\n        padding: 10px 0 10px 5px;\n      }\n      .table-operations-menu {\n        position: absolute;\n        width: 225px;\n        min-height: 100px;\n        top: 25px;\n        border-radius: 5px;\n        visibility: hidden;\n        padding: 10px 5px 10px 10px;\n        background: #fff;\n        box-shadow: -2px 2px 7px 0 rgba(0, 0, 0, 0.5);\n      }\n      .table-operations-menu-item {\n        padding: 4px 0;\n        cursor:pointer;\n        font-weight: normal;\n      }\n      .table-operations-menu-item img {\n        margin-right: 4px;\n        vertical-align: -4px;\n      }\n      .table-operations-menu-item.no-image {\n        padding-left: 24px;\n      }\n      .border-bottom {\n        border-bottom: 1px solid #dad7d7;\n        padding-bottom: 10px !important;\n        margin-bottom: 10px;\n      }\n      .set-background input {\n        width:14px;\n        height: 14px;\n        margin-right: 10px;\n        vertical-align: -2px;\n        cursor: pointer;\n      }\n      .color-box {\n        display: inline-block;\n        width: 20px;\n        height: 20px;\n        background: #f0f0f0;\n        border: solid 1px #dad7d7;\n        margin-left: 10px;\n        border-radius: 2px;\n        vertical-align: -4px;\n      }\n      .background-active {\n        background: #f0f0f0 !important;\n        outline: 1px solid #d7d7d7;\n      }\n      .text-format-item {\n        width: 20px !important;\n        display: inline-block;\n        margin-right: 5px;\n      }\n      .bold {\n        font-weight: bold !important;\n      }\n      .italic {\n        font-style: italic !important;\n      }\n      .underline {\n        text-decoration: underline !important;\n      }\n      .align-left {\n        text-align: left !important;\n      }\n      .align-right {\n        text-align: right !important;\n      }\n      .center {\n        text-align: center !important;\n      }\n    <p></p></p></div></td>",
            "topic_title": "<strong>Responsible Venture Creation </strong>",
            "topic_description": "Responsible Venture Creation In this session, we will explore the tensions between doing good and doing well and between for profit and for purpose organisations. The global community has grown to accept the potential upsides and downsides of contemporary models of entrepreneurial disruption. Furthermore, the prevailing Neoliberal ideology justifies free markets, free trade, and limited societal governance for supposed corporate and community benefit. This has led to not only growing investment into startup activity but also an increasingly institutionalized myth that entrepreneurial disruption is inseparable from both positive and negative intended and unintended social and environmental consequences. By focusing on the possibility of ventures engaging in more responsible innovation, we aim to facilitate larger-scale societal transition toward a new ideology. We refer to this outcome as a responsible entrepreneurship ideology (REI), which facilitates innovations that do not harm and, ideally, benefit society. th, td {\n         position: relative;\n      }\n      th {\n         background: #f0f0f0;\n         border: 1px solid #dad7d7;\n         background-clip: padding-box;\n      }\n      td {\n         border: 1px solid lightgray;\n         padding: 4px;\n      }\n      .table-blot-wrapper {\n         position: relative;\n       }\n      .active-cell {\n        outline: 1px solid #066fa9;\n        background: rgba(193, 214, 253, 0.3);\n      }\n      .menu-placeholder {\n         position: absolute;\n         background: #dad7d7;\n         top: 50%;\n         transform: translateY(-50%);\n         right: 2px;\n         visibility: hidden;\n         z-index:1;\n         border-radius: 3px;\n         cursor: pointer;\n      }\n      .active-cell .menu-placeholder {\n       visibility:visible;\n      }\n      .cell-content {\n        line-height: 22px;\n        outline: none;\n        min-width: 120px;\n        min-height: 40px;\n        padding: 10px 0 10px 5px;\n      }\n      .table-operations-menu {\n        position: absolute;\n        width: 225px;\n        min-height: 100px;\n        top: 25px;\n        border-radius: 5px;\n        visibility: hidden;\n        padding: 10px 5px 10px 10px;\n        background: #fff;\n        box-shadow: -2px 2px 7px 0 rgba(0, 0, 0, 0.5);\n      }\n      .table-operations-menu-item {\n        padding: 4px 0;\n        cursor:pointer;\n        font-weight: normal;\n      }\n      .table-operations-menu-item img {\n        margin-right: 4px;\n        vertical-align: -4px;\n      }\n      .table-operations-menu-item.no-image {\n        padding-left: 24px;\n      }\n      .border-bottom {\n        border-bottom: 1px solid #dad7d7;\n        padding-bottom: 10px !important;\n        margin-bottom: 10px;\n      }\n      .set-background input {\n        width:14px;\n        height: 14px;\n        margin-right: 10px;\n        vertical-align: -2px;\n        cursor: pointer;\n      }\n      .color-box {\n        display: inline-block;\n        width: 20px;\n        height: 20px;\n        background: #f0f0f0;\n        border: solid 1px #dad7d7;\n        margin-left: 10px;\n        border-radius: 2px;\n        vertical-align: -4px;\n      }\n      .background-active {\n        background: #f0f0f0 !important;\n        outline: 1px solid #d7d7d7;\n      }\n      .text-format-item {\n        width: 20px !important;\n        display: inline-block;\n        margin-right: 5px;\n      }\n      .bold {\n        font-weight: bold !important;\n      }\n      .italic {\n        font-style: italic !important;\n      }\n      .underline {\n        text-decoration: underline !important;\n      }\n      .align-left {\n        text-align: left !important;\n      }\n      .align-right {\n        text-align: right !important;\n      }\n      .center {\n        text-align: center !important;\n      }",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid-sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In Semester Break</strong><br/></p></div></td>",
            "topic_title": "<strong>In Semester Break</strong>",
            "topic_description": "In Semester Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Designing Innovative Solutions</strong><br/><p>This session will propose a framework for project teams to develop solutions for their targeted stakeholders that are desirable, feasible and viable.</p>\n<p>“Designing innovative solutions requires you to think differently. We will explore how you can shift your perspective on problems and opportunities to identify new pathways and increase their potential.” This session will include an ideation activity to start thinking about future products, services and business models.</p></p></div></td>",
            "topic_title": "<strong>Designing Innovative Solutions</strong>",
            "topic_description": "Designing Innovative Solutions This session will propose a framework for project teams to develop solutions for their targeted stakeholders that are desirable, feasible and viable. “Designing innovative solutions requires you to think differently. We will explore how you can shift your perspective on problems and opportunities to identify new pathways and increase their potential.” This session will include an ideation activity to start thinking about future products, services and business models.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10",
            "activity_type": "General contact hours",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Project Consultations with Lecturer and Facilitators</strong><br/><p>Project teams meet with lecturers mentors and course coordinators</p></p></div></td>",
            "topic_title": "<strong>Project Consultations with Lecturer and Facilitators</strong>",
            "topic_description": "Project Consultations with Lecturer and Facilitators Project teams meet with lecturers mentors and course coordinators",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Communicate New Opportunities for Maximum Engagement </strong><br/><p>This session will provide students with a process and tools to create a compelling presentation that engages an audience and convinces them your proposal is worth consideration.</p>\n<p><strong>Storyboarding for impact</strong></p>\n<p>Discover how to craft powerful narratives that resonate with decision makers by learning a strategy that goes beyond your own perspective. This workshop equips you with a repeatable approach, blending psychology and techniques from the arts to prepare compelling material confidently—even within tight timelines. You'll walk away with tools to align your message with what clients and investors need to see, helping you pitch successfully and persuasively.</p></p></div></td>",
            "topic_title": "<strong>Communicate New Opportunities for Maximum Engagement </strong>",
            "topic_description": "Communicate New Opportunities for Maximum Engagement This session will provide students with a process and tools to create a compelling presentation that engages an audience and convinces them your proposal is worth consideration. Storyboarding for impact Discover how to craft powerful narratives that resonate with decision makers by learning a strategy that goes beyond your own perspective. This workshop equips you with a repeatable approach, blending psychology and techniques from the arts to prepare compelling material confidently—even within tight timelines. You'll walk away with tools to align your message with what clients and investors need to see, helping you pitch successfully and persuasively.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Co-creating Solutions with Stakeholders</strong><br/><p>We need a system where new knowledge discovery, design, development and deployment occur through an interdependent community of stakeholders including researchers, industry, entrepreneurs, government, users and beneficiaries working together. It's only when the brightest minds in our society work alongside entrepreneurs and small, medium and large organisations and community members to co-create new products and services based on the latest understanding of how the world works and what the world needs.</p>\n<p><br/></p></p></div></td>",
            "topic_title": "<strong>Co-creating Solutions with Stakeholders</strong>",
            "topic_description": "Co-creating Solutions with Stakeholders We need a system where new knowledge discovery, design, development and deployment occur through an interdependent community of stakeholders including researchers, industry, entrepreneurs, government, users and beneficiaries working together. It's only when the brightest minds in our society work alongside entrepreneurs and small, medium and large organisations and community members to co-create new products and services based on the latest understanding of how the world works and what the world needs.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Final Project Presentations</strong><br><p>Students will present the outcome from their semesters work based on the assignment 3 criteria.</p></br></p></div></td>",
            "topic_title": "<strong>Final Project Presentations</strong>",
            "topic_description": "Final Project Presentations Students will present the outcome from their semesters work based on the assignment 3 criteria.",
            "learning_outcomes": []
        }
    ]
}