{
    "url": "https://course-profiles.uq.edu.au/course-profiles/MKTG7502-20084-7520",
    "full_course_code": "MKTG7502-20084-7520",
    "course_code": "MKTG7502",
    "class_code": "20084",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "explain strategic brand marketing concepts, principles, and application"
        },
        {
            "number": "LO2.",
            "description": "conduct analysis of brand evidence to evaluate brand strategy"
        },
        {
            "number": "LO3.",
            "description": "justify strategic choices to maintain and grow brand equity in a range of business contexts"
        },
        {
            "number": "LO4.",
            "description": "develop group work and communication skills to consider alternative perspectives in brand analysis and decision making"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "In-Semester Concept Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "25%",
            "due_date": "In-semester Saturday29/03/2025 - 12/04/2025",
            "learning_objectives": "L01",
            "mode": "Written",
            "category": "Examination",
            "task_description": "The In-Semester Exam will be centrally scheduled on a Saturday during the central In-Semester Exam period.The In-Semester Exam will cover the course content from weeks 1 to 6. However if the exam is scheduled on the earliest Saturday, it will only cover weeks 1 to 5. More details will be given when the In-Semester Exam scheduled is released.This includes the following 8 chapters from your course textbook: 1, 2, 3, 4, 5, 6, 9 and 10.AI Statement:This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "You may be able todefer this exam.",
            "deferral_or_extension": "You may be able todefer this exam.",
            "late_submission": "You will receive a mark of 0 if this assessment issubmitted late.",
            "additional_info": "You may be able to\ndefer this exam\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Brand Strategy Audit",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "40%",
            "due_date": "Week 11 - Week 13In tutorials in Weeks, 11, 12 and 13.",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Oral, Product/ Artefact/ Multimedia",
            "category": "Presentation, Project",
            "task_description": "Students will practice with and apply the brand strategy theory and methods from the course to a brand of their choosing from a pre-approved list.This is a team project with 4-5 students per group.In teams, students will research brand evidence, conduct a focus group with students in their tutorial as participants, analyse the focus group data and prepare a multimodal (PowerPoint) presentation of their findings with strategic recommendations for their chosen brand, which all team members will present during a live oral presentation during tutorials to their tutorial classmates and tutor. Students will analyse the current brand strategy and make recommendations for brand strategy planning.Please Note:The presentation will be recorded for marking purposes per UQ Policy.Detailed project guidelines will be available on Blackboard. Student teams will present their completed brand strategy audit in class time during their allocated weeks during tutorial 10 (week 11) and tutorial 11 (week 12). Tutorial 12 will be usedonlyfor groups that missed their presentation in tutorials 10 and 11 (week 11 and 12).Peer Assessment.It is important that groups work well together and that everyone does their fair share of the work. This course uses the UQ Group Peer Assessment tool called Buddycheck. All students must complete Buddycheck on Blackboard.  If the peer assessment result indicates that a team member has not been doing their fair share of the work, theirmarks may be adjusted downwardbased on peer assessment results. Peer assessment forms are due by the end of the day after your project presentation. To facilitate a shared understanding about how the team will function, team members should agree on a team charter for how the team will operate (a model team charter will be provided as a starter for your team). If your group is having problems, see your tutor as early as possible. If you fear that your team may assess you unfairly, it is important to discuss this with your tutor well before the project is finished.For help with how to effectively function in teams by building teams and managing team conflict see the online edX course “Working in Teams: A Practical Guide”www.edx.org/course/working-in-teams-a-practical-guide(link on the Blackboard website).AI Statement:This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "Presentations will be performed during scheduled tutorial times, as per the schedule. One member of the group will submit a copy of the group presentation slides on the day of the presentation via the Learn.UQ site. All presentations will be audio and video recorded by the tutor for the purpose of moderation and potential re-marking as per University requirements.",
            "deferral_or_extension": "You cannot defer or apply for an extension for this assessment.",
            "late_submission": "You will receive a mark of 0 if this assessment issubmitted late.",
            "additional_info": "You cannot defer or apply for an extension for this assessment."
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Final Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "35%",
            "due_date": "End of Semester Exam Period7/06/2025 - 21/06/2025",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Examination",
            "task_description": "The final assessment will be a formal exmination to be held during exam week. The exam may include multiple choice questions, short answer questions and/or a case study. All content covered in the course may be drawn upon for the topics. Further details will be discussed during the semester, particularly in the lecture for week 13 and noted in the Assessment folder in Blackboard.Students are advised to allow enough time in their schedule for preparation which should focus on reviewing all the topics covered in the course.AI Statement:This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "You may be able todefer this exam.",
            "deferral_or_extension": "You may be able todefer this exam.",
            "late_submission": null,
            "additional_info": "You may be able to\ndefer this exam\n."
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Lecture",
            "topic": "Course introductionIntroduction to branding, considering brand management perspectives and contexts. Course assessment overview and resources to support the assessment.Read text Chapter 1.Learning outcomes:L01, L04",
            "topic_title": "Course introduction",
            "topic_description": "Introduction to branding, considering brand management perspectives and contexts. Course assessment overview and resources to support the assessment.\nRead text Chapter 1.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Tutorial",
            "topic": "Course introductionIntroduce yourself to your peers and tutor.Introduction to tutorial expectations, technology and plans.Course assessment overview, discuss A1 and A2 task and marking rubrics.Initial group formation and brand choice discussions for A2.Learning outcomes:L01, L04",
            "topic_title": "Course introduction",
            "topic_description": "Introduce yourself to your peers and tutor. \nIntroduction to tutorial expectations, technology and plans.\nCourse assessment overview, discuss A1 and A2 task and marking rubrics. \nInitial group formation and brand choice discussions for A2.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Tutorial",
            "topic": "Brand equity and brand positioningExploring brand equity in practice and consider brand positioning.Refine groups and discuss the role of the peer review process for A2.Concept check on CBBE and financial equity.Overview of referencing guidelines for A2.Learning outcomes:L01, L02, L04",
            "topic_title": "Brand equity and brand positioning",
            "topic_description": "Exploring brand equity in practice and consider brand positioning.\nRefine groups and discuss the role of the peer review process for A2.\nConcept check on CBBE and financial equity.\nOverview of referencing guidelines for A2.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Tutorial",
            "topic": "Brand Resonance and AuditPractical activities to understand resonance and to conduct a brand audit, including discussion of the major assessment.A2 group finalisation and registration, with group contracts and brand choice due in tutorials.Learning outcomes:L01, L02, L03",
            "topic_title": "Brand Resonance and Audit",
            "topic_description": "Practical activities to understand resonance and to conduct a brand audit, including discussion of the major assessment.\nA2 group finalisation and registration, with group contracts and brand choice due in tutorials.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Tutorial",
            "topic": "Brand Strategy Designing ElementsPractical discussions and activities to understand the nuances of brand elements and to explore marketing of the brand.A2 focus groups commence: In your group, you will collect focus group data from your tutorial classmates during your tutorial. Focus group order will be pre-determined either by groups volunteering to present first or random allocation. All group members must come ready to collect data.Learning outcomes:L01, L02, L03",
            "topic_title": "Brand Strategy Designing Elements",
            "topic_description": "Practical discussions and activities to understand the nuances of brand elements and to explore marketing of the brand.\nA2 focus groups commence: In your group, you will collect focus group data from your tutorial classmates during your tutorial. Focus group order will be pre-determined either by groups volunteering to present first or random allocation. All group members must come ready to collect data.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Tutorial",
            "topic": "Brand Strategy Using Marketing ProgramsA2 focus groups continue: In your group, you will collect focus group data from your tutorial classmates during your tutorial. Focus group order will be pre-determined either by groups volunteering to present first or random allocation. All group members must come ready to collect data.A1 information, plus example questions.Learning outcomes:L01, L02, L04",
            "topic_title": "Brand Strategy Using Marketing Programs",
            "topic_description": "A2 focus groups continue: In your group, you will collect focus group data from your tutorial classmates during your tutorial. Focus group order will be pre-determined either by groups volunteering to present first or random allocation. All group members must come ready to collect data.\n\nA1 information, plus example questions.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Tutorial",
            "topic": "Brand Marketing CommunicationActivities to explore the ways in which brands are communicated to their customer, digital brands and digital branding practices. A2 focus groups for those yet to present.In-class time to work on your group assessment with your tutor present.Learning outcomes:L01, L02, L03, L04",
            "topic_title": "Brand Marketing Communication",
            "topic_description": "Activities to explore the ways in which brands are communicated to their customer, digital brands and digital branding practices. A2 focus groups for those yet to present. \nIn-class time to work on your group assessment with your tutor present.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Tutorial",
            "topic": "Measuring Brand EquityActivities for measuring brand equity. (Chapters 10 and 11)In-class time to work on your group assessment with your tutor present.Good Friday Public Holiday - Friday 18 April 2025- Check Blackboard for announcements about affected classes.Learning outcomes:L01, L02, L03, L04",
            "topic_title": "Measuring Brand Equity",
            "topic_description": "Activities for measuring brand equity. (Chapters 10 and 11)\nIn-class time to work on your group assessment with your tutor present.\nGood Friday Public Holiday - Friday 18 April 2025 - Check Blackboard for announcements about affected classes.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Mid-sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "In-Semester Break",
            "topic_title": "In-Semester Break",
            "topic_description": "",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Tutorial",
            "topic": "Managing Brands Over Time, Geography, and SegmentsActivities for managing brands over time, geography and segments.In-class time to work on A2 with your tutor present.Learning outcomes:L01, L02, L03, L04",
            "topic_title": "Managing Brands Over Time, Geography, and Segments",
            "topic_description": "Activities for managing brands over time, geography and segments.\nIn-class time to work on A2 with your tutor present.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Tutorial",
            "topic": "Branding in the Digital EraActivities involving digital brands and digital branding practices.A2 final Q&A session.Discuss features of effective oral presentations and considerations for designing effective PowerPoint slides.Labour Day Public Holiday - Monday 5 May 2025- Check Blackboard for announcements about affected classes.Learning outcomes:L01, L02, L03, L04",
            "topic_title": "Branding in the Digital Era",
            "topic_description": "Activities involving digital brands and digital branding practices.\nA2 final Q&A session.\nDiscuss features of effective oral presentations and considerations for designing effective PowerPoint slides.\nLabour Day Public Holiday - Monday 5 May 2025 - Check Blackboard for announcements about affected classes.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Tutorial",
            "topic": "In-class PresentationsA2 due this week during tutorials via in-class group presentations. All group members must be ready to present. Group presentation order will be pre-determined either by students volunteering or random allocation where no volunteers are present. Note: Peer review is also due at the time of your A2 group presentation.Learning outcomes:L01, L02, L03, L04",
            "topic_title": "In-class Presentations",
            "topic_description": "A2 due this week during tutorials via in-class group presentations. All group members must be ready to present. Group presentation order will be pre-determined either by students volunteering or random allocation where no volunteers are present. Note: Peer review is also due at the time of your A2 group presentation.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Tutorial",
            "topic": "In-Class Presentations. Secondary Associations, Brand Equity GrowthA2 presentations during tutorials via in-class group presentations only for groups that missed their presentation last week.Learning outcomes:L01, L02, L03, L04",
            "topic_title": "In-Class Presentations. Secondary Associations, Brand Equity Growth",
            "topic_description": "A2 presentations during tutorials via in-class group presentations only for groups that missed their presentation last week.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Tutorial",
            "topic": "New Products, Brand Extensions, and Course ReviewDiscussion of new products and brand extensions.Course review and A3 preparation with Q&A.Any groups yet to present A2 will present this week.Learning outcomes:L01, L02, L03, L04",
            "topic_title": "New Products, Brand Extensions, and Course Review",
            "topic_description": "Discussion of new products and brand extensions. \nCourse review and A3 preparation with Q&A. \nAny groups yet to present A2 will present this week.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}