{
    "course_title": "Innovation Leadership",
    "study_period": "Sem 1 2025",
    "location": "Brisbane City",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/TIMS7811-22499-7520",
    "full_course_code": "TIMS7811-22499-7520",
    "course_code": "TIMS7811",
    "class_code": "22499",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Work collaboratively to present a novel analysis of the nature of innovation."
        },
        {
            "number": "LO2.",
            "description": "Critically evaluate the nature and context of the innovation process and how it is changing."
        },
        {
            "number": "LO3.",
            "description": "Apply innovative frameworks and theories to create and communicate insights into innovation strategy for an organisation."
        },
        {
            "number": "LO4.",
            "description": "Develop an innovation strategy for an organisation."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "A1: Innovation Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> 30/04/2025 5:30 pm</p></dd>",
            "learning_objectives": "L01, L02, L03",
            "mode": "Oral, Product/ Artefact/ Multimedia",
            "category": "Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Overview</strong></p>\n<p>This team-based assignment challenges you to explore less conventional forms of innovation—not products or services—and examine their broader impacts. Your team will create a photo essay that visually and analytically presents an innovation, identifying its enablers, beneficiaries, and potential disruptions. The aim is to provoke deeper thinking about innovation’s complexity, its ripple effects across industries, and its influence on society. Consider looking for examples close to home—perhaps from your own professional backgrounds or industries your team is familiar with. </p>\n<p><strong>Assignment Structure</strong></p>\n<p><strong>Part 1: Identifying and Showcasing an Innovation</strong></p>\n<p>Choose an innovation that is not a product or service but represents a new way of doing things (e.g. innovations in policy, infrastructure, societal systems, cultural practices, or production processes). Take or source a photo that visually represents the innovation.</p>\n<p>In your presentation, describe:</p>\n<ul>\n<li>What the innovation is.</li>\n<li>What makes it innovative.</li>\n<li>Why it is significant, focusing on its business and economic implications rather than purely technological aspects.<strong> </strong></li>\n</ul>\n<p><strong>Part 2: Exploring Its Enablers</strong></p>\n<p>Identify 3-5 enablers that made this innovation possible (e.g. supporting infrastructure, economic conditions, cultural factors, policy changes, or enabling technologies). Use photos to illustrate these enablers.</p>\n<p>Discuss the role of each enabler in supporting the innovation, including any advantages or disadvantages they bring.<strong> </strong></p>\n<p><strong>Part 3: Analysing the Beneficiaries</strong></p>\n<p>Show 2-4 images depicting those who benefit from this innovation (e.g. individuals, organisations, industries, or communities). Explain how the innovation creates value by:</p>\n<ul>\n<li>Solving problems ('pain relievers').</li>\n<li>Creating new opportunities ('gain creators').</li>\n<li>Considering any negative externalities (e.g. unintended consequences, ethical considerations).</li>\n</ul>\n<p><strong>Part 4: Evaluating Potential Disruptions</strong></p>\n<p>Use 2-4 images to show areas of the economy, industries, or organisations that are disrupted or threatened by this innovation. Analyse the impact of these disruptions, applying relevant theories of innovation and competitive dynamics.</p>\n<p>Discuss the long-term implications for affected sectors.</p>\n<p><strong>Presentation Requirements</strong></p>\n<ul>\n<li>Your team will present the photo essay in class, with each team member contributing to either the content creation or delivery.</li>\n<li>Not all members need to present, but all must contribute and be present for Q&amp;A.</li>\n<li>Your slides must be uploaded to Blackboard before class begins.</li>\n</ul>\n<p>Tip: Engage your audience! Use clear visuals, storytelling techniques, and compelling analysis to make your presentation impactful.<strong> </strong></p>\n<p><strong>Photo Guidelines</strong></p>\n<ul>\n<li>Wherever possible, take original photos to strengthen your analysis.</li>\n<li>If original photos are not feasible, you may use online images, ensuring they are credited appropriately.</li>\n<li>The quality of the photos is less important than their clarity and relevance to your argument.<strong> </strong></li>\n</ul>\n<p><strong>Peer Review Requirement</strong></p>\n<ul>\n<li>Each student must submit an individual peer evaluation via Blackboard.</li>\n<li>Failure to submit a peer review will result in a zero score for both the team presentation and the Innovation Strategy Report.</li>\n</ul>\n<p>Why Peer Review? This ensures fair contribution across team members and encourages collaborative leadership, accountability, and reflection.</p>\n<p><strong>Marking Rubric is available on Blackboard  </strong></p>\n<p><strong>AI Statement</strong></p>\n<p>This assignment is designed to be challenging, authentic, and complex, requiring critical engagement beyond AI-generated content.</p>\n<ul>\n<li>You may use AI or MT tools to assist with organising ideas, structuring analysis, or enhancing presentation design.</li>\n<li>However, all insights and critical thinking must be your own—you must demonstrate independent comprehension in your work.</li>\n<li>Failure to reference AI use may constitute academic misconduct under the Student Code of Conduct.</li>\n</ul>\n<p><strong>Final Reminders</strong></p>\n<ul>\n<li>Choose a unique, thought-provoking innovation—challenge conventional ideas.</li>\n<li>Use clear visuals and strong analysis to tell a compelling story.</li>\n<li>Collaborate effectively—all team members must contribute meaningfully.</li>\n<li>Submit slides on Blackboard before class—no late submissions accepted.</li>\n<li>Be ready for Q&amp;A—demonstrate your deep understanding of the innovation.</li>\n</ul>\n<p>Tip: Need inspiration? Check out Lecture 1’s examples or look for unconventional innovations in your industry!</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>One team member per group has to upload the slides to Blackboard BEFORE the presentation.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "A2: Reflective Practice",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 21/05/2025 5:30 pm</p></dd>",
            "learning_objectives": "L02, L03",
            "mode": "Written",
            "category": "Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Overview</strong></p>\n<p>This individual assignment requires you to write a 1,500-word reflective essay based on your experience with the Back Bay Battery online innovation strategy simulation. The objective is to critically analyse the challenges and insights gained from managing innovation transitions and relate them to relevant academic literature and workplace practice.</p>\n<p>The simulation models the transition from an existing business to a new, innovative model. While this example focuses on a product, its principles apply equally to any business navigating Horizon 2 innovations. Your essay must demonstrate analytical depth, drawing connections between simulation experience, innovation themes, and real-world business applications.</p>\n<p><strong>Task Description</strong></p>\n<p>Your reflective essay should address the following key areas:</p>\n<ol>\n<li>Simulation Experience: Describe your experience with the simulation. What challenges did you encounter? What decisions were particularly difficult, and why?</li>\n<li>Innovation Themes: How did the simulation reflect key innovation concepts discussed in class? Consider:</li>\n<li>The Christensen framework on disruptive innovation.</li>\n<li>The challenges of integrating a Horizon 2 innovation into Horizon 1 (Refer to Moore, Geoffrey A. \"To Succeed in the Long-Term, Focus on the Middle-Term,” Harvard Business Review, 2006).</li>\n<li>Lessons about managing disruptive innovation.</li>\n<li>Workplace Reflection: Based on your simulation insights, how can the lessons be applied to managing innovation and technological change in your current or previous workplace?</li>\n</ol>\n<p>The essay must follow proper academic formatting and use APA referencing style. A descriptive summary will not be sufficient—you will be assessed on your ability to analyse, synthesise, and evaluate experiences against the simulation and relevant literature.</p>\n<p><strong>Simulation Process</strong></p>\n<ol>\n<li>You will play introductory and an advanced scenarios of the Back Bay Battery simulation.</li>\n<li>The advanced scenario will have adjusted settings to encourage deeper understanding of the principles at play.</li>\n<li>You will have access to the simulation via your Harvard Business account (details provided on Blackboard).</li>\n<li>Use your experiences in both rounds to develop insights for your reflective essay.</li>\n</ol>\n<p> <strong>Assessment Marking Rubric is available on Blackboard</strong></p>\n<p><strong> AI Statement</strong></p>\n<ul>\n<li>This assignment requires critical reflection and original analysis. While AI or MT tools may assist with structuring or refining ideas, your essay must demonstrate independent critical thinking and synthesis of learning.</li>\n<li>All AI or MT use must be referenced appropriately. Failure to disclose AI assistance may constitute academic misconduct.</li>\n<li>Plagiarism or over-reliance on AI-generated content will result in penalties. Your essay should reflect your own interpretation and understanding of the simulation and related concepts.</li>\n</ul>\n<p><strong>Final Reminders</strong></p>\n<p>Ensure your essay is analytical, not just descriptive.</p>\n<p>Use high-quality academic sources in your discussion.</p>\n<p>Submit on time via Blackboard.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit individually through Turnitin and the Blackboard Assessment link.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "A3: Innovation Strategy Consultating Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p> 9/06/2025 3:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Thesis",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Overview</strong></p>\n<p>This major assignment is designed to assess your ability to critically evaluate innovation strategies, commercialisation processes, or industry innovation projects. You will select one of three assignment options and submit a comprehensive report. The task requires you to apply innovation frameworks, business model design principles, and strategic recommendations in a real-world or entrepreneurial setting.</p>\n<p>Submission Details</p>\n<p>- Word Count: 2,500 words (Option 1) / 3,500 words (Options 2 &amp; 3)</p>\n<p>- Submission: Electronically via Blackboard</p>\n<p>- Weighting: 50% of total course grade</p>\n<p><strong>Assignment Options</strong></p>\n<p><strong>Option 1 – Innovation Strategy or Process Report</strong></p>\n<p>Evaluate the innovation strategy of a self-selected organisation (preferably your current or past employer) using the Innovation Value Chain framework or other analytical tools from the course. Specifically:</p>\n<ul>\n<li>Submit a one-page proposal (before Session 4) on Blackboard, detailing your selected organisation, objectives, and expected outcomes. (Not graded but mandatory.)</li>\n<li>Assess the current state of innovation strategy in the organisation, identifying a key theme for analysis (e.g. innovation culture, ideation process, measuring innovation, etc.).</li>\n<li>Provide strategic recommendations for improvement, ensuring they are clear, implementable, and based on data-driven insights. Your recommendations should be focused and high-value, avoiding broad, generic advice.</li>\n</ul>\n<p><strong>Option 2 – Innovation Commercialisation or Startup: Business Model Validation</strong></p>\n<p>Develop and validate an innovation that solves a business challenge for your employer or represents a viable entrepreneurial startup. Your analysis must cover desirability (user value), feasibility (business execution), and viability (sustainability).</p>\n<ul>\n<li>Submit a one-page proposal (before Session 4) on Blackboard, describing your idea, the problem it solves, and why your chosen organisation is well-positioned to execute it. (Not graded but mandatory.)</li>\n<li>Test and iterate your idea using evidence-based methods (e.g. lean canvas, customer interviews, competitor analysis, journey mapping). Document your process, insights, and final learnings.</li>\n<li>Make a persuasive case for funding or executive buy-in, presenting clear evidence for why your innovation should be pursued.</li>\n</ul>\n<p><strong>Option 3 – Innovation Team Project Report for an Industry Partner</strong></p>\n<p>Work with an industry partner on a real-world innovation project. Industry partners will present project proposals in Week 3, after which students can apply to participate. Selected teams will work closely with the industry partner and submit a detailed Innovation Strategy Report.</p>\n<ul>\n<li>Submit a one-page motivation statement (before Session 4) explaining why you should be selected for a project.</li>\n<li>Develop a project scope agreement (Week 5) outlining objectives, methodology, deliverables, and constraints.</li>\n<li>Present preliminary findings to the industry partner and lecturer in Week 13 for feedback before final report submission.</li>\n<li>Submit a concise and structured report addressing the industry partner’s key objectives while maintaining academic rigour.</li>\n</ul>\n<p><strong>Assessment Criteria will be provided on Blackboard</strong></p>\n<p><strong>AI Statement</strong></p>\n<p>This assignment requires independent analysis and strategic decision-making. While AI tools may support your research and writing, your work must demonstrate critical thinking and synthesis of concepts.</p>\n<ul>\n<li>All AI use must be acknowledged and referenced. Unreferenced AI-generated content may constitute academic misconduct.</li>\n<li>Plagiarism or over-reliance on AI tools will be penalised. Your report should reflect your own strategic understanding and engagement with the material.</li>\n</ul>\n<p><strong>Final Reminders</strong></p>\n<p>Select the option that best aligns with your career goals and interests.</p>\n<p>Ensure your report is analytical, structured, and well-supported by evidence.</p>\n<p>If working with an industry partner, maintain professionalism and confidentiality.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>All individual submissions (Options 1 and 2) are made to blackboard on the appropriate submission link. For the team project (Option 3) only one submission of the project report per team on Blackboard but each student should complete the Peer Assessment evaluations on Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>What is innovation and why is it important?</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03, L04</p></div></td>",
            "topic_title": "<strong>What is innovation and why is it important?</strong>",
            "topic_description": "What is innovation and why is it important?",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Creativity, Ideation and the Innovation Process</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>Creativity, Ideation and the Innovation Process</strong>",
            "topic_description": "Creativity, Ideation and the Innovation Process",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Strategy under uncertainty</strong><br/><p>Industry Partner Presentation TBC</p>\n<p>Back Bay Battery - First introductory scenario with 20 simulation runs</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Strategy under uncertainty</strong>",
            "topic_description": "Strategy under uncertainty Industry Partner Presentation TBC Back Bay Battery - First introductory scenario with 20 simulation runs",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Effectuation</strong><br/><p>Also submit your Major Assessment Option Selection via Blackboard: OPTION 1: Target organisation selection and innovation strategy report objectives. OPTION 2: Innovation commercialisation or startup – innovative business model. OPTION 3: Industry Partner Project Participation Motivation.</p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Effectuation</strong>",
            "topic_description": "Effectuation Also submit your Major Assessment Option Selection via Blackboard: OPTION 1: Target organisation selection and innovation strategy report objectives. OPTION 2: Innovation commercialisation or startup – innovative business model. OPTION 3: Industry Partner Project Participation Motivation.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Business models and Lean Startup</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Business models and Lean Startup</strong>",
            "topic_description": "Business models and Lean Startup",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Design Thinking</strong><br/><p>Back Bay Battery - Intermediate scenario with 20 simulation runs</p>\n<p>OPTION 3 - project scoping agreements due - email lecturer</p></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>Design Thinking</strong>",
            "topic_description": "Design Thinking Back Bay Battery - Intermediate scenario with 20 simulation runs OPTION 3 - project scoping agreements due - email lecturer",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Disruptive Innovation and Business Model Inn</strong><br/></p><p><strong>Learning outcomes:</strong> L01, L02, L03</p></div></td>",
            "topic_title": "<strong>Disruptive Innovation and Business Model Inn</strong>",
            "topic_description": "Disruptive Innovation and Business Model Inn",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Business Model Innovation in Practice</strong><br/><p>Back Bay Battery - Advanced scenario with 20 simulation runs</p></p><p><strong>Learning outcomes:</strong> L03, L04</p></div></td>",
            "topic_title": "<strong>Business Model Innovation in Practice</strong>",
            "topic_description": "Business Model Innovation in Practice Back Bay Battery - Advanced scenario with 20 simulation runs",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Mid-sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-Semester Break</strong><br/></p></div></td>",
            "topic_title": "<strong>In-Semester Break</strong>",
            "topic_description": "In-Semester Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Workshop",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Photo essay presentations</strong><br/><p>Submit peer reviews within two days of presentations</p></p><p><strong>Learning outcomes:</strong> L03</p></div></td>",
            "topic_title": "<strong>Photo essay presentations</strong>",
            "topic_description": "Photo essay presentations Submit peer reviews within two days of presentations",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Innovation Strategy Implementation</strong><br/></p><p><strong>Learning outcomes:</strong> L03, L04</p></div></td>",
            "topic_title": "<strong>Innovation Strategy Implementation</strong>",
            "topic_description": "Innovation Strategy Implementation",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>10.\tNetworking, Open Innovation and Collaboration</strong><br/></p><p><strong>Learning outcomes:</strong> L02, L03</p></div></td>",
            "topic_title": "<strong>10.\tNetworking, Open Innovation and Collaboration</strong>",
            "topic_description": "10.\tNetworking, Open Innovation and Collaboration",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Profiting from Innovation (IPR), Financing and Measuring Innovation</strong><br/><p>Reflective essay on simulation exercise submitted via Blackboard</p></p><p><strong>Learning outcomes:</strong> L02</p></div></td>",
            "topic_title": "<strong>Profiting from Innovation (IPR), Financing and Measuring Innovation</strong>",
            "topic_description": "Profiting from Innovation (IPR), Financing and Measuring Innovation Reflective essay on simulation exercise submitted via Blackboard",
            "learning_outcomes": [
                "L02"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>13.\tRevision and BBB Simulation Feedback </strong><br/><p>OPTION 3 - Industry Partner Project Presentation</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>13.\tRevision and BBB Simulation Feedback </strong>",
            "topic_description": "13.\tRevision and BBB Simulation Feedback OPTION 3 - Industry Partner Project Presentation",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}