{
    "url": "https://course-profiles.uq.edu.au/course-profiles/TIMS1301-20348-7520",
    "full_course_code": "TIMS1301-20348-7520",
    "course_code": "TIMS1301",
    "class_code": "20348",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Develop foundational knowledge in the area of entrepreneurship."
        },
        {
            "number": "LO2.",
            "description": "Understand how to develop and evaluate actionable business opportunities, including how to identify, create, evaluate and bring to market such opportunities as an effective contributor to a startup team."
        },
        {
            "number": "LO3.",
            "description": "Create viable and innovative Business Models to action entrepreneurial opportunities."
        },
        {
            "number": "LO4.",
            "description": "Critically reflect how knowledge is created in the startup process."
        },
        {
            "number": "LO5.",
            "description": "Recognise the inherent risks and uncertainties in the process of new venture creation."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Understanding the customer problem",
            "special_indicators": [],
            "weighting": "30%",
            "due_date": "4/04/2025 1:00 pm",
            "learning_objectives": "L01, L02",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Paper/ Report/ Annotation, Practical/ Demonstration",
            "task_description": "Assignment: Understanding the customer problemUnderstanding the customer problem is crucial in entrepreneurship as it helps to ensure that the entrepreneurial venture:is solving a pressing problem where customers are willing to pay for a solution. Understanding the customer problem helps startups validate if their product is solving a real problem and if there is a market for it. If a startup has a deep understanding of the customer problem, it can create a product or service that truly addresses their needs, which will result in better customer satisfaction and ultimately drive revenue.has a deep understanding of the problem they are trying to solve. Understanding the customer problem provides valuable insights into the customer's pain points and how they view the problem. This information can be used as a starting point for creating a unique value proposition and a proposed solution.This assignment requires you to develop a 1200-word explanation of a customer problem and a tentative solution to this problem. This explanation of your customer problem should be based on customer discovery interviews which should aim to unearth unique information about the customer/ client. The assignment requires individual students to collect primary data through two (2) 15-,minute customer discovery in-depth interviews. These 15-minute interviews should be conducted with cameras on within Zoom or Teams (using UQ student account). The recording and transcript of the interviews as well as a written submission should provide a summary of insights obtained in the interviews. A template will be provided in Blackboard.AI Statement:Students are not allowed to to use Artificial Intelligence (AI) in the preparation or delivery of this assessment task.Read full task descriptionHide full task description",
            "submission_guidelines": "Via Blackboard",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Developing a Business Opportunity Pitch & Journey",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "40%",
            "due_date": "24/05/2025 8:00 am",
            "learning_objectives": "L02, L03",
            "mode": "Oral, Product/ Artefact/ Multimedia",
            "category": "Presentation, Poster",
            "task_description": "Developing a business opportunity in the form of a Business Opportunity Pitch- TIMS1301 Pitch Day.In teams of six (6), students are required to work towards developing and investigating a business opportunity that solves a customer problem and demonstrates inclusive entrepreneurship. The assessment takes the form of a pitch presentation e.g. Powerpoint to be delivered on campus (Terrace Room, Sir Llew Edwards building) on the Saturday at the end of Week 11.The team should present a Powerpoint presentation and a fully-completed Business Model Canvas as a poster/handout to explain to an investor the journey taken to develop this business opportunity.Students' teams are expected to enrol into and present at one (1) of three (3) 2-hour sessions held on Saturday, 17th may. A Padlet will be provided in the Assessment folder to facilitate sign-up. The presentation sequence will be decided on the day. Each member of the team is expected to be in attendance as each individual student will be assessed on their verbal and non-verbal communication during the pitch and in the Q&A.Full details of the assignment, including pitch duration, will be provided on Blackboard. Course workshops will actively support the development of this assignment so students are strongly encouraged to make workshop attendance a top priority.Please Note:The presentation will be recorded for marking purposes per UQ Policy.AI Statement:Students are not allowed to to use Artificial Intelligence (AI) in the preparation or delivery of this assessment task.Read full task descriptionHide full task description",
            "submission_guidelines": "Student teams will be expected to upload their presentation slides by 8am on the Pitch Day. A link will be made available via Blackboard.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Reflecting Upon the Theory and Practice of Entrepreneurship",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "30%",
            "due_date": "End of Semester Exam Period7/06/2025 - 21/06/2025",
            "learning_objectives": "L04, L05",
            "mode": "Written",
            "category": "Examination",
            "task_description": "Over the course of the semester, students will be expected to engage in entrepreneurial processes, to use concepts and theories that support ideation, and to develop an entrepreneurial mindset that can respond to setbacks and challenges. At the end of the semester, students will be asked to sit an examination and demonstrate their understanding of the theory of entrepreneurship as well as the practical nature of their own entrepreneurial journey in the course. More details will be provided in class.AI Statement:Students are not allowed to to use Artificial Intelligence (AI) in the preparation or delivery of this assessment task.Read full task descriptionHide full task description",
            "submission_guidelines": "You cannot defer or apply for an extension for this assessment.",
            "deferral_or_extension": "You cannot defer or apply for an extension for this assessment.",
            "late_submission": null,
            "additional_info": "You cannot defer or apply for an extension for this assessment."
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Lecture",
            "topic": "What is Entrepreneurship?- How entrepreneurs are different from managersHow start-ups are different to other organisationsLearning outcomes:L01",
            "topic_title": "What is Entrepreneurship?",
            "topic_description": "- How entrepreneurs are different from managers \nHow start-ups are different to other organisations",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Workshop",
            "topic": "Introduction to EntrepreneurshipLearning outcomes:L01",
            "topic_title": "Introduction to Entrepreneurship",
            "topic_description": "",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Workshop",
            "topic": "Building High Performing Entrepreneurial TeamsThis week students are encouraged to make a team around some shared core interests in entrepreneurshipLearning outcomes:L01, L02",
            "topic_title": "Building High Performing Entrepreneurial Teams",
            "topic_description": "This week students are encouraged to make a team around some shared core interests in entrepreneurship",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Workshop",
            "topic": "Developing an Entrepreneurial MindsetEffectuation, Ideation, and Design ThinkingLearning outcomes:L01, L02, L04",
            "topic_title": "Developing an Entrepreneurial Mindset",
            "topic_description": "Effectuation, Ideation, and Design Thinking",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Workshop",
            "topic": "Customer Discovery- Introduction to the 9 sources of customer value- Value Propositions- Value Proposition CanvasLearning outcomes:L02",
            "topic_title": "Customer Discovery",
            "topic_description": "- Introduction to the 9 sources of customer value\n- Value Propositions\n- Value Proposition Canvas",
            "learning_outcomes": [
                "L02"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Workshop",
            "topic": "Creating Ideas with Potential- Ideas and opportunities - Defining the entrepreneurial opportunity - Market and technology trendsLearning outcomes:L03",
            "topic_title": "Creating Ideas with Potential",
            "topic_description": "- Ideas and opportunities - Defining the entrepreneurial opportunity - Market and technology trends",
            "learning_outcomes": [
                "L03"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Workshop",
            "topic": "Business Models & Multi-sided PlatformsLearning outcomes:L02, L03",
            "topic_title": "Business Models & Multi-sided Platforms",
            "topic_description": "",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Workshop",
            "topic": "Minimal Viable Products and Multi-Sided PlatformsLean start-up (MVP), ideas with potential, and the intermediary role of a new venture.Learning outcomes:L02, L03",
            "topic_title": "Minimal Viable Products and Multi-Sided Platforms",
            "topic_description": "Lean start-up (MVP), ideas with potential, and the intermediary role of a new venture.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Mid-sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "In-Semester BreakNo scheduled classes this week",
            "topic_title": "In-Semester Break",
            "topic_description": "No scheduled classes this week",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Workshop",
            "topic": "Customer Discovery and Lean Start -upStudents are encouraged to use the workshop to appraise their in-depth customer discovery interviews and collate key emerging insights to develop a lean start upLearning outcomes:L01, L03",
            "topic_title": "Customer Discovery and Lean Start -up",
            "topic_description": "Students are encouraged to use the workshop to appraise their in-depth customer discovery interviews and collate key emerging insights to develop a lean start up",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Workshop",
            "topic": "Organizational Support and FinancingFocus on capturing value and bootstrappingDue to the King's Birthday public holiday, Monday students are encouraged to attend an alternative workshop helpd on Tuesday, Wednesday or Thursday.Learning outcomes:L02, L03",
            "topic_title": "Organizational Support and Financing",
            "topic_description": "Focus on capturing value and bootstrapping\nDue to the King's Birthday public holiday, Monday students are encouraged to attend an alternative workshop helpd on Tuesday, Wednesday or Thursday.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Workshop",
            "topic": "Pitch FinalisationThe workshops are aimed to finalise their pitch presentations and select who in their team will deliver their elevation pitch according to pitching conceptsLearning outcomes:L02",
            "topic_title": "Pitch Finalisation",
            "topic_description": "The workshops are aimed to finalise their pitch presentations and select who in their team will deliver their elevation pitch according to pitching concepts",
            "learning_outcomes": [
                "L02"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Workshop",
            "topic": "Entrepreneurship and EthicsLearning outcomes:L01, L05",
            "topic_title": "Entrepreneurship and Ethics",
            "topic_description": "",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Workshop",
            "topic": "Synthesising practical and conceptual approaches to entrepreneurshipStudents are encouraged to come to the workshops to help prepare for their final assessment which will require both practical and theoretical approaches to entrepreneurshipLearning outcomes:L01, L04",
            "topic_title": "Synthesising practical and conceptual approaches to entrepreneurship",
            "topic_description": "Students are encouraged to come to the workshops to help prepare for their final assessment which will require both practical and theoretical approaches to entrepreneurship",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        }
    ]
}