{
    "url": "https://course-profiles.uq.edu.au/course-profiles/TIMS7317-20351-7520",
    "full_course_code": "TIMS7317-20351-7520",
    "course_code": "TIMS7317",
    "class_code": "20351",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (24/02/2025 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Identify the need for corporate involvement in sustainability. Analyse a  companies current sustainability status before developing plans to improve sustainability."
        },
        {
            "number": "LO2.",
            "description": "Explain the drivers for organisational sustainability, focusing on the link between corporate activity as well as global and local environmental change."
        },
        {
            "number": "LO3.",
            "description": "Consider regulatory and valuation frameworks to make the moral, legal and business case for action on sustainability."
        },
        {
            "number": "LO4.",
            "description": "Create change strategies required to shift organisations towards sustainability articulating sustainable value delivered through these strategies."
        },
        {
            "number": "LO5.",
            "description": "Work within a diverse group integrating different views and experiences into a cohesive outcome promoting sustainability goals."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Reflection - Creating Change for Sustainability",
            "special_indicators": [],
            "weighting": "25%",
            "due_date": "4/04/2025 1:00 pm",
            "learning_objectives": "L01, L02, L04",
            "mode": "Written",
            "category": "Project, Reflection",
            "task_description": "You will need to actively manage an area of your own sustainability. Over a ten (10) day period you will need to record your experience (photos/notes). A short reflective essay will be submitted addressing key questions (provided below) including applying academic literature including the article provided in Blackboard to evaluate your experience.ADDITIONAL NOTES:This project is to becompleted INDIVIDUALLY.Word length:1500 words maximum, excluding references and appendices.This assignment needs to be academically referenced with a minimum of 3 academic references.AI StatementArtificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "Please submit through Turnitin link in the Blackboard Assessment folder.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Team Sustainability Role Play and Report",
            "special_indicators": [],
            "weighting": "35%",
            "due_date": "12/05/2025 1:00 pm",
            "learning_objectives": "L01, L04, L05",
            "mode": "Activity/ Performance, Written",
            "category": "Role play/ Simulation",
            "task_description": "In this assignment, students will embark on a meaningful journey to design and execute a sustainability project associated with a chosen company within its local community. Building upon the foundational knowledge acquired in Assignment 1, this project requires collaborative efforts to identify and address key challenges within the company's surrounding community. Further information, requirements and marking rubrics are available on Blackboard.AI StatementArtificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance.A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "You may be able toapply for an extension.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Exam",
            "special_indicators": [],
            "weighting": "40%",
            "due_date": "End of Semester Exam Period7/06/2025 - 21/06/2025",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Examination",
            "task_description": "In person exam that will cover all course material.AI StatementThis assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "You may be able todefer this exam.",
            "deferral_or_extension": "You may be able todefer this exam.",
            "late_submission": null,
            "additional_info": "You may be able to\ndefer this exam\n."
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Seminar",
            "topic": "Introduction to Corporate SustainabilityAn overview of the course, its content and assessments.Learning outcomes:L01",
            "topic_title": "Introduction to Corporate Sustainability",
            "topic_description": "An overview of the course, its content and assessments.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Seminar",
            "topic": "The Drivers for SustainabilityThe seminar focuses on the drivers of organisational change for sustainability. Includes globalisation, regulation, SDGs, new business models and others.Learning outcomes:L01, L02",
            "topic_title": "The Drivers for Sustainability",
            "topic_description": "The seminar focuses on the drivers of organisational change for sustainability. Includes globalisation, regulation, SDGs, new business models and others.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Seminar",
            "topic": "The Phases of SustainabilityUnderstand the phases of organisational sustainability. Identify key aspects used to evaluate companies and their position on the path to sustainability.Learning outcomes:L02, L03, L04",
            "topic_title": "The Phases of Sustainability",
            "topic_description": "Understand the phases of organisational sustainability. Identify key aspects used to evaluate companies and their position on the path to sustainability.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Seminar",
            "topic": "Change Approaches to SustainabilityThis seminar considers change with a focus on both incremental and transformational change. We consider the appropriate types of change for a given circumstance, steps of implementation and considerations.Learning outcomes:L03, L04",
            "topic_title": "Change Approaches to Sustainability",
            "topic_description": "This seminar considers change with a focus on both incremental and transformational change. We consider the appropriate types of change for a given circumstance, steps of implementation and considerations.",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Seminar",
            "topic": "The Value of SustainabilityUnderstanding the value of sustainability projects to an organisation. Consideration of how to calculate value consistent with a focus on environmental, social and financial outcomes?Learning outcomes:L03, L04",
            "topic_title": "The Value of Sustainability",
            "topic_description": "Understanding the value of sustainability projects to an organisation. Consideration of how to calculate value consistent with a focus on environmental, social and financial outcomes?",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Seminar",
            "topic": "The Ethical and Legal Case For ActionThis seminar covers the ethical and legal case for action consistent with the growing trend towards a corporate focus on ESG.Learning outcomes:L01, L03",
            "topic_title": "The Ethical and Legal Case For Action",
            "topic_description": "This seminar covers the ethical and legal case for action consistent with the growing trend towards a corporate focus on ESG.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Seminar",
            "topic": "Leadership in SustainabilityThis seminar will cover the topics of leadership and culture. When sustainability is a focus of the company who can demonstrate leadership? What are the characteristics of leaders? Should culture be considered the fourth pillar of sustainability?Learning outcomes:L01, L04, L05",
            "topic_title": "Leadership in Sustainability",
            "topic_description": "This seminar will cover the topics of leadership and culture. When sustainability is a focus of the company who can demonstrate leadership? What are the characteristics of leaders? Should culture be considered the fourth pillar of sustainability?",
            "learning_outcomes": [
                "L01",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Seminar",
            "topic": "Trade offs and Tensions in SustainabilityTrade-offs and tensions in sustainability will be reviewed at multiple levels, individual, organisational, societal. Trade-offs in SDGs considered.Learning outcomes:L02, L03",
            "topic_title": "Trade offs and Tensions in Sustainability",
            "topic_description": "Trade-offs and tensions in sustainability will be reviewed at multiple levels, individual, organisational, societal. Trade-offs in SDGs considered.",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Mid-sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "IN-SEMESTER BREAKNo class this week.",
            "topic_title": "IN-SEMESTER BREAK",
            "topic_description": "No class this week.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Seminar",
            "topic": "Social Enterprise and the Circular EconomyWhat are social enterprises and how are they run? We'll also look at what is meant by circular economy.Learning outcomes:L01, L03, L05",
            "topic_title": "Social Enterprise and the Circular Economy",
            "topic_description": "What are social enterprises and how are they run? We'll also look at what is meant by circular economy.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Seminar",
            "topic": "Corporate legitimacy and social movementsIn this class we are going to discuss the legitimacy of corporate sustainability initiatives in society and social movements protesting against corporations.Learning outcomes:L05",
            "topic_title": "Corporate legitimacy and social movements",
            "topic_description": "In this class we are going to discuss the legitimacy of corporate sustainability initiatives in society and social movements protesting against corporations.",
            "learning_outcomes": [
                "L05"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Seminar",
            "topic": "Team presentations -  Group AThis week we will watch our team presentations.",
            "topic_title": "Team presentations -  Group A",
            "topic_description": "This week we will watch our team presentations.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Seminar",
            "topic": "Team presentations -  Group BThis week we will watch our team presentations.Learning outcomes:L01, L05",
            "topic_title": "Team presentations -  Group B",
            "topic_description": "This week we will watch our team presentations.",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Seminar",
            "topic": "Course Review and exam preparationLearning outcomes:L01, L05",
            "topic_title": "Course Review and exam preparation",
            "topic_description": "",
            "learning_outcomes": [
                "L01",
                "L05"
            ]
        }
    ]
}