{
    "url": "https://course-profiles.uq.edu.au/course-profiles/ECON7012-22494-7520",
    "full_course_code": "ECON7012-22494-7520",
    "course_code": "ECON7012",
    "class_code": "22494",
    "semester_code": "7520",
    "semester_details": "Semester 1, 2025 (31/03/2025 - 31/05/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Interpret fundamental economic terminology."
        },
        {
            "number": "LO2.",
            "description": "Relate appropriate economic theory to decision making."
        },
        {
            "number": "LO3.",
            "description": "Apply economic theory to evaluate rather than describe economic behaviour."
        },
        {
            "number": "LO4.",
            "description": "Critically analyse choices by individuals or business using economic theory."
        },
        {
            "number": "LO5.",
            "description": "Communicate economic thinking in non-technical, plain language."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "CML Quizzes",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "25%",
            "due_date": "CML1 First Attempt: Opens 9AM 24/3/25 and closes 4PM on 28/03/2025CML1 Second Attempt: Opens 9AM 29/03/25 and closes 4PM 30/03/25.------------------------------------------------------------------------------------CML2 First Attempt: Opens 9AM 31/3/25 and closes 4PM on 4/04/2025CML2 Second Attempt: Opens 9AM 5/04/25 and closes 4PM 6/04/25.------------------------------------------------------------------------------------CML3 First Attempt: Opens 9AM 7/04/25 and closes 4PM on 9/04/2025CML3 Second Attempt: Opens 9AM 10/04/25 and closes 4PM 11/04/25.------------------------------------------------------------------------------------",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "A1 CML QuizzesStudents complete 3 quizzes to assess understanding of lecture content:Quiz 1 – Lectures 1 to 4 (15 questions) 7.5%Quiz 2 – Lectures 1 to 7 (15 questions) 7.5%Quiz 3 – Lectures 8 to 10 (20 questions) 10%CML Quizzes(ComputerManagedLearning Quizzes)A student that misses the first attempt for any CML quiz will be able to complete an optional second attempt. The optional second attempt becomes available to all students after the first attempt closes. Non-submission of a CML quiz will incur a penalty of 100%.For step-by-step instructions on accessing, completing and submitting CML quizzes, please refer to the course Blackboard site under Assessment > CML Quizzes > CML Administrative Folder >CML Information Sheet. No marks are awarded for incorrect numerical answers, or ones that do not follow all the CML instructions outlined in theCML Information Sheeton Blackboard. Marks for questions are as indicated in the quiz. Note that an optional second attempt is given for each CML quiz. If only one attempt is submitted and a score received for a CML quiz (either the first attempt or just the second attempt), that quiz score will become the student's CML quiz mark.If both the first and second attempts are submitted for a CML quiz, the student's best score from their two attempts will become their CML quiz mark.AI STATEMENTThis assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "Enter answers into Blackboard prior to due date and time.",
            "deferral_or_extension": "You cannot defer or apply for an extension for this assessment.",
            "late_submission": "Exams submitted after the end of the submission time will incur alate penalty.",
            "additional_info": "You cannot defer or apply for an extension for this assessment."
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Newspaper Article Review",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "25%",
            "due_date": "8/04/2025 4:00 pm",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "By referring to anyAustralian or International newspapers, find onearticle that relates toeconomic conceptspresented in any of lectures 1 to 7 (inclusively). This newspaper article must be written in English, can be scanned or obtained from online sources, and published on or after1 January 2025.Please note that radio, TV online transcripts, or blogs areNOTto be used. Your newspaper article must satisfy these requirements to pass this assessment task.Usingno more than 1000 words, complete the following:Briefly summarise the newspaper article, including the central economic concepts that are used.Support the article’s view by clearly stating any assumptions it makes and applying economic theory.By using different assumptions, critically analyse the article and logically argue for an alternative perspective using economic theory.Summarise what you learnt from the critical analysis of the article. Then, by naming some \"other specific company or business\", in a completely different industry used in the article, discuss how what you learnt would be relevant. Then as a manager of this \"other specific company or business\", explain one recommendation you would implement based on what you learnt.Self assessyour assignment by completing each section of the Newspaper Article Marking Criteria sheet (available on Blackboard), being sure to give an overall mark for your assignment. Also complete the section “Student's specific feedback request(s)” provided on the Marking Criteria sheet. Please ensure you honestly self assess. This self-assessment will not influence the grade awarded for this piece of assessment. However, your self-assessment thoughts are intended to be incorporated into the marking feedback.Please ensure that your completed self-assessment Marking Criteria sheet is included as the last page of your assignment.IMPORTANT: Please ensure that your newspaper article submission is compiled as follows:First pageis a cover sheet with your name, student number and word count for the assignment.Second pageis the relevant news article (ensure it is clearly able to be read).Your final written submission(of no more than 1000 words).A copy of your working notes, rough sketches, thoughts etc.while completing your assignment. Ideally, these working notes will be generated during discussions in the tutorials or afterwards with colleagues. The aim is tomake your learning process visiblewhile completing the assignment. By doing so, academic integrity and credibility is enhanced (in a world of AI). The working notes etc. should also help with your reflective process in discovering what you learnt. Submission of your rough working notes is essential.Final page is your completed self-assessment Marking Criteria sheet, showing the marks awarded by you for each section. You should indicate areas where feedback is required.Themarking criteriacan be found under the Assessment tab on Blackboard for:The self-assessment document calledNewspaper Article Review Marking Criteria, andThe detailed marking rubric calledNewspaper Article Review Marking Rubric.AI STATEMENTThis assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "The assignment must be submitted electronically using Blackboard and the submission folders for Turnitin by the due date and time.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Major Assignment (Individual Essay)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "50%",
            "due_date": "28/04/2025 4:00 pm",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "The focus of this course is to better understand economic concepts so as to then apply them in business situations. This, in part, will require interventions at times by managers and choices to be made in order to coordinate information and knowledge to avoid wasted opportunities. The course also highlights the importance of understanding the roles consumption, investment, and government actions play in making business decisions, coordinating activities, and assessing strategic directions.Economic theories and concepts used in this course have examined how and why businesses and markets work the way they do. With this knowledge, students have been given a tool to assist in making more informed, strategic, business decisions.Using the perspectives outlined above,write an essay reflecting on a variety of economic concepts that impact your chosen business(where you are currently working, have worked in the past, or perhaps a future business where you plan to work).Using no more than2,700 words, the essay must address the following points.An Executive Summary is to be provided (note: these words ARE to be included in the assignment total word count). Details of what is needed in an Executive Summary can be found under the \"Assessment\" tab on Blackboard.Background information on the student’s chosen business is to be briefly outlined. The integration of relevant economic terminology should be used to clearly set the scene for the following sections.Using economic theory (incorporating graphs and relevant calculations as applicable), critically analyse past performances of your chosen business in relation to the market it operated in. Similarly, critically analyse the current performance of your chosen business in relation to the current market environment it now operates in.Based on the critical analysis, a detailed reflection is provided on what was learnt, what was confirmed, and what remains puzzling about the chosen business and the market it operates in. Clear linkages should be evident from your analysis and reflection to reveal what you perceive as theone key strategic issueyour chosen business faces either now or in the future. It is advisable to use relevant analytical tools such as SWOT, PESTEL, Porter’s Five Force analysis etc. to provide insights to the economic analysis of your chosen business’s past, present and future performances. This should be used to help you identify the key strategic issue your chosen business faces. Any analysis using SWOT etc. needs to be included in an Appendix and NOT in the body of the assignment. Clearly though, the findings from such an analysis should be included in the body of the assignment.Using economic terminology and incorporating graphs, briefly explain how Australian macroeconomic indicators and policies are relevant to your chosen business. Evaluate any impacts on your options in trying to address the key strategic issue.Draws a conclusion from the analysis. Provides clearly supported recommendation(s) for management to address the identified strategic issue, along with implementation guidelines.Self-assess your assignmentusing the Major Assignment Marking Criteria document that is available on Blackboard. Please ensure you honestly self-assess. This self-assessment will not influence the grade awarded for this piece of assessment. However, your self-assessment thoughts are intended to be incorporated into the marker’s feedback.Please ensure you complete the self-assessment, using the Major Assignment Marking Criteria document on Blackboard, and include it as the last page of your assignment.IMPORTANT: Please ensure that your report submission is compiled as follows:First pageis a cover sheet with your name, student number and word count for the assignmentYour final written essay submission covering all requirements.Be sure that you have listed two(2) clear options to address the one key strategic issue based on the lesson(s) you learnt from your critical analysis, and combining this with your identified key strategic issue. Both options need to be able to be implemented. For each option, use microeconomic theory to fully evaluate how each option address the key strategic issue and highlight the benefits to the business of implementing each option. Be sure to discuss and assess the assumptions you will have made when evaluating each option, and look at the impacts on your chosen business for each option if your assumptions prove to be incorrect.A copy of your working notes, rough sketches, thoughts etc.while completing your assignment. Ideally, these working notes will be generated during discussions in the tutorials or afterwards with colleagues. The aim is tomake your learning process visiblewhile completing the assignment. By doing so, academic integrity and credibility is enhanced (in a world of AI). The working notes etc. should also help with your reflective process in discovering what you learnt. Submission of your rough working notes is essential.Final page is your completed self-assessment Marking Criteria sheet, showing the marks awarded by you for each section. You should indicate areas where feedback is required.Note:The words in the Appendix are NOT to be included in assignment total word count.Appropriate headings based on the Major Assignment Marking Criteria sheet must be used in the essay.Themarking criteriacan be found under the Assessment tab on Blackboard for:The self-assessment document calledMajor Assignment Marking Criteria,andThe detailed marking rubric calledMajor Assignment Marking Rubric.AI STATEMENTThis assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "The assignment must be submitted electronically using Blackboard and the submission folders for Turnitin.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Lecture",
            "topic": "Day 1 Lectures - Monday 24/03/2025Lecture 1: Introduction and Key Economic ConceptsEstablishes the important themes of the course. Outlines learning approaches, the structure of the lectures and tutorials and the assessment items. Introduces important questions of economics - what economics studies, why and how economists approach these topics. Key principles include acknowledgement of scarcity the assumption of rationality, opportunity cost, economic surplus, specialisation, cost benefit principle, and marginal analysis.Lecture 2: Demand and Supply - Part 1An introduction to markets. Understanding supply and demand, using supply and demand models in business decision making, predicting likely market responses to different choices and strategies ensuring efficient uses of resources.Learning outcomes:L01, L02, L03, L04, L05",
            "topic_title": "Day 1 Lectures - Monday 24/03/2025",
            "topic_description": "Lecture 1: Introduction and Key Economic Concepts\nEstablishes the important themes of the course. Outlines learning approaches, the structure of the lectures and tutorials and the assessment items. Introduces important questions of economics - what economics studies, why and how economists approach these topics. Key principles include acknowledgement of scarcity the assumption of rationality, opportunity cost, economic surplus, specialisation, cost benefit principle, and marginal analysis.\nLecture 2: Demand and Supply - Part 1\nAn introduction to markets. Understanding supply and demand, using supply and demand models in business decision making, predicting likely market responses to different choices and strategies ensuring efficient uses of resources.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Lecture",
            "topic": "Day 3 Lectures - Monday 31/03/2025Lecture 5: Profit Maximising using Microeconomic TheoryAssess short run and long run productions costs of a firm, Total Cost, Average Cost, Marginal Cost. Introduce the theory of Perfect Competition as a basis for analysing more realistic market structures. Examine a perfectly competitive firm's profit maximising output, loss minimising and shutdown situations.Lecture 6: Monopolies, Cartels and the ACCCHow monopolies emerge, how a monopoly maximises profit, real world applications of the theory, the implications to society from both economic and business perspectives, the role of the ACCC and the economic theory behind their decisions, cartel behaviour and some recent examples.Learning outcomes:L01, L02, L03, L04, L05",
            "topic_title": "Day 3 Lectures - Monday 31/03/2025",
            "topic_description": "Lecture 5: Profit Maximising using Microeconomic Theory\nAssess short run and long run productions costs of a firm, Total Cost, Average Cost, Marginal Cost. Introduce the theory of Perfect Competition as a basis for analysing more realistic market structures. Examine a perfectly competitive firm's profit maximising output, loss minimising and shutdown situations.\nLecture 6: Monopolies, Cartels and the ACCC\nHow monopolies emerge, how a monopoly maximises profit, real world applications of the theory, the implications to society from both economic and business perspectives, the role of the ACCC and the economic theory behind their decisions, cartel behaviour and some recent examples.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Lecture",
            "topic": "Day 5 Lectures - Monday 07/04/2025Lecture 9: Aggregate Demand and Aggregate Supply (AD-AS)Establish linkages between various economic variables using the AD-AS Model. Review reasons for shifts in aggregate demand and supply, and using the AD-AS model consider implications of various macroeconomic events. Show how the model is applied to predict real world possible outcomes from specific policy actions.Lecture 10: Monetary and Fiscal PolicyDefine Monetary Policy, describe its main roles and how the RBA affects interest rates. Define and apply Fiscal Policy. Government deficits and surplus, levels of debt, crowding out private investment. Understanding the various policy measures governments take to stabilise economies during periods of boom and bust . Applying theoretical models to help analyse fiscal policy decisions. Adopt the models to provide a framework to appreciate the ongoing political debates about an economy. Examine how to apply the models to make more informed strategic business decisions.Learning outcomes:L01, L02, L05",
            "topic_title": "Day 5 Lectures - Monday 07/04/2025",
            "topic_description": "Lecture 9: Aggregate Demand and Aggregate Supply (AD-AS)\nEstablish linkages between various economic variables using the AD-AS Model. Review reasons for shifts in aggregate demand and supply, and using the AD-AS model consider implications of various macroeconomic events. Show how the model is applied to predict real world possible outcomes from specific policy actions.\nLecture 10: Monetary and Fiscal Policy\nDefine Monetary Policy, describe its main roles and how the RBA affects interest rates. Define and apply Fiscal Policy. Government deficits and surplus, levels of debt, crowding out private investment. Understanding the various policy measures governments take to stabilise economies during periods of boom and bust . Applying theoretical models to help analyse fiscal policy decisions. Adopt the models to provide a framework to appreciate the ongoing political debates about an economy. Examine how to apply the models to make more informed strategic business decisions.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L05"
            ]
        }
    ]
}