{
    "url": "https://course-profiles.uq.edu.au/course-profiles/HOSP3000-60248-7460",
    "full_course_code": "HOSP3000-60248-7460",
    "course_code": "HOSP3000",
    "class_code": "60248",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "compare and contrast the various motives for gamblers and gambling activities within Australia and internationally"
        },
        {
            "number": "LO2.",
            "description": "analyse the development and future trends of the gambling industry in Australia and overseas"
        },
        {
            "number": "LO3.",
            "description": "research and report on contemporary gambling issues and their negative and positive socio-economic impacts"
        },
        {
            "number": "LO4.",
            "description": "critically evaluate gambling operations prevalent in the industry"
        },
        {
            "number": "LO5.",
            "description": "formulate recommendations for strategic and ethical management of gambling operations"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Client Presentation - New Casino Development",
            "special_indicators": [],
            "weighting": "45%",
            "due_date": "13/09/2024 2:00 pm",
            "learning_objectives": "L03, L04, L05",
            "mode": "Oral, Written",
            "category": "Presentation",
            "task_description": "You are required to create a10-minute presentation slide showon the new casino development that is part ofQueen's Wharf Integrated Resort Development(IRD) in Queensland.In this assignment, you need toappraise the new casino development on behalf of a client,indicating whether your client supports - or does NOT support - the new casino development.Prospective ClientsClient suggestions include the following (though you are welcome to select a different client):Clubs Queensland (https://www.clubsqld.com.au/)Queensland Hotels Association (https://qha.org.au)The Alliance for Gambling Reform (http://www.pokiesplayyou.org.au/)Star Entertainment Group (https://development.star.com.au/)Brisbane Tourism (https://www.visitbrisbane.com.au/)Restaurant & Catering Queensland (http://rca.asn.au/rca/queenslandnorthern-territory/)Gabba Ward Council (https://www.brisbane.qld.gov.au/about-council/governance-and-strategy/lord-mayor-and-councillors/ward-office-locations)NOTE: You need to select one (1) client only and take the client's stance.Alignment with the Chosen ClientIn your presentation, the position you advocate on behalf of your client will either be one of support - or non-support - for the new casino development being part of Queen's Wharf IRD.This position must align with your client’s mission, objectives, purpose, and values with regard to the new casino development.Therefore, you should undertake research using secondary sources of information to determine the most likely position your client would adopt (i.e., supporter or non-supporter of the development).The AudienceYour presentation mustpersuade and advocate for the client's positionregarding the new casino development. In doing so, you are trying toconvince the audiencethat your client's position is the best one for everyone to follow.The audience will be comprised of various stakeholders, some of whom will be supporters of the development and others non-supporters.Also, the other clients will represent the audience (from the 'Prospective Clients' list above).Therefore, it is important you understand the position of these other stakeholders and clients (are they likely to be supporters or non-supporters?) so that you can defend your own client’s position and persuade the audience that your client's position is the best to follow regarding the new casino development being part of Queen's Wharf IRD.PRESENTATION FORMATThis assignment does not require a face-to-face presentation. Instead, you will create a 10-minutePowerPoint slide show with narration(as you would present this to a \"live\" audience). If you are not familiar with recording a slide show with narration, click to find the instructions: https://support.microsoft.com/en-us/o? ce/record-a-slide-show-with-narration-and-slide-timings-0b9502c6-5f6c-40ae-b1e7- e47d8741161c#O? ceVersion=O? ce_365You will need to submit one MS PowerPoint file. Please avoid making the file in a movie/video format, as it tends to create a file submission issue later.Given that people speak 100 - 150 words per minute, an overall script would aim to be within the range of 1,000 - 1,500 words.GENERAL TIPS FOR PRESENTATIONList the related references (sources of information) on the final PowerPoint slide (however, do not 'speak' to this slide as part of your oral presentation - just show it).Make your presentation as informative and appealing as possible.Deliver the message that is critical but commonly overlooked.Use key points, words, phrases, and diagrams to engage your audience.Do not type sentences on PowerPoint - written material must be succinctInclude a few high-quality graphics (eg, tables, diagrams, photographs, etc) – these make your slides more interesting and easier to follow text aloneAvoid including movie/video clips or making your file in a movie/video format. Including movie clips or a video format will enlarge your file size and make submitting the file to Blackboard difficult. Please ensure that you receive and keep the submission confirmation email upon your submission.USE OF AI IN ASSESSMENTThis task has been designed to be challenging, authentic and complex. Whilst students may use AI technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide limited support and guidance.A failure to reference AI use may constitute student misconduct under the Student Code of Conduct.To pass this assessment, students must demonstrate detailed comprehension of their written submissions independent of AI tools.CRITERIA & MARKINGFurther details about this task, including the marking criteria, will be discussed in class and posted to the course Blackboard site.Read full task descriptionHide full task description",
            "submission_guidelines": "The file must be submitted to Blackboard",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Ethical issues in casino management",
            "special_indicators": [],
            "weighting": "55%",
            "due_date": "25/10/2024 2:00 pm",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "Working INDIVIDUALLY, prepare a clear and concise2,500-word Essay on Ethical issues in the Australian gaming industry.You are required toidentify ONE ethical issuein the Australian gaming industry (e.g., casinos, clubs and hotels that offer gaming activities, online wagering and sports betting), discuss the ethical nature of the issue, and evaluate the mechanism imposed to discourage/prevent the organisation/industry from unethical actions (or encourage/promote ethical actions) from the perspective of relevant, multiple stakeholders (more than two) and finally provideTWO actionable recommendations.To complete this assignment, you will need to:Conduct research on how business ethics or ethical issues are commonly defined.Conduct an online search on gaming management/operational practices currently/potentially considered to fall into ethical issues.Conduct research on internal policies (e.g., organisational or industrial code of conduct) or legislations (e.g., federal/state laws) related to the focal ethical issue.Reflect on your personal experience and understanding of the topic.FORMAT (2,500-word limit)Introduction -Identification of ONE ethical issuein the Australian gaming industry.Body - Discussion andjustificationof the ethical nature of the issue.Consequence:Evaluationof the issue and the mechanism (e.g., internal policies or legislations) from diverse stakeholder perspectives (more than two stakeholders).Recommendations: inclusion ofTWO original, evidenced, and actionable recommendations.Conclusions:Reflect on your personal experienceand understanding of the topic and provide athoughtful conclusion.Conclusions shall reflect a critical self-awareness of the topic chosen.Reflective writing is still formal, technical, and well-informed, with a combination of objective facts and personal reflections on the topic, written in the first person.Additional Guidance for EssayThe word count includes everything, including the reference list.A minimum of FIVE (5) academic referencesis required (no maximum, though).APA format, consistent throughout the document.Ethical issues are often called shade of grey - no clear cut between being/doing right and being/doing wrong. The ethical issue you identified may not necessarily be considered ethical by others. Thus, the key argument point of this assignment is to justify the ethical nature of the issue. This will require you a clear understanding of business ethics.Spend sufficient time conducting research on business ethics. References for business ethics must be from academic sources (i.e., academic journal articles). However, references for the business practices/examples can come from non-academic, reliable sources.If you submit the file after the due date, you are allowed to submit it ONCE. You cannot submit the file again after checking the similarity report if you submit the file AFTER the due date (due to the Turnitin setting).Use of AI in AssessmentThis task has been designed to be challenging, authentic, and complex. Whilst students may use AI technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide limited support and guidance. Afailure to reference AI use may constitute student misconductunder the Student Code of Conduct. Students must demonstrate detailed comprehension of their written submissions independent of AI tools to pass this assessment.Criteria & MarkingFurther details about this task, including the marking criteria, will be discussed in class and posted to the course Blackboard site.Read full task descriptionHide full task description",
            "submission_guidelines": "The file must be submitted to Turnitin on Blackboard.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Lecture",
            "topic": "IntroductionThe overview of gaming, wagering and gamblingLearning outcomes:L01",
            "topic_title": "Introduction",
            "topic_description": "The overview of gaming, wagering and gambling",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Lecture",
            "topic": "Culture and gamblingMotivationsLearning outcomes:L01",
            "topic_title": "Culture and gambling",
            "topic_description": "Motivations",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Lecture",
            "topic": "Strategic Gambling Resource AnalysisIndustry macro-environmental factorsLearning outcomes:L01, L02",
            "topic_title": "Strategic Gambling Resource Analysis",
            "topic_description": "Industry macro-environmental factors",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Lecture",
            "topic": "Development of gambling in the world - Field Trip (Details TBA)USA, Asia-Pacific and emerging regions. Self-directed learning. Please work through the online timeline and material.Learning outcomes:L02",
            "topic_title": "Development of gambling in the world - Field Trip (Details TBA)",
            "topic_description": "USA, Asia-Pacific and emerging regions. Self-directed learning. Please work through the online timeline and material.",
            "learning_outcomes": [
                "L02"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Lecture",
            "topic": "Development of gambling in AustraliaPosition towards gambling, historical developments and characteristics of the industry.Learning outcomes:L02",
            "topic_title": "Development of gambling in Australia",
            "topic_description": "Position towards gambling, historical developments and characteristics of the industry.",
            "learning_outcomes": [
                "L02"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Lecture",
            "topic": "Integrated Resorts Management - Guest Lecturer TBAA destinationLearning outcomes:L02, L04",
            "topic_title": "Integrated Resorts Management - Guest Lecturer TBA",
            "topic_description": "A destination",
            "learning_outcomes": [
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Lecture",
            "topic": "Contemporary Gambling IssuesNegative and Positive Socio-Economic ImpactsLearning outcomes:L03, L05",
            "topic_title": "Contemporary Gambling Issues",
            "topic_description": "Negative and Positive Socio-Economic Impacts",
            "learning_outcomes": [
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Lecture",
            "topic": "Contemporary Gambling Issues in Operations - Guest Lecturer TBAIndustry Challenges & OpportunitiesLearning outcomes:L03, L04, L05",
            "topic_title": "Contemporary Gambling Issues in Operations - Guest Lecturer TBA",
            "topic_description": "Industry Challenges & Opportunities",
            "learning_outcomes": [
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Lecture",
            "topic": "Problem GamblingGamification, Normalization & Consumer behaviour.Learning outcomes:L04, L05",
            "topic_title": "Problem Gambling",
            "topic_description": "Gamification, Normalization & Consumer behaviour.",
            "learning_outcomes": [
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Mid Sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "IN-SEMESTER BREAKNo lecture or tutorials during the in-semester break",
            "topic_title": "IN-SEMESTER BREAK",
            "topic_description": "No lecture or tutorials during the in-semester break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Lecture",
            "topic": "Gambling MarketingAdvertisements, Promotions, Premium player segment, Loyalty programsLearning outcomes:L01, L02, L03",
            "topic_title": "Gambling Marketing",
            "topic_description": "Advertisements, Promotions, Premium player segment, Loyalty programs",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Lecture",
            "topic": "The Modern Remote GamblingIgaming, Igambling, Isportsbetts, Online CasinosLearning outcomes:L02, L03, L04",
            "topic_title": "The Modern Remote Gambling",
            "topic_description": "Igaming, Igambling, Isportsbetts, Online Casinos",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Lecture",
            "topic": "Contemporary Gambling Issues in Sports and RacingSports and RacingLearning outcomes:L03, L04, L05",
            "topic_title": "Contemporary Gambling Issues in Sports and Racing",
            "topic_description": "Sports and Racing",
            "learning_outcomes": [
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Lecture",
            "topic": "Futures of GamblingThe Technology RevolutionLearning outcomes:L02, L04",
            "topic_title": "Futures of Gambling",
            "topic_description": "The Technology Revolution",
            "learning_outcomes": [
                "L02",
                "L04"
            ]
        }
    ]
}