{
    "course_title": "Understanding Cultures in International Business",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/IBUS2309-60254-7460",
    "full_course_code": "IBUS2309-60254-7460",
    "course_code": "IBUS2309",
    "class_code": "60254",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand culture through analyses, reflection and application of information in the ways national and sub-cultures vary (situated approach)."
        },
        {
            "number": "LO2.",
            "description": "Conduct independent research to develop individual and team written, as well as oral projects."
        },
        {
            "number": "LO3.",
            "description": "Have knowledge of working with multicultural groups."
        },
        {
            "number": "LO4.",
            "description": "Apply relevant theories and/or frameworks to analyse issues in international management."
        },
        {
            "number": "LO5.",
            "description": "Evaluate ethical and social issues associated with operating in an international business context."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Cultural Immersion Reflection, Presentation, Quiz",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>50% There are multiple parts. Members must contribute to all parts of assignment; Group (35%); Individual Quiz (15%) </dd>",
            "due_date": "<dd><p>Group Written Essay - 13:00  25/07/2024 - 29/08/2024</p>\n<p>Individual Contribution - 13:00 25/07/2024 - 29/08/2024</p>\n<p>Group Oral Presentation Slides, 1 week before presentation 2/09/2024 - 21/10/2024</p>\n<p>In-Tutorial Individual Quiz 2/09/2024 - 21/10/2024</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Oral, Product/ Artefact/ Multimedia, Written",
            "category": "Essay/ Critique, Participation/ Student contribution, Presentation, Quiz, Reflection, Tutorial/ Problem Set",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Your task in this assignment (as a multicultural group) is to abstract concepts from the <em>cultural immersion </em>and analyse the issue(s) from a cross-cultural perspective, then develop a topic that is relevant to international business/management (IB/M). <strong> Please see IBUS2309 Assignment Guide</strong> for detailed instructions and criteria, this is available on Blackboard. Assignments will be discussed in the seminars and tutorials. <strong>Students must follow the criteria found in the assignment guide provided on Blackboard or risk failing the assignment.</strong></p>\n<p>This entire group assignment is worth 35% of your final mark. The assignment consists of multiple parts, all team members must participate in all aspects of the assignment. Individual in-tutorial quizzes worth 15% of your final mark are linked to the tutorial presentations.</p>\n<p>All aspects of this assignment relate to employability building skills.</p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.  This includes dictionary and translation APPs.</p>\n<p><strong>Groups will randomly be created by the course coordinator/facilitator. <em>Once the teams are created you must contact your group by the end of week 3 or risk failing the assignment and losing out on group marks.</em> You are not allowed to change groups by yourself, the group changes deadline is week 3. All are in the same situation, so please take note of your presentation time and adjust your schedule accordingly.</strong></p>\n<p>Students must submit all assessments to pass the course.</p>\n<p><strong>Peer Evaluation: </strong>The purpose of this evaluation is to assess a member’s contribution to the group effort. Group members may contribute to the group along various dimensions. These include their organisation/project management, knowledge/research, communication, and responsibility, including supporting the group and members in any way. Use the 9-point rating scale given below to rate yourself and members of your group. Please be as objective as possible, taking behaviours rather than personal style into consideration. <strong>Peer reviews are compulsory to ensure that a contribution score is available for all moderation.</strong></p>\n<p><strong>Instructions:</strong> You are required to assess your peers on their contribution to the group assignment by allocating each group member a mark in each of the four criteria. For each criterion, allocate a mark between one and six, where a mark of one <strong>(1) indicates</strong> <strong>no contribution</strong> or submitting contribution passed the agreed group deadline, and a mark of <strong>nine (9) indicates that they made the maximum contribution possible.</strong></p>\n<ul>\n<li>1 = Person demonstrated <strong>no contribution in this criterion</strong> or submitted contributions past the agreed-upon group deadline.</li>\n<li>1.01 – 1.99 = Person demonstrated a low contribution to the group in this criterion.</li>\n<li>2 – 3.99 = Person demonstrated a medium-low contribution to the group in this criterion.</li>\n<li>4 – 5.99 = Person demonstrated a medium-level contribution to the group in this criterion.</li>\n<li>6 – 8.4 = Person consistently demonstrated a medium-high level of contribution to the group in this criterion.</li>\n<li>8.5 - 9 = Person consistently demonstrated high-level contribution to the group in a criterion.</li>\n</ul>\n<p>A mark of six (6) or less (1 to 6), based on the above guide (out of 9) for any criteria, requires a comment; otherwise, it is invalid.</p>\n<p>To take account of the possibility that a student does not contribute to one or all criteria, 1 signifies that a student has not contributed.</p>\n<p>Peer reviews are compulsory and must be submitted within five days of the assessment due date, <em>not submitting peer reviews may decrease marks. </em>If no peer review is received from a student after 5 days, then no contribution scores are calculated and not available for all moderation. No exceptions!</p>\n<p><strong>Important Mark Moderation Based on Peer Review – highest score is 9, see explanation below.</strong></p>\n<p><strong>The moderation of individual marks will be based on the following overall average review):</strong></p>\n<ul>\n<li><strong>8.5 to 9.0 </strong>(consistently demonstrated full contribution to group),<strong> no deduction from group mark.</strong></li>\n<li><strong>8.0 to 8.4 </strong>(demonstrated medium-high level contribution) <strong>5% deduction from group mark.</strong></li>\n<li><strong>6.0 to 7.99 </strong>(demonstrated medium level contribution),<strong> 15% deduction from group mark.</strong></li>\n<li><strong>3.0 to 5.99</strong> (demonstrated medium-low contribution), <strong>25% deduction from group mark.</strong></li>\n<li><strong>1.01 to 2.99</strong> (demonstrated low contribution in several criteria or submitted contribution passed agreed group deadline), <strong>50% deduction from group mark</strong>.</li>\n<li><strong>1, no individual mark will be awarded.</strong></li>\n</ul>\n<p><strong>Criteria 1: Organisation/Project Management</strong></p>\n<p><strong>Role in contributing to the process needed to complete the assignment.</strong> Consider their approach to setting up meeting times and work submission deadlines as well as their willingness to listen to other group members' opinions. </p>\n<p><strong>Criteria 2: Knowledge/research</strong></p>\n<p><strong>Contribution of research, knowledge, opinions, and skills</strong> to group discussions and work completion. </p>\n<ul>\n<li>Maintaining academic integrity (ensuring original work; no plagiarised and/or AI-generated materials).</li>\n</ul>\n<p><strong>Criteria 3: Communication</strong></p>\n<p><strong>How well one collaborated and communicated</strong> with others in the group and fulfilled their roles within the group. To determine your mark, consider if each group member:</p>\n<ul>\n<li>was present at all meetings, as long as feasibly possible (either in person or via phone/online) (barring legitimate reasons),</li>\n<li>played an active role in facilitating agreement and resolving conflict and,</li>\n<li>provided timely responses to all communications and queries.</li>\n</ul>\n<p><strong>Criteria 4: Responsibility</strong></p>\n<p><strong>Taking responsibility for the group’s outcome</strong>, and consistently acting in a manner that demonstrated they were keen for the group to perform well (e.g., supporting the group). </p>\n<ul>\n<li>This includes ensuring that the English language is used in all forms of communication. Since the official language of Australia is English, non-compliance can lead to assessments awarded the mark of zero, and non-compliance in group settings be interpreted as exclusionary behaviour, a form of bullying and a serious offence.</li>\n</ul>\n<p><strong>Students must follow the criteria found in the assignment guide provided on Blackboard or risk failing the assignment.</strong></p>\n<p>The week of the Oral Presentation will be assigned to each group early in Semester. Group Oral Presentation Slides due 1 week prior to presentation.</p>\n<p>Not submitting the individual contribution materials will exclude you from receiving the group’s mark, since it implies you made no contribution(s) to the group assignment.</p>\n<p>A hardcopy, handout of the presentation with reference list are to be handed to the marker(s) on the day of the presentation; all groups must be ready to present on the day of presentation with their presentation materials on a USB or alternative device to use the seminar room facilities. <strong>Please Note: </strong>The presentation will be recorded for marking purposes per UQ policy.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Only one electronic copy of the assignment per group must be submitted to Turnitin via Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Cross-Cultural Incident Analysis",
            "special_indicators": [],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p> 17/10/2024 1:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Essay/ Critique, Practical/ Demonstration, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Your task is to describe, propose causes and analyse an actual cross-cultural clash incident from your own experience or vicariously. The task is not simply a descriptive exercise! You must then conduct academic research to analyse the cross-cultural <em>clash</em> and the nature or underlying reasons for the clash by using appropriate theories and/or frameworks relevant to the course.</p>\n<p>All aspects of this assignment relate to employability building skills. In particular, towards building cultural empathy and legitimising competing perspectives.</p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct. This includes dictionary and translation APPs.</p>\n<p>Please see IBUS2309 Assignment Guide for detailed instructions and criteria - available on Blackboard. This assignment should be approximately 2000 words.</p>\n<p><strong>Students must follow the criteria found in the assignment guide provided on Blackboard or risk failing the assignment.</strong></p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Only an electronic copy of your assignment must be submitted to Turnitin via Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Final Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>25%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>2/11/2024 - 16/11/2024</p></dd>",
            "learning_objectives": "L01, L03, L04, L05",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The final exam will cover all materials covered in the course and readings to be examined in the form of short essay and extended essay questions. The seminar objectives and class discussions are the basis for the exam questions. Students are responsible to learn all seminar, tutorial and other relevant course content.</p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct. This includes translation APPs.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": null,
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>1 - Introduction</strong><br><p>Course Overview, Assessment Briefing, Introduction to understanding cultures in international business</p></br></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>1 - Introduction</strong>",
            "topic_description": "1 - Introduction Course Overview, Assessment Briefing, Introduction to understanding cultures in international business",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 1",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>No Tutorial</strong><br><p>No Tutorials in Week 1</p></br></p></div></td>",
            "topic_title": "<strong>No Tutorial</strong>",
            "topic_description": "No Tutorial No Tutorials in Week 1",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>2 - Culture Systems</strong><br><p>Culture Systems, Meanings of Culture and International Management. </p>\n<p>Compulsory integrity tutorial must be completed prior to any assessment submission in this course. https://www.uq.edu.au/integrity/</p></br></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>2 - Culture Systems</strong>",
            "topic_description": "2 - Culture Systems Culture Systems, Meanings of Culture and International Management. Compulsory integrity tutorial must be completed prior to any assessment submission in this course. https://www.uq.edu.au/integrity/",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 1</strong><br><p><strong>Group Formation and Roles Allocation</strong></p>\n<ul>\n<li>Group Exercise</li>\n</ul></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial 1</strong>",
            "topic_description": "Tutorial 1 Group Formation and Roles Allocation Group Exercise",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>3 - Socialisation process</strong><br><p>Socialisation Process Across Cultures.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>3 - Socialisation process</strong>",
            "topic_description": "3 - Socialisation process Socialisation Process Across Cultures.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 2</strong><br><p><strong>Cultural Learning Through Reflection</strong></p>\n<ul>\n<li>Detailed group assignment briefing</li>\n<li>Group Exercise</li>\n<li><strong>Students must follow the criteria found in the assignment guide provided on Blackboard or risk failing the assignment</strong></li>\n</ul></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Tutorial 2</strong>",
            "topic_description": "Tutorial 2 Cultural Learning Through Reflection Detailed group assignment briefing Group Exercise Students must follow the criteria found in the assignment guide provided on Blackboard or risk failing the assignment",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>4 - Ethics across cultures</strong><br/><p>Managing Ethics Across Cultures.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>4 - Ethics across cultures</strong>",
            "topic_description": "4 - Ethics across cultures Managing Ethics Across Cultures.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 3</strong><br/><p><strong>Appreciation of Values</strong></p>\n<ul>\n<li>Group Exercise</li>\n<li>Values and Proverbs Exercise</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Tutorial 3</strong>",
            "topic_description": "Tutorial 3 Appreciation of Values Group Exercise Values and Proverbs Exercise",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>5 - Cross-cultural communication</strong><br/><p>Cross-Cultural Communication.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>5 - Cross-cultural communication</strong>",
            "topic_description": "5 - Cross-cultural communication Cross-Cultural Communication.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 4</strong><br/><p><strong>Cognitive Bias Awareness</strong></p>\n<ul>\n<li>Group Exercise</li>\n<li>Red Flags Exercise</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Tutorial 4</strong>",
            "topic_description": "Tutorial 4 Cognitive Bias Awareness Group Exercise Red Flags Exercise",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>6 - Cross-cultural negotiations</strong><br/><p>Cross-Cultural Negotiation. </p>\n<p>*Group assignment due this week.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>6 - Cross-cultural negotiations</strong>",
            "topic_description": "6 - Cross-cultural negotiations Cross-Cultural Negotiation. *Group assignment due this week.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 5</strong><br/><p><strong>Valuing Cultures Through Critical Incidents</strong></p>\n<ul>\n<li>Appreciating understanding of cultures in international business</li>\n<li>Detailed individual assignment briefing</li>\n<li><strong>Students must follow the criteria found in the assignment guide provided on Blackboard or risk failing the assignment</strong></li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Tutorial 5</strong>",
            "topic_description": "Tutorial 5 Valuing Cultures Through Critical Incidents Appreciating understanding of cultures in international business Detailed individual assignment briefing Students must follow the criteria found in the assignment guide provided on Blackboard or risk failing the assignment",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>7 - Motivation</strong><br/><p>Motivation Across Cultures.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>7 - Motivation</strong>",
            "topic_description": "7 - Motivation Motivation Across Cultures.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 6</strong><br/><p><strong>Group Presentation &amp; Cultural Take Away Lesson</strong></p>\n<ul>\n<li>Peer learning experience</li>\n<li>Quiz based on presentation for the audience</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Tutorial 6</strong>",
            "topic_description": "Tutorial 6 Group Presentation & Cultural Take Away Lesson Peer learning experience Quiz based on presentation for the audience",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>8 - Leadership</strong><br/><p>Leadership Across Cultures.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>8 - Leadership</strong>",
            "topic_description": "8 - Leadership Leadership Across Cultures.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 7</strong><br/><p><strong>Group Presentation &amp; Cultural Take Away Lesson</strong></p>\n<ul>\n<li>Peer learning experience</li>\n<li>Quiz based on presentation for the audience</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Tutorial 7</strong>",
            "topic_description": "Tutorial 7 Group Presentation & Cultural Take Away Lesson Peer learning experience Quiz based on presentation for the audience",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>9 - Managing Diversity</strong><br/><p>Managing Diversity Lecture</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>9 - Managing Diversity</strong>",
            "topic_description": "9 - Managing Diversity Managing Diversity Lecture",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 8</strong><br/><p><strong>Group Presentation &amp; Cultural Take Away Lesson</strong></p>\n<ul>\n<li>Peer learning experience</li>\n<li>Quiz based on presentation for the audience</li>\n</ul>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Tutorial 8</strong>",
            "topic_description": "Tutorial 8 Group Presentation & Cultural Take Away Lesson Peer learning experience Quiz based on presentation for the audience",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Mid Sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-Semester Break</strong><br><p>No Lecture or Tutorials during In-Semester Break.  Independent learning.</p></br></p></div></td>",
            "topic_title": "<strong>In-Semester Break</strong>",
            "topic_description": "In-Semester Break No Lecture or Tutorials during In-Semester Break.  Independent learning.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>10 - International Human Resource Management</strong><br/><p>International Human Resource Management &amp; Selection Lecture</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>10 - International Human Resource Management</strong>",
            "topic_description": "10 - International Human Resource Management International Human Resource Management & Selection Lecture",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 9</strong><br/><p><strong>Group Presentation &amp; Cultural Take Away Lesson</strong></p>\n<ul>\n<li>Peer learning experience</li>\n<li>Quiz based on presentation for the audience</li>\n</ul>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Tutorial 9</strong>",
            "topic_description": "Tutorial 9 Group Presentation & Cultural Take Away Lesson Peer learning experience Quiz based on presentation for the audience",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>11 - Transpatriate skills</strong><br><p>Building Transpatriate Skills</p>\n<p>However, there are no tutorials on King's Birthday, Monday 7 October 2024.</p></br></p><p><strong>Learning outcomes:</strong> L01, L04, L05</p></div></td>",
            "topic_title": "<strong>11 - Transpatriate skills</strong>",
            "topic_description": "11 - Transpatriate skills Building Transpatriate Skills However, there are no tutorials on King's Birthday, Monday 7 October 2024.",
            "learning_outcomes": [
                "L01",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>No Tutorials</strong><br/><p>No Tutorials this week because of King's Birthday Public Holiday - Monday 7 October 2024. </p>\n<p>Note that there will still be a lecture this week.</p></p></div></td>",
            "topic_title": "<strong>No Tutorials</strong>",
            "topic_description": "No Tutorials No Tutorials this week because of King's Birthday Public Holiday - Monday 7 October 2024. Note that there will still be a lecture this week.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>12 - Transpatriate adjustment</strong><br/><p>Transpatriates' Adjustment.</p></p><p><strong>Learning outcomes:</strong> L01, L04, L05</p></div></td>",
            "topic_title": "<strong>12 - Transpatriate adjustment</strong>",
            "topic_description": "12 - Transpatriate adjustment Transpatriates' Adjustment.",
            "learning_outcomes": [
                "L01",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 10</strong><br/><p><strong>Group Presentation &amp; Cultural Take Away Lesson</strong></p>\n<ul>\n<li>Peer learning experience</li>\n<li>Quiz based on presentation for the audience</li>\n</ul>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Tutorial 10</strong>",
            "topic_description": "Tutorial 10 Group Presentation & Cultural Take Away Lesson Peer learning experience Quiz based on presentation for the audience",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Lecture",
            "topic": "<td data-title=\"Topic\"><div><p><strong>13 - Course Review and Q&amp;A</strong><br><p>Managing Diversity; Q&amp;A.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>13 - Course Review and Q&amp;A</strong>",
            "topic_description": "13 - Course Review and Q&A Managing Diversity; Q&A.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Tutorial",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Tutorial 11</strong><br/><p><strong>Group Presentation &amp; Cultural Take Away Lesson</strong></p>\n<ul>\n<li>Peer learning experience</li>\n<li>Quiz based on presentation for the audience</li>\n</ul>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Tutorial 11</strong>",
            "topic_description": "Tutorial 11 Group Presentation & Cultural Take Away Lesson Peer learning experience Quiz based on presentation for the audience",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}