{
    "course_title": "International Service Operations Management",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/IBUS7322-60259-7460",
    "full_course_code": "IBUS7322-60259-7460",
    "course_code": "IBUS7322",
    "class_code": "60259",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate an understanding of service operations management practices in international and domestic organisations"
        },
        {
            "number": "LO2.",
            "description": "Outline and understand the types of service operational processes in organisations"
        },
        {
            "number": "LO3.",
            "description": "Describe the major factors which influence service operations including in international organisations"
        },
        {
            "number": "LO4.",
            "description": "As an individual and in a team, demonstrate the use of international service operations management analytical tools to examine organisational problems and recommend solutions"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "International Service Operations Essay",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 9/10/2024 4:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>This is an individual assessment item (not a group assessment).</p>\n<p>You are required to write an essay of not more than 2000 words excluding the reference section, on the topic of improving the design of one specific international service operations process using the same organisation that your group chose for the oral presentation assessment. Note that in this Service Operations Management course we cover a wide range of concepts that students can use to map service operations and service processes. We have also cover concepts that can be applied to for instance identify and reduce waste, improve service quality, improve service process design etc and students should select the most relevant course concepts to assist them in writing persuasive arguments for making improvements to the deign of one service of your chosen company.</p>\n<p>You will write an essay that includes an introduction, body section (paragraphs) and conclusion (note that there are some resources we have provided below on this page on how to write and structure an essay). The body section of your essay will contain paragraphs. Each paragraph will make a persuasive argument that identify one key, important area for improvement supported by relevant course theory concepts (note that students need to conduct further reading beyond the textbook and beyond course readings of the relevant service operations management academic literature to make strong academic literature supported arguments for your suggested improvements) and also supported with secondary research evidence (eg from industry reports, industry journals, newspapers etc) and suggesting realistic solutions for these areas of improvement. </p>\n<p>There may be many aspects you could improve but you will need to prioritise! Be sure to clearly and persuasively argue in your essay using research evidence and theory to make a case for the most important opportunities for improvement in the design of one service process. You will need to provide secondary research evidence when arguing for making significant improvements (we recommend you only select two to three arguments/paragraphs for improving the design of the service and write concisely as the overall word count of this essay is only 2000 words). If it is a very large organisation/company that you have chosen, be sure to specify the specific service process you have chosen to focus on improving. </p>\n<p>Note that a key requirement of this assessment is that you need to cover a minimum of 3 course seminar topics in your essay (ie select highly relevant course concepts from 3 or more seminar weeks).</p>\n<p>You will be assessed on the depth and appropriateness of your international service operations academic literature as well as secondary research (evidence based market and academic literature research to base your analysis and recommendations on) and critical analysis as well as choice and depth of service process related discussion. As well as your ability to demonstrate understanding and apply relevant theory and use literature to support your arguments (concepts we have covered in this course - be sure to include a reference when stating/applying key concepts in your report).</p>\n<p>A minimum of 10 authoritative, relevant references must be included and to achieve a high level of achievement in this assessment you will need to exceed the minimum - please also refer to the assessment marking rubric.</p>\n<p>The appropriate service operations mapping, service charting, service process mapping and tools of analysis and Service Operations Management concepts should be applied. You are encouraged to include process maps, charts/graphs such as histograms or other visualisations in this essay to support your arguments.</p>\n<p>The purpose of the process of the company should be evident – what does service success look like through the eyes of the customer of your selected company? Reminder that you should also make clear what theoretical underpinning supports your discussion.</p>\n<p>Important Note: All assessment tasks in this course prohibit the use of AI. Assessment tasks evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submissions must be made through Turnitin via the Blackboard course site.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "International Service Operations Team Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>20%</dd>",
            "due_date": "<dd><p> Week 5 - Week 12</p>\n<p>\n</p><p>Each team will be allocated a seminar week to present.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Oral",
            "category": "Paper/ Report/ Annotation, Presentation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Students will be placed into teams. Each team will be allocated a week of the semester to present about real world companies service operations during the online seminar.</p>\n<p>Student teams must choose one international service organisation for developing their presentation. Teams will analyse the service operations of this organisation and focus their</p>\n<p>analysis on only ONE international service provided by this organisation. This assessment involves studying and critically analysing the service operational of a service</p>\n<p>organisation using service operations concepts and frameworks that were discussed in the course.</p>\n<p>Guidelines for selecting the service organisation are provided on the course Blackboard site.</p>\n<p>Based on your selected an international service your group will need to conduct secondary research and critically analyse including the application of theory and concepts from the</p>\n<p>two lecture topics that are assigned to your group (Refer to the course Blackboard site Assessment section) in the analysis (a minimum of 5 theory/concepts covered in this course from the Seminar topics specified in the table corresponding to your groups presentation week). </p>\n<p>The company's service operations must be compared and contrasted against at least one other competitor of the company and also compare and contrast against leading</p>\n<p>organisations in other industries. Students are required to work together in their team to analyse the company's international service operations and provide evidence-based</p>\n<p>recommendations for making improvements to the company’s international service operations for your chosen service. Recommendations need to be based on your previous</p>\n<p>analysis supported by secondary research evidence and incorporate course concepts and theory to support and justify your recommendations. In terms of presentation structure, students in their presentation will provide a brief overview of their topic, team and chosen company and the one particular international service you will focus on in your presentation. You will then present a critical analysis of the company's service operations as it relates to your specific company service that you have chosen to focus on (be sure to include at least one other company competitor and one other industry to compare/contrast). You will need to critically evaluate 2 to 3 alternative options for potential solutions and assess these using criteria your team has developed before deciding on your final recommended solution. You will then present your recommendations for improvements to the company's service operations and state your conclusions. Please refer to the marking rubric for full requirements. Your presentation need to be supported with at least 10 credible industry references as well as an additional 5 academic literature references to support and justify your critical analysis.</p>\n<p>Presentation timing - refer to the course Blackboard site Assessment section. All students must be present at the time of delivery of the presentation. Presentations need to</p>\n<p>be engaging the student audience in the class and actively involve the student audience through the use of interactive activities, well thought out questions etc.</p>\n<p>Generative text AI may not be used for this assessment item. Presentation slides must be submitted prior to the time of the presentation date via the course</p>\n<p>blackboard site. Full assessment task description is available on the course Blackboard site in the Assessment section. <strong>Please Note: </strong>The presentation will be recorded for marking purposes per UQ Policy.</p>\n<p>Criteria &amp; Marking: Refer to the full marking rubric available on the course Blackboard site</p>\n<p>All assessment tasks in this course prohibit the use of AI. Assessment tasks evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Presentation slides must be submitted prior to the time of the presentation date via the course Blackboard site.</p>",
            "deferral_or_extension": "<p>You cannot defer or apply for an extension for this assessment.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You cannot defer or apply for an extension for this assessment.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Take Home Assessment",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>50%</dd>",
            "due_date": "<dd><p>This assessment will be scheduled by the school and run for 48 hours during the examination period.</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The take home assignment be online and the format will be made up of short answer, short essay-style questions. </p>\n<p>Students will only receive the take home assessment item upon link being made available at the assessment start time this which starts the time e.g. 48 hours. If students fail to submit by the submission deadline a late penalty is applied.</p>\n<p>The assessment questions will be based on all course content covered this semester. </p>\n<p><em>All assessment tasks in this course prohibit the use of AI. Assessment tasks evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</em></p>\n<p>More details about the exam will be posted to the course Blackboard site.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Submit to the online take home assessment submission link on the course Blackboard site</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>1. Introduction to International Service Operations Management</strong><br/><p>Overview of course requirements and activities and covering introductory course topics - refer to the course Blackboard site for further details.</p></p><p><strong>Learning outcomes:</strong> L01, L03</p></div></td>",
            "topic_title": "<strong>1. Introduction to International Service Operations Management</strong>",
            "topic_description": "1. Introduction to International Service Operations Management Overview of course requirements and activities and covering introductory course topics - refer to the course Blackboard site for further details.",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>2. Service Operations Strategy</strong><br/><ul>\n<li>Class activities and discussion - refer to the course Blackboard site for further details.</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02</p></div></td>",
            "topic_title": "<strong>2. Service Operations Strategy</strong>",
            "topic_description": "2. Service Operations Strategy Class activities and discussion - refer to the course Blackboard site for further details.",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>3. Service Innovation &amp; Service Development</strong><br/><ul>\n<li>Class activities and discussion - refer to the course Blackboard site for further details.</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L04</p></div></td>",
            "topic_title": "<strong>3. Service Innovation &amp; Service Development</strong>",
            "topic_description": "3. Service Innovation & Service Development Class activities and discussion - refer to the course Blackboard site for further details.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>4. Globalization of Services &amp; Assessment Items Briefing</strong><br/><p>A briefing of the assessment items 1 &amp; 2.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>4. Globalization of Services &amp; Assessment Items Briefing</strong>",
            "topic_description": "4. Globalization of Services & Assessment Items Briefing A briefing of the assessment items 1 & 2.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>5. The Service Encounter</strong><br/><ul>\n<li>Class activities and discussion - refer to the course Blackboard site for further details.</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>5. The Service Encounter</strong>",
            "topic_description": "5. The Service Encounter Class activities and discussion - refer to the course Blackboard site for further details.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>6. Service Process Improvement</strong><br/><ul>\n<li>Class activities and discussion - refer to the course Blackboard site for further details.</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>6. Service Process Improvement</strong>",
            "topic_description": "6. Service Process Improvement Class activities and discussion - refer to the course Blackboard site for further details.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>7. Service Supply Relationships &amp; Networks</strong><br/><ul>\n<li>Class activities and discussion - refer to the course Blackboard site for further details.</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>7. Service Supply Relationships &amp; Networks</strong>",
            "topic_description": "7. Service Supply Relationships & Networks Class activities and discussion - refer to the course Blackboard site for further details.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>8. Service Quality</strong><br/><ul>\n<li>Class activities and discussion - refer to the course Blackboard site for further details.</li>\n<li>Student assessment presentations</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>8. Service Quality</strong>",
            "topic_description": "8. Service Quality Class activities and discussion - refer to the course Blackboard site for further details. Student assessment presentations",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>9. Digital Service Operations Management</strong><br/><ul>\n<li>Class activities and discussion - refer to the course Blackboard site for further details.</li>\n<li>Student assessment presentations</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>9. Digital Service Operations Management</strong>",
            "topic_description": "9. Digital Service Operations Management Class activities and discussion - refer to the course Blackboard site for further details. Student assessment presentations",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Mid Sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-Semester Break</strong><br/><p>No classes this week</p></p></div></td>",
            "topic_title": "<strong>In-Semester Break</strong>",
            "topic_description": "In-Semester Break No classes this week",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>10. Service Leadership &amp; Teams</strong><br/><ul>\n<li>Class activities and discussion - refer to the course Blackboard site for further details.</li>\n<li>Student assessment presentations</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>10. Service Leadership &amp; Teams</strong>",
            "topic_description": "10. Service Leadership & Teams Class activities and discussion - refer to the course Blackboard site for further details. Student assessment presentations",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>11. Sustainable Service Operations</strong><br/><ul>\n<li>Class activities and discussion - refer to the course Blackboard site for further details.</li>\n<li>Student assessment presentations</li>\n</ul>\n<p>King's Birthday Public Holiday - Monday 7 Oct 2024 - Check Blackboard for announcements about affected classes.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>11. Sustainable Service Operations</strong>",
            "topic_description": "11. Sustainable Service Operations Class activities and discussion - refer to the course Blackboard site for further details. Student assessment presentations King's Birthday Public Holiday - Monday 7 Oct 2024 - Check Blackboard for announcements about affected classes.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>12. Service Operations Performance &amp; Pursuit of Simplicity</strong><br/><ul>\n<li>Class activities and discussion - refer to the course Blackboard site for further details.</li>\n<li>Student assessment presentations</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>12. Service Operations Performance &amp; Pursuit of Simplicity</strong>",
            "topic_description": "12. Service Operations Performance & Pursuit of Simplicity Class activities and discussion - refer to the course Blackboard site for further details. Student assessment presentations",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>13. Final Assessment Briefing</strong><br/><ul>\n<li>Course review</li>\n<li>Student assessment presentations</li>\n</ul></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>13. Final Assessment Briefing</strong>",
            "topic_description": "13. Final Assessment Briefing Course review Student assessment presentations",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}