{
    "url": "https://course-profiles.uq.edu.au/course-profiles/MGTS3603-60268-7460",
    "full_course_code": "MGTS3603-60268-7460",
    "course_code": "MGTS3603",
    "class_code": "60268",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Explain SHRM theories, frameworks, models and general principles."
        },
        {
            "number": "LO2.",
            "description": "Apply SHRM concepts and models to diagnose, design, implement and evaluate SHRM policies and practices across the organizational, industry and societal contexts."
        },
        {
            "number": "LO3.",
            "description": "Communicate recommendations for improving SHRM policies and practices in both written and oral form, individually and collectively in a team."
        },
        {
            "number": "LO4.",
            "description": "Evaluate the social and ethical implications of particular SHRM practices."
        },
        {
            "number": "LO5.",
            "description": "Apply and evaluate the core functions of SHRM with the aim of leveraging individual, team and organizational productivity and well-being."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Topic evaluation portfolio",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "30%",
            "due_date": "7/08/2024 - 23/10/2024Submission is due by 5 pm on the following day of the corresponding seminar session.",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Portfolio, Reflection",
            "task_description": "Topic evaluation (30 marks)If your team is NOT presenting in the scheduled seminar session (W3-W13), each student will individually prepare and submit a topic evaluation. Students evaluate the topic content presented by the workshop presentation team, by completing topic evaluation worksheets that are available in the weekly folder of Learning Resources on course Blackboard. Completion of topic evaluation worksheet is based on learning from workshop presentation, the previous week's lecture, the previous week's weekly case study analysis. Students are required to submit six (6) topic evaluations in writing, choosing from a pool of nine (9) choices. Each submission is worth 5 marks.This is an individual assignment; any copying or plagiarism is equivalent to cheating on an assignment and will be handled as such.Topics and a template for Topic Evaluations are available in the Assessment section on the course Blackboard.Length: no longer than three (3) pages (1.5 lines spacing, 12-point font size)This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "Submit via submission links in the Assessment section on course Blackboard",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "You will receive a mark of 0 if this assessment issubmitted late.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Workshop presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "30%",
            "due_date": "5/08/2024 - 21/10/2024Submit the presentation materials by 5 pm on the day before the presentation session.Present during one of the seminars in the weeks from Week 3 to Week 13.",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "In teams of 4 to 5 students, you will design and run a workshop of 25 minutes duration to present to the class in seminar sessions. All team members have to be involved in the presentation.The aim of the workshop is to teach the class an element of the content presented by the lecturer in the previous seminar. In this way, student learning of the main concepts will be reinforced.In the workshop you will:Teach the class a specific topic closely aligned with the main content of the relevant lecture (to be agreed with the lecturer before proceeding).Demonstrate how this topic can be/is put into practice.Engage the class in identifying how the content can be applied to their particular business/industry/field of expertise.Submission: Please submit the presentation materials via submission links in the Assessment section on course Blackboard, by 5 pm on the day before the presentation session.Group formation: Attendance at the Week 1 seminar for allocation to a group is CRITICAL for this assessment item. Non-attendance will result in exclusion from the assessment item, unless for medical or compassionate grounds for which documentation must be supplied.AI Statement:This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "Please submit the presentation materials via submission links in the Assessment section on course Blackboard, by 5 pm on the day before the presentation session.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Case study Practical",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "40% Individual",
            "due_date": "15/10/2024 10:15 am8:00 am to 10:15 am",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "This assessment consists of a capstone case study analysis, which will be completed individually and submitted on the Blackboard site. The aim of the assessment is for students to apply and integrate SHRM theories and frameworks to articulate by analysing a case scenario/materials. You will individually select and develop your own solutions(s) for the case company.You will be expected to respond to the focal questions in a short-answer essay format.The format of the focal questions will be similar to those of the weekly case analyses. The content of the questions may cover any of the lecture topics and/or readings discussed throughout the course, requiring a cumulative understanding of course content.Notes:1. The case study will be provided to you at the beginning of Week 11, to give you sufficient time to review the case material and allow clarification. The case study questions will be provided at 8 am on 15 Oct (Week 12). You will get 2 hours to work on and submit the case study questions.2. This is an open-book assessment. You will be allowed to access any online, printed or written resources. You are expected to commit yourself to academic integrity and assure you are generating your own responses.3. More details about the assessment will be discussed in class and posted to our course Blackboard site.This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "The assignment must be submitted in exam booklet in person.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Seminar",
            "topic": "IntroductionIntroduction to the course, discussion of learning objectives, learning activities and assessments, and group allocation in relation to Case Study Practical Assessment.",
            "topic_title": "Introduction",
            "topic_description": "Introduction to the course, discussion of learning objectives, learning activities and assessments, and group allocation in relation to Case Study Practical Assessment.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Seminar",
            "topic": "The goals of human resource managementUnderstand the goals and tensions in human resource managementLearning outcomes:L01, L02, L03, L04",
            "topic_title": "The goals of human resource management",
            "topic_description": "Understand the goals and tensions in human resource management",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Seminar",
            "topic": "Strategy and strategic managementDiscuss strategic problems facing firms and the process of strategy managementLearning outcomes:L02, L03, L04",
            "topic_title": "Strategy and strategic management",
            "topic_description": "Discuss strategic problems facing firms and the process of strategy management",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Seminar",
            "topic": "Strategic HRM: 'best fit' or 'best practice'?Discuss best fit and best practice schoolsLearning outcomes:L01, L02, L03",
            "topic_title": "Strategic HRM: 'best fit' or 'best practice'?",
            "topic_description": "Discuss best fit and best practice schools",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Seminar",
            "topic": "Strategic HRM & sustained competitive advantageExamine how HRM can help generate and sustain a competitive advantage based on the Resource-based view of the firm.Learning outcomes:L01, L02, L03, L04",
            "topic_title": "Strategic HRM & sustained competitive advantage",
            "topic_description": "Examine how HRM can help generate and sustain a competitive advantage based on the Resource-based view of the firm.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Seminar",
            "topic": "Building a workforce: interest alignmentTo discuss the challenges that managers face in aligning their interests with those of workers as they try to build and renew a workforce.Learning outcomes:L01, L02, L03",
            "topic_title": "Building a workforce: interest alignment",
            "topic_description": "To discuss the challenges that managers face in aligning their interests with those of workers as they try to build and renew a workforce.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Seminar",
            "topic": "Management power,employee voice & legitimacyTo understand the contested nature and changing contours of employee voice and management style in employee relationsLearning outcomes:L01, L02, L03",
            "topic_title": "Management power,employee voice & legitimacy",
            "topic_description": "To understand the contested nature and changing contours of employee voice and management style in employee relations",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Seminar",
            "topic": "Workforce performance and the black-box of HRMTo understand the black box of factors that links HRM to such business outcomes as productivity, quality and profit.Learning outcomes:L01, L02, L03",
            "topic_title": "Workforce performance and the black-box of HRM",
            "topic_description": "To understand the black box of factors that links HRM to such business outcomes as productivity, quality and profit.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Seminar",
            "topic": "HR strategy in manufacturingTo analyse HR strategy in manufacturing.Learning outcomes:L01, L02, L03, L04",
            "topic_title": "HR strategy in manufacturing",
            "topic_description": "To analyse HR strategy in manufacturing.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Mid Sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "In-Semester Break",
            "topic_title": "In-Semester Break",
            "topic_description": "",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Seminar",
            "topic": "HR strategy in servicesTo analyse HR strategy in private sector servicesLearning outcomes:L01, L02, L03",
            "topic_title": "HR strategy in services",
            "topic_description": "To analyse HR strategy in private sector services",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Seminar",
            "topic": "HR strategy in multinational firmsTo analyse HR strategy in multinational firms. Examine local adaptation and social legitimacy in multinational firms.Learning outcomes:L01, L02, L03, L04",
            "topic_title": "HR strategy in multinational firms",
            "topic_description": "To analyse HR strategy in multinational firms. Examine local adaptation and social legitimacy in multinational firms.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Seminar",
            "topic": "Case Analysis Practical (PracticalAssessment #3: In-class Case Analysis Practical.Attendance is mandatory.Learning outcomes:L01, L02, L03, L04",
            "topic_title": "Case Analysis Practical (Practical",
            "topic_description": "Assessment #3: In-class Case Analysis Practical.\nAttendance is mandatory.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Seminar",
            "topic": "Course Reflection & Major themes of the courseCourse wrap up, reflection on the major themes of the course and learning during the semester. This seminar also provides information about the final assessment.Learning outcomes:L01, L04",
            "topic_title": "Course Reflection & Major themes of the course",
            "topic_description": "Course wrap up, reflection on the major themes of the course and learning during the semester. This seminar also provides information about the final assessment.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        }
    ]
}