{
    "url": "https://course-profiles.uq.edu.au/course-profiles/MGTS7523-60275-7460",
    "full_course_code": "MGTS7523-60275-7460",
    "course_code": "MGTS7523",
    "class_code": "60275",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Understand the feedback processes that determine system behaviour"
        },
        {
            "number": "LO2.",
            "description": "Construct Causal Loop Diagrams to explain system behaviour"
        },
        {
            "number": "LO3.",
            "description": "Use Stock & Flow models to simulate system behaviour"
        },
        {
            "number": "LO4.",
            "description": "Apply the principles and tools of systems thinking and system dynamics"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Mid-Semester Exam (Modules 1 - 5)",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "20%",
            "due_date": "30/08/2024 1:50 pmThis is an in-person exam that will take place during the seminar time for this subject (12:00 - 14:00)",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Examination",
            "task_description": "This is a closed-book in-person exam that covers the content of modules 1 - 5 for this subject. You will be presented with five (5) questions and you will have to answer all five (5) of these. You will have 1 hour and 40 minutes to complete the exam.This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "You may be able todefer this exam.",
            "deferral_or_extension": "You may be able todefer this exam.",
            "late_submission": "You will receive a mark of 0 if this assessment issubmitted late.",
            "additional_info": "You may be able to\ndefer this exam\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Systems Thinking Report and Video Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "40% (Report = 20%, Video presentation = 20%)",
            "due_date": "20/09/2024 5:00 pm",
            "learning_objectives": "L01, L02",
            "mode": "Product/ Artefact/ Multimedia, Written",
            "category": "Paper/ Report/ Annotation, Presentation",
            "task_description": "Students, in groups (4 to 5 people per group), are to prepare a report based around a dynamic problem selected from the selection of topics provided within the course. This report will draw upon the first two steps of the Systems Method (Sterman, 2000; Module 2) of (i) Problem Articulation and (ii) Dynamic Hypothesis. Groups will also present their work in a 5 minute video presentation that summarises the key parts of their report.The target audience for the written report is a technical working group that has a good understanding of the technical issues associated with the problem.The target audience for the video are managerial-level stakeholders who need to make decisions based on the information that presented to them in the presentation.REPORT: Groups will be provided with a template that outlines the sections required in the report.VIDEO PRESENTATION: Groups will prepare a 5 minute video presentation that summarises the key parts of their report. Note that at least 2 two team members must present (but it is not a requirement that all team members present).PEER ASSESSMENT:In order to obtain a passing grade in this course, all assessment items must be genuinely attempted and submitted.This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "Submission consists of 1 written report and 1 presentation video. Only one submission is required per group.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "System Dynamics Modelling Assignment",
            "special_indicators": [],
            "weighting": "40%",
            "due_date": "25/10/2024 5:00 pm",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation, Role play/ Simulation",
            "task_description": "Your task is to use the instructions provided in the assignment sheet to build system dynamic models (in STELLA Architect software) to answer associated questions. Students will also be required to use an existing system dynamics model to develop a strategy for addressing a problem highlighted by this existing model.The assignment sheet will be made available on the course Blackboard site. Answers to these questions are to be provided as a written document (word or pdf).In order to obtain a passing grade in this course, all assessment items must be genuinely attempted and submitted.This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "This assessment is to be submitted electronically via the course Blackboard site. Submissions via email or in hardcopy will not be permitted. The name of the file submitted should contain your full name (e.g. John_Smith_MGTS7523_Assignment_3). Please submit in Microsoft Word format. Legal Declaration: By submitting your work via this website, you formally declare that (1) it is your own original work, and no part of the work has been copied from any other source or person except where due acknowledgement is made; (2) no part of the work has been previously submitted for assessment in this or any other institution; and (3) you have read the UQ Academic Integrity and Plagiarism Policy (http://ppl.app.uq.edu.au/content/3.60.04-student-integrity-and-misconduct) and understand its implications.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Seminar",
            "topic": "Systems Thinking IntroductionMacquarie Island ExampleIntroduction to Systems ThinkingApplying System Thinking to the Du Pont ExampleExercise - Playing the Macquarie Island GameLearning outcomes:L01, L04",
            "topic_title": "Systems Thinking Introduction",
            "topic_description": "Macquarie Island Example\nIntroduction to Systems Thinking\nApplying System Thinking to the Du Pont Example\nExercise - Playing the Macquarie Island Game",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Seminar",
            "topic": "Systems MethodThe Systems Method in DetailExercise - The Lobster Game; Four Levels of Systems ThinkingLearning outcomes:L04",
            "topic_title": "Systems Method",
            "topic_description": "The Systems Method in Detail\nExercise - The Lobster Game; Four Levels of Systems Thinking",
            "learning_outcomes": [
                "L04"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Seminar",
            "topic": "Causal Loop ModellingIntroduction to Causal Loop Modelling and Vensim software Activity - Drawing CLDs Exercise - Lobster GameLearning outcomes:L01, L02, L04",
            "topic_title": "Causal Loop Modelling",
            "topic_description": "Introduction to Causal Loop Modelling and Vensim software Activity - Drawing CLDs Exercise - Lobster Game",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Seminar",
            "topic": "Structure and Behaviour of Dynamic SystemsStructure and Behaviour of Dynamic Systems in DetailExercise - Explaining Policy Resistance - Traffic CongestionExercise - The Business School Game / The 'Beer' gameLearning outcomes:L01, L02, L04",
            "topic_title": "Structure and Behaviour of Dynamic Systems",
            "topic_description": "Structure and Behaviour of Dynamic Systems in Detail\nExercise - Explaining Policy Resistance - Traffic Congestion\nExercise - The Business School Game / The 'Beer' game",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Seminar",
            "topic": "System ArchetypesSystem Archetypes - Fixes that Fail; Shifting the Burden; Limits to Growth; Eroding Goals; Escalation; Success to the Successful; Tragedy of the Commons Exercise'Sustainable Fish' game (Tragedy of the Commons)Learning outcomes:L01, L02, L04",
            "topic_title": "System Archetypes",
            "topic_description": "System Archetypes - Fixes that Fail; Shifting the Burden; Limits to Growth; Eroding Goals; Escalation; Success to the Successful; Tragedy of the Commons Exercise \n'Sustainable Fish' game (Tragedy of the Commons)",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "General contact hours",
            "topic": "In-semester examination (in-person, closed book)In-person closed-book examination covering modules 1 - 5Learning outcomes:L01, L02",
            "topic_title": "In-semester examination (in-person, closed book)",
            "topic_description": "In-person closed-book examination covering modules 1 - 5",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Seminar",
            "topic": "Stock and Flow ModelsIntroduction to Stock and Flow Models and STELLA Architect software. Using Stock and Flow models - building a simple Linear Behaviour Model Building an exponential Growth model (population growth)",
            "topic_title": "Stock and Flow Models",
            "topic_description": "Introduction to Stock and Flow Models and STELLA Architect software. Using Stock and Flow models - building a simple Linear Behaviour Model Building an exponential Growth model (population growth)",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Seminar",
            "topic": "Dynamics of Stocks and FlowsStock and Flow Models continued. The power of the 'goal-seek' model in stock and flow models using STELLA Architect",
            "topic_title": "Dynamics of Stocks and Flows",
            "topic_description": "Stock and Flow Models continued. The power of the 'goal-seek' model in stock and flow models using STELLA Architect",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Seminar",
            "topic": "Dynamics of Simple StructuresClimate change and its dynamics.Playing EN-ROADS - the Climate GameExercise - Modelling Linear Feedback",
            "topic_title": "Dynamics of Simple Structures",
            "topic_description": "Climate change and its dynamics.\nPlaying EN-ROADS - the Climate Game\nExercise - Modelling Linear Feedback",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid Sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "IN-SEMESTER BREAK",
            "topic_title": "IN-SEMESTER BREAK",
            "topic_description": "",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Seminar",
            "topic": "Unstructured (Dynamics of Simple Structures continued)Linear Feedback SystemsDynamics of Simple Structures - Multiple Loop and Non-Linear Feedback SystemsExercise - Modelling Non-Linear Feedback",
            "topic_title": "Unstructured (Dynamics of Simple Structures continued)",
            "topic_description": "Linear Feedback Systems\nDynamics of Simple Structures - Multiple Loop and Non-Linear Feedback Systems\nExercise - Modelling Non-Linear Feedback",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Seminar",
            "topic": "Dimensionless Multipliers; Value-add of modelsThe power (and the problem) of including fuzzy cause-effect relationships in system dynamics models using dimensionless multipliers. Exercise - Dimensionless Multipliers",
            "topic_title": "Dimensionless Multipliers; Value-add of models",
            "topic_description": "The power (and the problem) of including fuzzy cause-effect relationships in system dynamics models using dimensionless multipliers. Exercise - Dimensionless Multipliers",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Seminar",
            "topic": "Material and Information DelaysMaterial and Information Delays Exercise - Material and Information Delays",
            "topic_title": "Material and Information Delays",
            "topic_description": "Material and Information Delays Exercise - Material and Information Delays",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Seminar",
            "topic": "Course overview - final assignment workshopA re-cap of this course and what it might mean for future work opportunities. Also a chance to work on the final assessment item (Assignment#3)",
            "topic_title": "Course overview - final assignment workshop",
            "topic_description": "A re-cap of this course and what it might mean for future work opportunities. Also a chance to work on the final assessment item (Assignment#3)",
            "learning_outcomes": []
        }
    ]
}