{
    "course_title": "Cross Cultural Management",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/MGTS7329-60274-7460",
    "full_course_code": "MGTS7329-60274-7460",
    "course_code": "MGTS7329",
    "class_code": "60274",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Demonstrate an in-depth understanding of how culture(s) influence cross-cultural management."
        },
        {
            "number": "LO2.",
            "description": "Conduct independent research to develop individual and team written, as well as oral projects."
        },
        {
            "number": "LO3.",
            "description": "Have knowledge of working with multicultural groups."
        },
        {
            "number": "LO4.",
            "description": "Apply relevant theories and/or frameworks to analyse concepts and/or issues in cross-cultural management."
        },
        {
            "number": "LO5.",
            "description": "Evaluate ethical and social issues associated with operating in an international business context."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Group Cross-Cultural Reflection & Emic Analysis",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p>Written Assessment 25/07/2024 - 29/08/2024</p>\n<p>Presentation Slides 5/09/2024 - 3/10/2024</p>\n<p>Take-Away Lesson 5/09/2024 - 3/10/2024</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Oral, Product/ Artefact/ Multimedia, Written",
            "category": "Paper/ Report/ Annotation, Participation/ Student contribution, Presentation, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Your task in this assignment (as a multicultural group) is to abstract concepts from the <em>Culture Stimulus</em> and analyse the issue(s) from a cross-cultural perspective, then develop a topic that is relevant to international business and/or cross-cultural management.<strong> Please see the MGTS7329 Assignment Guide available on Blackboard for <em>full details, criteria and rubric. </em>Students must follow the criteria found in the assignment guide provided on Blackboard to pass the assignment.</strong></p>\n<p><strong>All aspects of this assignment relate to employability building skills.</strong></p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct. This includes dictionary and translation applications (APPs).</p>\n<p>This entire group assignment is worth 40% of your final mark. The assignment consists of multiple parts, all group members must participate in all aspects of the assignment, please consult your assignment guide for details. Not submitting the individual contribution materials will exclude you from receiving the group’s mark, since it implies you made no contribution(s) to the group assignment.</p>\n<p><strong>Groups will be randomly created by the course coordinator/facilitator. Team changes deadline is week 3. Once the teams are created you must contact your group by the end of week 3 or risk not having a group and conducting the assignment by yourself<em>, as well as losing out on group marks. </em></strong>48 hours is a reasonable response time, or as agreed in the team charter.</p>\n<p><strong>Each group will be randomly assigned a presentation date. All are in the same situation, so please take note of your presentation time and adjust your schedule accordingly.</strong></p>\n<p><strong>Peer Evaluation: </strong> The purpose of this evaluation is to assess a member’s contribution to the group effort. Group members may contribute to the group along various dimensions. These include their organisation/project management, knowledge/research, communication, and responsibility, including supporting the group and members in any way. Use the 9-point rating scale given below to rate yourself and members of your group. Please be as objective as possible, taking behaviours rather than personal style into consideration. <strong>Peer reviews are compulsory to ensure that a contribution score is available for all moderation.</strong></p>\n<p><strong>Instructions:</strong> You are required to assess your peers on their contribution to the group assignment by allocating each group member a mark in each of the four criteria. For each criterion, allocate a mark between one and six, where a mark of one <strong>(1) indicates</strong> <strong>no contribution</strong> or submitting contribution passed the agreed group deadline, and a mark of <strong>nine (9) indicates that they made the maximum contribution possible. </strong></p>\n<p>1 = Person demonstrated <strong>no contribution in this criterion</strong> or submitted contributions past the agreed-upon group deadline.</p>\n<p>1.01 – 1.99 = Person demonstrated a low contribution to the group in this criterion.</p>\n<p>2 – 3.99 = Person demonstrated a medium-low contribution to the group in this criterion.</p>\n<p>4 – 5.99 = Person demonstrated a medium-level contribution to the group in this criterion.</p>\n<p>6 – 8.4 = Person consistently demonstrated a medium-high level of contribution to the group in this criterion.</p>\n<p>8.5 - 9 = Person consistently demonstrated high-level contribution to the group in a criterion.</p>\n<p>·        A mark of six (6) or less (1 to 6), based on the above guide (out of 9) for any criteria, requires a comment; otherwise, it is invalid.</p>\n<p>·        To take account of the possibility that a student does not contribute to one or all criteria, 1 signifies that a student has not contributed.</p>\n<p>·        Peer reviews are compulsory and must be submitted within five days of the assessment due date, <em>not submitting peer reviews may decrease marks. </em>If no peer review is received from a student after 5 days, then no contribution scores are calculated and not available for all moderation. No exceptions! </p>\n<p><strong>Important Mark Moderation Based on Peer Review – highest score is 9, see explanation below.</strong></p>\n<p><strong>The moderation of individual marks will be based on the following overall average review):</strong></p>\n<p><strong>·        8.5 to 9.0</strong> (consistently demonstrated full contribution to group), <strong>no deduction from group mark.</strong></p>\n<p><strong>·        8.0 to 8.4 </strong>(demonstrated medium-high level contribution)<strong> 5% deduction from group mark.</strong></p>\n<p><strong>·        6.0 to 7.99 </strong>(demonstrated medium level contribution), <strong>15% deduction from group mark.</strong></p>\n<p><strong>·        3.0 to 5.99</strong> (demonstrated medium-low contribution), <strong>25% deduction from group mark.</strong></p>\n<p><strong>·        1.01 to 2.99</strong> (demonstrated low contribution in several criteria or submitted contribution passed agreed group deadline), <strong>50% deduction from group mark</strong>.</p>\n<p>·        <strong>1, no individual mark will be awarded.</strong>  </p>\n<p><strong>Criteria 1: Organisation/Project Management</strong></p>\n<p>Allocate a mark between one (1) and six (6) for all criterion to each team member for their role in contributing to the process needed to complete the assignment.</p>\n<ul>\n<li>Consider their approach to setting up meeting times and work submission deadlines as well as their willingness to listen to other team members' opinions.</li>\n</ul>\n<p><strong>Criteria 2: Knowledge/research</strong></p>\n<p>Allocate a mark to each team member for their contribution of research, knowledge, opinions, and skills to team discussions and work completion.</p>\n<ul>\n<li>Maintaining academic integrity (ensuring original work; no plagiarised and/or AI-generated materials).</li>\n</ul>\n<p><strong>Criteria 3: Communication</strong></p>\n<p>Allocate a mark to each team member for how well they collaborated and communicated with others in the team and fulfilled their roles within the team. To determine your mark consider if each team member:</p>\n<ul>\n<li>was present at all meetings, as long as feasibly possible(either in person or via phone/online) (barring legitimate reasons);</li>\n<li>played an active role in facilitating agreement and resolving conflict and;</li>\n<li>provided timely responses to all communications and queries.</li>\n</ul>\n<p><strong>Criteria 4: Responsibility</strong></p>\n<p>Allocate a mark to each team member for how well they took responsibility for the team’s outcome, and consistently acted in a manner that demonstrated they were keen for the team to perform well (e.g., supporting the team).</p>\n<ul>\n<li>This includes ensuring that the English language is used in all forms of communication. Since the official language of Australia is English, non-compliance can lead to assessments awarded the mark of zero, and non-compliance in group/team settings be interpreted as exclusionary behaviour, a form of bullying and a serious offence.</li>\n</ul>\n<p><strong>AI Statement</strong></p>\n<p>This assessment task evaluates students' abilities, skills, and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Only one electronic copy of the assignment per group must be submitted to Turnitin via Blackboard.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Cross-Cultural Work Adjustment Assignment",
            "special_indicators": [],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p> 17/10/2024 1:00 pm</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Activity/ Performance, Written",
            "category": "Essay/ Critique, Practical/ Demonstration, Project",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The objective of this practical assignment is for you to learn about cross cultural work experiences and/or general adjustment processes of working in a different culture or cultures. Thus, you are required to analyse the applicability of management concept(s) across cultures and/or issues that face people when they are placed in a new work environment in another culture(s).</p>\n<p>This practical project is an <strong>individual assignment.</strong> You are required to interview people who have had work experience in at least two (2) nations for longer than six months in each nation. The interviews will be the basis of a case study on how culture affects work and/or general adjustment to work environments in Australia or other nations.</p>\n<p>All aspects of this assignment relate to employability building skills. In particular, towards building cultural empathy and considering competing perspectives.</p>\n<p>This assessment task evaluates students' abilities, skills and knowledge without the aid of Artificial Intelligence (AI), including dictionary and translation Apps. Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct. </p>\n<p><strong>SUBMISSION REQUIREMENTS:</strong></p>\n<p><strong>Please see the MGTS7329 Assignment Guide available on Blackboard for full details, criteria and rubric. </strong></p>\n<p><strong>Students must follow the criteria found in the assignment guide provided on Blackboard to pass the assignment.</strong></p>\n<p><strong>You must submit a copy of your interview transcripts and consent forms.</strong></p>\n<p><strong>AI Statement</strong></p>\n<p>This assessment task evaluates students' abilities, skills, and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>Only an electronic copy of your assignment must be submitted to Turnitin via Blackboard. </p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Final Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--education--bookmarks-document icon-text--small",
                    "special_indicator_text": "Identity Verified"
                },
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "<dd>30%</dd>",
            "due_date": "<dd><p>End of Semester Exam Period</p>\n<p>2/11/2024 - 16/11/2024</p></dd>",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Written",
            "category": "Examination",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>The final exam will address all materials covered in the course, seminars and readings. This course's seminar objectives and class discussions will form the basis for the examination questions. It is important that you take time to revise your understanding of all seminar objectives and relevant course content. Past experience indicates that students need to study in order to pass the final examination.</p>\n<p>You will be given 10 minutes perusal time and 90 minutes working time. The exam will include short essay, extended essay or case study (problem solving) questions.</p>\n<p><strong>AI Statement</strong></p>\n<p>This assessment task evaluates students' abilities, skills, and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>You will receive a mark of 0 if this assessment is <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">submitted late</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Introduction</strong><br><p>Introduction.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05</p></div></td>",
            "topic_title": "<strong>Introduction</strong>",
            "topic_description": "Introduction Introduction.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Imperative and challenging role of international manager</strong><br><p>Imperative and challenging role of international manager. (Class interactive discussion; In-class case study).</p>\n<p>Compulsory integrity tutorial must be completed prior to any assessment submission in this course. https:/<a href=\"http://www.uq.edu.au/integrity/\">/www.uq.edu.au/integrity/</a></p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Imperative and challenging role of international manager</strong>",
            "topic_description": "Imperative and challenging role of international manager Imperative and challenging role of international manager. (Class interactive discussion; In-class case study). Compulsory integrity tutorial must be completed prior to any assessment submission in this course. https:/ /www.uq.edu.au/integrity/",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Describing &amp; comparing cultures</strong><br><p>Describing culture and comparing cultures. (Class interactive activity).</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Describing &amp; comparing cultures</strong>",
            "topic_description": "Describing & comparing cultures Describing culture and comparing cultures. (Class interactive activity).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Cross-cultural dimensions of decision making</strong><br><p>Cross cultural dimensions of decision making. (Class interactive discussion; In-class case study).</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05</p></div></td>",
            "topic_title": "<strong>Cross-cultural dimensions of decision making</strong>",
            "topic_description": "Cross-cultural dimensions of decision making Cross cultural dimensions of decision making. (Class interactive discussion; In-class case study).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Ethics in a global context</strong><br><p>Ethics in a global context. (Class interactive discussion).</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05</p></div></td>",
            "topic_title": "<strong>Ethics in a global context</strong>",
            "topic_description": "Ethics in a global context Ethics in a global context. (Class interactive discussion).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Fundamentals of cross-cultural interations</strong><br><p>Fundamentals of cross-cultural interations: Culture simulation, interactive activity; observations and reflective activity.</p></br></p><p><strong>Learning outcomes:</strong> L01, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Fundamentals of cross-cultural interations</strong>",
            "topic_description": "Fundamentals of cross-cultural interations Fundamentals of cross-cultural interations: Culture simulation, interactive activity; observations and reflective activity.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Communication across cultures</strong><br/><p>Communication across cultures. (Class interactive discussion; In-class video case study).</p>\n<p><br/></p></p><p><strong>Learning outcomes:</strong> L01, L02, L04, L05</p></div></td>",
            "topic_title": "<strong>Communication across cultures</strong>",
            "topic_description": "Communication across cultures Communication across cultures. (Class interactive discussion; In-class video case study).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Cross-cultural negotiations</strong><br><p>Negotiation across cultures. (In-class case study).</p>\n<p>*Presentation/Peer Learning Activity. Note: Depending on class size, the Group Oral Presentations may take place in Week 8 or Week 12; the date will be determined by Week 2.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Cross-cultural negotiations</strong>",
            "topic_description": "Cross-cultural negotiations Negotiation across cultures. (In-class case study). *Presentation/Peer Learning Activity. Note: Depending on class size, the Group Oral Presentations may take place in Week 8 or Week 12; the date will be determined by Week 2.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Motivation &amp; leadership across cultures</strong><br/><p>Motivation and leadership across cultures. (in-class case study).</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Motivation &amp; leadership across cultures</strong>",
            "topic_description": "Motivation & leadership across cultures Motivation and leadership across cultures. (in-class case study).",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Mid Sem break",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>In-Semester Break</strong><br/><p>No Seminar during In-Semester Break</p></p></div></td>",
            "topic_title": "<strong>In-Semester Break</strong>",
            "topic_description": "In-Semester Break No Seminar during In-Semester Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Family business &amp;  implementing international strategy</strong><br/><p>Family business &amp; implementing international strategy. </p>\n<p>*Due to class sizes, this scheduled topic may change or delivered in a different week.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Family business &amp;  implementing international strategy</strong>",
            "topic_description": "Family business &  implementing international strategy Family business & implementing international strategy. *Due to class sizes, this scheduled topic may change or delivered in a different week.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>International assignment &amp; selection</strong><br/><p>International assignments and Selection. (in-class case study). </p>\n<p>*Due to class sizes, this scheduled topic may change or delivered in a different week.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>International assignment &amp; selection</strong>",
            "topic_description": "International assignment & selection International assignments and Selection. (in-class case study). *Due to class sizes, this scheduled topic may change or delivered in a different week.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Presentation based on team assignments</strong><br/><p>*Presentation/Peer Learning Activity.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Presentation based on team assignments</strong>",
            "topic_description": "Presentation based on team assignments *Presentation/Peer Learning Activity.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Managing across cultures in the future &amp; Q&amp;A</strong><br/><p>Managing across cultures in the future</p>\n<p>*If required, completion of Presentation/Peer Learning Activity.  Please see note in Week 8.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04, L05</p></div></td>",
            "topic_title": "<strong>Managing across cultures in the future &amp; Q&amp;A</strong>",
            "topic_description": "Managing across cultures in the future & Q&A Managing across cultures in the future *If required, completion of Presentation/Peer Learning Activity.  Please see note in Week 8.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}