{
    "url": "https://course-profiles.uq.edu.au/course-profiles/MGTS7605-60279-7460",
    "full_course_code": "MGTS7605-60279-7460",
    "course_code": "MGTS7605",
    "class_code": "60279",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Evaluate and design performance management systems that align fundamental management theory, organisational goals, and ethical principles."
        },
        {
            "number": "LO2.",
            "description": "Evaluate the impact of performance management on employee motivation, engagement, and organisational performance."
        },
        {
            "number": "LO3.",
            "description": "Develop strategies for optimising performance management in organisations, integrating technology, data analytics, and best practices."
        },
        {
            "number": "LO4.",
            "description": "Demonstrate effective collaboration with peers through constructive feedback and coaching to enhance performance."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "In-class Quiz",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                },
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "50% 30% Individual 20% Team",
            "due_date": "5/08/2024 - 21/10/2024",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Quiz",
            "task_description": "Team Formation:At the start of the semester, you will be randomly assigned to a team. Teams are formed by the instructor and you will not have the option to choose your peers. The composition of teams will remain constant throughout the semester, promoting stable group dynamics and consistent collaboration.Quiz Structure and Schedule:Each week, you will take a quiz based on the course content. The quizzes will be conducted in two modes: individually and then as a team.Weeks 1-2:Quizzes will be formative (ungraded) and serve as practice to familiarize you with the quiz format and course content.Weeks 3-13:Quizzes will be summative (graded) and will significantly influence your final grade.During class each week you will complete an individual quiz. Later in that same class you will complete a team quiz on the same material. The team and individual quizzes will contain identical questions.Scoring and Grades:Individual Quizzes:Your performance in these quizzes will account for 30% of your semester grade.Team Quizzes:These will contribute 20% to your semester grade. The combined score from individual and team quizzes makes up 50% of your final grade.It is expected that team quiz scores will generally be higher than individual scores, reflecting effective communication and collaboration within teams.Teamwork and Collaboration:Success in team quizzes requires not only a thorough understanding of the course content but also effective communication skills. You will need to discuss quiz answers with your team members, apply course concepts in real-time, and convince your peers of the correct answers, mirroring real-world professional scenarios.Conflict Resolution:In the event of disagreements during team quizzes, groups will need to employ negotiation strategies discussed in the course. Leveraging HR concepts to manage group dynamics effectively is an integral part of the learning process and will enhance your practical understanding of the course material.AI tools and technologies are prohibited in this assessment and any detected use will be considered misconduct.Read full task descriptionHide full task description",
            "submission_guidelines": "Individual and group quizzes will be submitted via BlackBoard.",
            "deferral_or_extension": "You may be able todefer this exam.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\ndefer this exam\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Evaluate and Design a Performance Management System",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "50% 40% Team 10% Individual",
            "due_date": "4/11/2024 2:00 pm",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Presentation",
            "task_description": "Task Description:For this assessment, you will present an evaluation and design of a Performance Management System. This is a group project where you'll create and submit a pre-recorded video presentation,not to exceed 15 minutes in duration. In this presentation, your group will use concepts from the entire course to evaluate and design a performance management system within an organization that aligns fundamental management theory, organizational goals, and ethical principles. You must also evaluate the impact of this performance management system on employee motivation, engagement, and organizational performance. Your designed system should optimize performance management while integrating technology, data analytics, and best practices. You are also encouraged to include any other relevant topics you deem essential to make a persuasive case.This task emphasizes collaborative effort and it is crucial that all team members contribute meaningfully to the presentation. Your teamwork on this assessment will contribute 40% to your semester grade, and individual contributions will be separately measured using peer evaluation, accounting for 10% of your semester grade. This presentation is not just about presenting facts; it's about working as a team to effectively communicate a comprehensive and convincing argument.This task has been designed to be challenging, authentic, and complex.AI tools and technologies are prohibited in this assessment and any detected use will be considered academic misconduct.Additional Clarifications:1. Scope and Objective:- The evaluation and design of the Performance Management System is not limited to a specific type of organization; it can be corporate, non-profit, government, etc.- Through analysis of the performance management system, teams should identify which concepts from the course to emphasize, based on the time available for the presentation.2. Presentation Details:*** All team members are required to present in the video. Voice-over only is not permitted.- Student teams can determine the best format for their pre-recorded video presentations (e.g., PowerPoint slides, live demonstration, animated video).- The presentation should be entirely focused on a real-life example or case study. It should not be designed on a fictional account of an organization or a completely fictional/made-up performance management system.-Teams must seek permission from the instructor for their choice of organization to evaluate in this assessment.3. Group Collaboration:- The peer evaluation process will be established by students during the course using course concepts.- Expectations for the \"meaningful contribution\" of each team member will be determined by students during the semester using course concepts.4. Evaluation Criteria:- A separate grading rubric will be used to assess the quality of the presentation. Students should refer to this rubric when producing their presentation.- Video presentations should be submitted via Blackboard.Read full task descriptionHide full task description",
            "submission_guidelines": "The project must be submitted electronically via a Turn-It-In link in the Assessment section of BlackBoard.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Seminar",
            "topic": "Introduction & Overview: Welcome to the role!Learning outcomes:L02, L04",
            "topic_title": "Introduction & Overview: Welcome to the role!",
            "topic_description": "",
            "learning_outcomes": [
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Seminar",
            "topic": "Performance Management in ContextLearning outcomes:L01, L02, L04",
            "topic_title": "Performance Management in Context",
            "topic_description": "",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Seminar",
            "topic": "Performance Management ProcessLearning outcomes:L01, L02, L03, L04",
            "topic_title": "Performance Management Process",
            "topic_description": "",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Seminar",
            "topic": "Performance Management and Strategic PlanningRoyal Queensland Show Public Holiday - Wednesday 14 Aug 2024 - Check Blackboard for announcements about affected classes.Learning outcomes:L02",
            "topic_title": "Performance Management and Strategic Planning",
            "topic_description": "Royal Queensland Show Public Holiday - Wednesday 14 Aug 2024 - Check Blackboard for announcements about affected classes.",
            "learning_outcomes": [
                "L02"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Seminar",
            "topic": "Defining Performance and Choosing a Measurement ApproachLearning outcomes:L01, L03",
            "topic_title": "Defining Performance and Choosing a Measurement Approach",
            "topic_description": "",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Seminar",
            "topic": "Measuring Results and BehaviorsLearning outcomes:L02, L03",
            "topic_title": "Measuring Results and Behaviors",
            "topic_description": "",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Seminar",
            "topic": "Performance AnalyticsLearning outcomes:L02, L03",
            "topic_title": "Performance Analytics",
            "topic_description": "",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Seminar",
            "topic": "Rolling Out the Performance Management SystemLearning outcomes:L02, L03",
            "topic_title": "Rolling Out the Performance Management System",
            "topic_description": "",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Seminar",
            "topic": "Performance Management and Employee DevelopmentLearning outcomes:L02",
            "topic_title": "Performance Management and Employee Development",
            "topic_description": "",
            "learning_outcomes": [
                "L02"
            ]
        },
        {
            "learning_period": "Mid Sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "In-Semester Break",
            "topic_title": "In-Semester Break",
            "topic_description": "",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Seminar",
            "topic": "Performance Management LeadershipAttendance MandatoryLearning outcomes:L01, L02, L03",
            "topic_title": "Performance Management Leadership",
            "topic_description": "Attendance Mandatory",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Seminar",
            "topic": "Performance Management, Rewards, and the LawLearning outcomes:L02, L03",
            "topic_title": "Performance Management, Rewards, and the Law",
            "topic_description": "",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Seminar",
            "topic": "Team Performance ManagementLearning outcomes:L02, L03",
            "topic_title": "Team Performance Management",
            "topic_description": "",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Seminar",
            "topic": "Implementing a Performance Management SystemLearning outcomes:L02, L03",
            "topic_title": "Implementing a Performance Management System",
            "topic_description": "",
            "learning_outcomes": [
                "L02",
                "L03"
            ]
        }
    ]
}