{
    "url": "https://course-profiles.uq.edu.au/course-profiles/MGTS7621-60285-7460",
    "full_course_code": "MGTS7621-60285-7460",
    "course_code": "MGTS7621",
    "class_code": "60285",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Apply career and career transition theory to your own employability strategies and related activities;"
        },
        {
            "number": "LO2.",
            "description": "Identify your personal Career Vision, articulating the gap between your current situation and your desired future, and present your plan for future action;"
        },
        {
            "number": "LO3.",
            "description": "Maintain emotional resilience during your career search activities, reflect on your personal successes, and develop options to navigate changing job and global market conditions;"
        },
        {
            "number": "LO4.",
            "description": "Develop your own Personal Brand based on your career image, identity and adaptability;"
        },
        {
            "number": "LO5.",
            "description": "Build your Career ePortfolio to showcase your skills and experience to prospective employers under scenario conditions."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Professional Development Reflective Journal",
            "special_indicators": [],
            "weighting": "50%",
            "due_date": "9/09/2024 2:00 pm",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Activity/ Performance, Written",
            "category": "Reflection",
            "task_description": "Professional Development Reflective JournalTask Description:Assessment Task Description Summary(Please see the full Task Guide)There are three important outcomes of yourProfessional Development Reflective Journal (PDRJ):To generate self-awareness of your strengths, attributes, and abilities.To identify your career preferences and choices, leading ultimately to career decisions and identity.To prepare you for reflective writing in your profession in performance appraisals, promotion, and career changes.This assessment contains two parts:The detailed requirements for this assessment task will be discussed in the seminars and will be outlined in theProfessional Development Reflective Journal Task Guideprovided.PART 1 – SummaryYou are required to complete a self-evaluation questionnaire/activity before or during the seminar weeks 2-6.Using the self-evaluation questionnaire/activity you are required to reflect on your results. Then you will complete your Professional Development Reflective Journals on the template provided week by week. They are to be around 600 words.It is important that you do this every week as you will have the time, support, and guidance in the seminar workshops.PART 2 - SummaryAfter writing your weekly Professional Development Reflective Journals you are required toassemble, compile, and integrate the small stories in your 5 weekly PDRJs into one coherent 2000-word reflective journal.You are required to review all your Professional Development Reflective Journals and the feedback you received.You will submit a 2,000-word overall Professional Development Reflective Journal. You will use and combine all of the small stories from your weekly PDRJs. You will make one story of your career progress to date.Each of the 5 weekly reflections must be REVIEWED, SUMMARISED AND DISCUSSED within the 2,000 words.You will be expected to draw upon the underpinning theories and concepts for each of the career self-assessments to support your reflections, using at least five relevant readings from the course reading list.Suggested headings and format for the report will be provided.Task Description:Your overall task is to write a 2,000-word final Professional Development Reflective Journal (PDRJ) drawing on what you have learned about yourself, through writing weekly Professional Development Reflective Journals are based on self-evaluation questionnaires and activities in seminars 1, 2, 3, 4, 5 and 6 combined with the ongoing feedback provided in discussion.Each week from 1-6 you will write your Professional Development Reflective Journal (PDRJ) of around 500 words. The first PDRJ will be a practice one. You will use a Professional Development Reflective Journal Template which will be provided. You will improve on your PDRJs using the developmental advice and feedback given in the workshop discussions.This assessment will assist you to develop the professional skill of reflection, self-profiling and career planning and management. These evaluations and journals are essential for completing Assessment Task Two, your Career ePortfolio or website. Also, professional reflections and evaluations are used in employment, for example, in recruitment, in performance reviews, promotion applications and may be useful as you make your many career transitions.Submission requirements.The Final Professional Development Reflective Journal is worth 50%It is your responsibility to ensure that you have submitted your work correctly.This assessment task evaluates students' abilities, skills, and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "Submission in two separate parts via TURNITIN on Blackboard",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Career ePortfolio",
            "special_indicators": [],
            "weighting": "50%",
            "due_date": "4/11/2024 2:00 pm",
            "learning_objectives": "L01, L02, L04, L05",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Portfolio",
            "task_description": "Assessment 2 SummaryA. Please see the Career ePortfolio Task Guide Semester 1 2021 for more detailed guidanceThis assessment task requires you to develop your personal Career ePortfolio based on what you learned about yourself through Assessment Task 1 Professional Development Reflective Journal, your ongoing career planning and management and what you have learned in the Course.Otherwise known as aProfessional Portfolio(Harrington & Hall 2007), an ePortfolio is used to capture and organise information to showcase your skills, accomplishments, and samples of your professional work to prospective employers and potential clients. It is a way of documenting or recording who you are, what you have to offer and what you are seeking, or “marketing yourself” (Harrington & Hall 2007 p 74).The process of planning and creating your e-Portfolio, will assist you to prepare for transitioning to the next stage of your career and help you to articulate your knowledge more effectively, skills, other qualities (KSOQ’s) to employers and clients. This task will also provide you with the experience of preparing a competitive job application for your chosen career field.For this task, based on information in your Career Plan, you are required to create an ePortfolio, which includes the following items, which you will have worked on during class:Job advertisement or position description – to assess how well your resume and cover letter match the selection criteria (non-assessable).An original job ad in English.Resume (2-3 pages)Cover letter (1 page)Elevator pitch (30 seconds presented in a Word document).Personal video (no more than 2 minutes)B. Source materialGuidelines for developing your ePortfolio are discussed in the seminars, shown on Blackboard, and outlined in the following sections. Please see the reading list and associated videos.C. How to submit your Career ePortfolioStep One - SIMILARITY Check - VIA TURNITIN:This step is compulsory. For this Step One, please compile your Resume, Cover Letter and Elevator Pitch into one, single Word document. Then, click on the link shown to submit your Word document to Turnitin.Step Two - Submit the 5 elements, which comprise your Career ePortfolio VIA BLACKBOARD:Please name each of your 5 files withyour student nameand the element name (e.g. Keanu Reeves_Resume.doc).Then, you are required to upload your 5 individual files:Submit theoriginal(unchanged and unedited)job advertisement with all job detailsas a ‘screen shot’ or printed to a .pdf file.Resume (as a single Word Document)Cover letter (as a single Word Document)Elevator pitch (as a single Word Document)Personal video (Submit via Kaltura - see video instructions provided)It is your responsibility to ensure your work is submitted correctly.Note that a late penalty of 10% per day will apply if you do not submit an assessment item on time, or you do not have an approved extension or valid reason for an extension with supporting evidence. See 5.3 for more details.Take a copy of the submission receipts and keep them.Refer to the ECP for the late penalty policy.This assessment task evaluates students' abilities, skills, and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "Submission via Turnitin and the Blackboard  platform.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Seminar",
            "topic": "Introducing career managementIntroductions and course overviewWhat is a career?Definitions of career successIntroduction to (Professional Development Reflective Journal) PDRJ writingPDRJ WORKSHOP (PRACTICE)1. What does a career mean to me?2. Your personal evaluation of the applicability of two items of literature on careers and career successLearning outcomes:L01, L02, L03, L05",
            "topic_title": "Introducing career management",
            "topic_description": "Introductions and course overview\nWhat is a career?\nDefinitions of career success\nIntroduction to (Professional Development Reflective Journal) PDRJ writing\n\nPDRJ WORKSHOP (PRACTICE)\n1. What does a career mean to me?\n2. Your personal evaluation of the applicability of two items of literature on careers and career success",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Seminar",
            "topic": "Understanding how careers developKnowledge, skills and other qualitiesTraditional and contemporary conceptualisations of career.PDRJ 1 WORKSHOPCareer Adapt-Abilities Scale (CAAS)Learning outcomes:L01, L03",
            "topic_title": "Understanding how careers develop",
            "topic_description": "Knowledge, skills and other qualities\nTraditional and contemporary conceptualisations of career.\nPDRJ 1 WORKSHOP\nCareer Adapt-Abilities Scale (CAAS)",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Seminar",
            "topic": "Enhancing your employabilityMaximising your skills and other qualitiesReview of UQ Student Employability ServicesPersonal adaptabilityDeveloping your social and human capitalPDRJ 2 WORKSHOPCareer AnchorsLearning outcomes:L01, L02, L03, L04",
            "topic_title": "Enhancing your employability",
            "topic_description": "Maximising your skills and other qualities\nReview of UQ Student Employability Services\nPersonal adaptability\nDeveloping your social and human capital\nPDRJ 2 WORKSHOP\nCareer Anchors",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Seminar",
            "topic": "Preparing for the future of workWorkplaces of the future and employment The Future of Work The importance of Networks and networkingPDRJ 3 WORKSHOP Attributes and SkillsRoyal Queensland Show Public Holiday - Wednesday 14 Aug 2024 - Check Blackboard for announcements about affected classes.Learning outcomes:L02, L03, L04",
            "topic_title": "Preparing for the future of work",
            "topic_description": "Workplaces of the future and employment The Future of Work The importance of Networks and networking\nPDRJ 3 WORKSHOP Attributes and Skills\nRoyal Queensland Show Public Holiday - Wednesday 14 Aug 2024 - Check Blackboard for announcements about affected classes.",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Seminar",
            "topic": "Designing career goals and career strategiesCareer goals, career strategies, job search, career decisionsCareer case studyPDRJ 4 WORKSHOPWork ValuesLearning outcomes:L02, L03, L04, L05",
            "topic_title": "Designing career goals and career strategies",
            "topic_description": "Career goals, career strategies, job search, career decisions\nCareer case study\nPDRJ 4 WORKSHOP\nWork Values",
            "learning_outcomes": [
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Seminar",
            "topic": "Building your personal brandCareer image and identityBuilding your personal brandYour elevator pitchPDRJ 5 WORKSHOPCareer Vision BoardLearning outcomes:L01, L02, L03, L04",
            "topic_title": "Building your personal brand",
            "topic_description": "Career image and identity\nBuilding your personal brand\nYour elevator pitch\nPDRJ 5 WORKSHOP\nCareer Vision Board",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Seminar",
            "topic": "Developing a sustainable careerManaging your own career Sustainable careers E-PORTFOLIO WORKSHOP 2 Career plan and organisational explorationLearning outcomes:L01, L02, L03",
            "topic_title": "Developing a sustainable career",
            "topic_description": "Managing your own career Sustainable careers E-PORTFOLIO WORKSHOP 2 Career plan and organisational exploration",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Seminar",
            "topic": "Working in a global environmentDiverse workplaces Building cultural competence and cultural intelligence Seeking employment overseas E-PORTFOLIO WORKSHOP 1 Your SMART career goalsLearning outcomes:L01, L02, L03",
            "topic_title": "Working in a global environment",
            "topic_description": "Diverse workplaces Building cultural competence and cultural intelligence Seeking employment overseas E-PORTFOLIO WORKSHOP 1 Your SMART career goals",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Seminar",
            "topic": "Navigating recruitment and selectionRecruitment and selection practices in Australia and other countriesCareer communitiesMobilizing support for your career goalsE-PORTFOLIO WORKSHOP 3Looking for employment in your chosen careerJob applicationsInterview practiceDeveloping your networkLearning outcomes:L03, L04, L05",
            "topic_title": "Navigating recruitment and selection",
            "topic_description": "Recruitment and selection practices in Australia and other countries\nCareer communities\nMobilizing support for your career goals\nE-PORTFOLIO WORKSHOP 3\nLooking for employment in your chosen career\nJob applications\nInterview practice\nDeveloping your network",
            "learning_outcomes": [
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Mid Sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "In-Semester Break",
            "topic_title": "In-Semester Break",
            "topic_description": "",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Seminar",
            "topic": "Planning for career transitionStrategies for managing career transitions Career transitions The phases of career transition Personal development planning E-PORTFOLIO WORKSHOP 5 Elevator pitch Video Academic referencesLearning outcomes:L03, L04, L05",
            "topic_title": "Planning for career transition",
            "topic_description": "Strategies for managing career transitions Career transitions The phases of career transition Personal development planning E-PORTFOLIO WORKSHOP 5 Elevator pitch Video Academic references",
            "learning_outcomes": [
                "L03",
                "L04",
                "L05"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Seminar",
            "topic": "Onboarding and socialisationOnboarding - what to expect Proactive socialisation in your new role Case study Liminality E-PORTFOLIO WORKSHOP 4 Preparing for transition Designing your identit.King's Birthday Public Holiday - Monday 7 Oct 2024 - Check Blackboard for announcements about affected classes.Learning outcomes:L01, L03, L05",
            "topic_title": "Onboarding and socialisation",
            "topic_description": "Onboarding - what to expect Proactive socialisation in your new role Case study Liminality E-PORTFOLIO WORKSHOP 4 Preparing for transition Designing your identit.\nKing's Birthday Public Holiday - Monday 7 Oct 2024 - Check Blackboard for announcements about affected classes.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Seminar",
            "topic": "Networking into career communitiesFrom graduate to professionalCareer communitiesYour portfolio developmentE-PORTFOLIO WORKSHOP 6Preparing your portfolio for successYour completed portfolioAcademic referencesLearning outcomes:L01, L03, L05",
            "topic_title": "Networking into career communities",
            "topic_description": "From graduate to professional\nCareer communities\nYour portfolio development\nE-PORTFOLIO WORKSHOP 6\nPreparing your portfolio for success\nYour completed portfolio\nAcademic references",
            "learning_outcomes": [
                "L01",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Workshop",
            "topic": "Personalised career coachingPersonalised discussion and advice about specific career choices and strategies. EPORTFOLIO assessment Q&A Final farewellsLearning outcomes:L01, L02, L03, L04, L05",
            "topic_title": "Personalised career coaching",
            "topic_description": "Personalised discussion and advice about specific career choices and strategies. EPORTFOLIO assessment Q&A Final farewells",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05"
            ]
        }
    ]
}