{
    "url": "https://course-profiles.uq.edu.au/course-profiles/MKTG7513-60304-7460",
    "full_course_code": "MKTG7513-60304-7460",
    "course_code": "MKTG7513",
    "class_code": "60304",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Interpret and apply social marketing principles and techniques to influence positive behaviour change."
        },
        {
            "number": "LO2.",
            "description": "Describe and distinguish the commonly used behavioural change theories in social marketing."
        },
        {
            "number": "LO3.",
            "description": "Analyse societal problems for relevant ethical and socially responsible marketing solutions."
        },
        {
            "number": "LO4.",
            "description": "Plan, conduct and present secondary and primary research appropriate for a specific social behaviour change enquiry."
        },
        {
            "number": "LO5.",
            "description": "Demonstrate effective communication and collaboration abilities in making social innovation decisions as a group."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Social Change Project",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "40%",
            "due_date": "6/09/2024 - 21/10/2024",
            "learning_objectives": "L01, L02, L03, L04, L05",
            "mode": "Oral, Written",
            "category": "Presentation, Project",
            "task_description": "Students will complete a creative, social marketing project that requires each student to engage in designing a social change solution using marketing tools and techniques. This is a team project with 4-5 students per team, from their tutorial group. Detailed project guidelines will be available on Blackboard, including the approved list of topics. Teams are to select ONE problem and design a social marketing solution.The project has 2 assessment components:Part A: Scoping Report (15%)In preparing for the research project, students are required to complete independent background research on their selected topic and submit this as a scoping report. The scoping report will include:Background research about the social problem and issues/challengesBackground campaign research (identification and evaluation of 5 past campaigns that have been successful and/or unsuccessful in effecting behaviour change)Problem statement (that demonstrates an understanding and analysis of the issue based on relevant and up to date information)Background research about major target markets impacted by the problem/issuesValue proposition statement that demonstrates how the social marketing approach will make behaviour change attractive and relevant to the target market profiled.The scoping phase in designing a social change intervention is critical to avoid generating and crafting solutions before a deep understanding of the customer is achieved and ensures that the intervention design has a clear behaviour change focus (and not just an awareness raising campaign).Report requirements: The scoping report will be written in report style, and not exceed the word limit of 1500 words [plus summary tables, references and appendices of information, not included in the word count].The report should include important section: Background research: Social problem/issue; Campaign Audit (identify and evaluate relevant past social change campaigns); Problem Definition; Target Marketing Segmentation (based on background research); Value proposition for each market.This task has been designed to be challenging, authentic and complex. Whilst students may use AI technologies, successful completion of this assessment will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.Report formatting: Use: 11 point font, 1.5 line spacing, Margins 2cmThe scoping report will be submitted online via the Blackboard course links following a two-step process (1) Blackboard Group submission;(2) ONE Turnitin submission; (3) byFriday 6 September @ 12pm.Part B: Presentation (25%)The team will be guided by a design thinking process to present a social change strategy that explains and justifies (1) a selected target market for change – demonstrating a detailed understanding of the target market and presentation of a persona design, which is informed by TWO consumer interviews, empathy mapping and creative design elements; (2) behaviour change goals and objectives; (3) detailed explanation of the social marketing interventions, (4) behaviour change journey mapping: informed by marketing inventions that influence the consumer journey towards positive social change and linked to the social change champion (Target Market Selected).AI StatementThis task has been designed to be challenging, authentic and complex. Whilst students may use AI technologies, successful completion of this assessment will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.Students should plan for theirteam presentation pitch to be 20 minutes in lengthand be marked on each team members’ presentation technique and ability to apply and discuss social marketing concepts and issues relevant to the designed social change solution. All team members are required to present during a live oral presentation to their tutorial peers and tutor in weeks 11 and 12 during scheduled tutorial sessions.Peer Assessment. It is important that groups work well together and that everyone does their fair share of the work. This course uses the UQ Group Peer Assessment tool. All students must complete the peer assessment form on Blackboard for this course following completion of the team presentation. If the peer assessment result indicates that a team member has not been doing their fair share of the work, theirmarks may be adjusted downwardbased on peer assessment results. Peer assessment forms are due by the end of the day after your project presentation. To facilitate a shared understanding about how the team will function, team members should agree on a team contract for how the team will operate (a model team contract will be provided as a starter for your team). If your group is having problems, see your tutor as early as possible. If you fear that your team may assess you unfairly, it is important to discuss this with your tutor well before the project is finished.For help with how to effectively function in teams by building teams and managing team conflict see the online edX course “Working in Teams: A Practical Guide”www.edx.org/course/working-in-teams-a-practical-guide(link on the Blackboard website).Criteria & Marking:UQ Students: Please access the profile fromLearn.UQormySI-netto access marking criteria held in this profile.Read full task descriptionHide full task description",
            "submission_guidelines": "You may be able toapply for an extension.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "In-Semester Examination",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "30%",
            "due_date": "18/09/2024 5:00 pm",
            "learning_objectives": "L01, L02, L03, L05",
            "mode": "Written",
            "category": "Examination",
            "task_description": "The In-Semester exam in this course will cover content presented in lectures, tutorials and required readings up to and including content covered in Week 8. The online exam will feature mixed-questioning styles (e.g., MCQs, short answer and a short essay) to test students understanding of social marketing principles and theoretical concepts. The exam is theory based, requiring application of knowledge to real world behaviour change examples or problems, using the theory and concepts from the MKTG7513 course learning materials.Preparation for the online exam will be discussed in lectures and during applied activities in tutorials.This assessment task evaluates student’s abilities, skills and knowledge without the aid of Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "You may be able todefer this exam.",
            "deferral_or_extension": "You may be able todefer this exam.",
            "late_submission": "Exams submitted after the end of the submission time will incur alate penalty.",
            "additional_info": "You may be able to\ndefer this exam\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Managerial Evaluation Report",
            "special_indicators": [],
            "weighting": "30%",
            "due_date": "25/10/2024 12:00 pm",
            "learning_objectives": "L01, L02, L03",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "The final managerial report will explain how the social change strategy designed by the project team will be evaluated to understand how the planned marketing approach and behaviour change touchpoints will achieve behaviour change goals. Also important to social marketing is an ethical evaluation of a behaviour change strategy. Whenever a social marketer strives to change people’s behaviour, they must do so responsibly and be accountable to the target market members. While the end the results of the strategy are the identified measures of success, the means to that end are just as important. Ethical issues should be considered at each stage of the strategy development to ensure the integrity of target market research and that the program itself does not encourage behaviour change in an unethical way.Report requirements: The 1500 words (+/- 10%) report will be written in report style, including an Executive Summary, appendices of information and tables (not included in the word count). Report formatting: 11 point font, 1.5 spacing, Margins 2cmsAI StatementThis task has been designed to be challenging, authentic and complex. Whilst students may use AI technologies, successful completion of this assessment will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.Read full task descriptionHide full task description",
            "submission_guidelines": "To be submitted via Blackboard",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Lecture",
            "topic": "Defining and Distinguishing Social MarketingCourse overview to Marketing for Social ChangeLearning outcomes:L01",
            "topic_title": "Defining and Distinguishing Social Marketing",
            "topic_description": "Course overview to Marketing for Social Change",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Lecture",
            "topic": "Developing a social marketing mindsetMarketing applications to behaviour changeLearning outcomes:L01, L02, L03",
            "topic_title": "Developing a social marketing mindset",
            "topic_description": "Marketing applications to behaviour change",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Lecture",
            "topic": "Determining problems and findings solutionsHow to research social problemLearning outcomes:L01, L02, L03",
            "topic_title": "Determining problems and findings solutions",
            "topic_description": "How to research social problem",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Lecture",
            "topic": "Behaviour change theories, models & frameworks :Theories to guide planning behaviour changeLearning outcomes:L01, L02, L03",
            "topic_title": "Behaviour change theories, models & frameworks :",
            "topic_description": "Theories to guide planning behaviour change",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Lecture",
            "topic": "Customer orientation perspectivesCustomer/client centered marketing; micro-level approaches to social change and designing a product platformLearning outcomes:L01, L02, L03, L05",
            "topic_title": "Customer orientation perspectives",
            "topic_description": "Customer/client centered marketing; micro-level approaches to social change and designing a product platform",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Lecture",
            "topic": "Strategy: Creating value, products & brandsValue creation, exchange, co-creation theory and designing the product platformLearning outcomes:L01, L02, L03",
            "topic_title": "Strategy: Creating value, products & brands",
            "topic_description": "Value creation, exchange, co-creation theory and designing the product platform",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Lecture",
            "topic": "Strategy: Influencing behaviour by designIncentivising and making access convenient and pleasantLearning outcomes:L01, L03, L04",
            "topic_title": "Strategy: Influencing behaviour by design",
            "topic_description": "Incentivising and making access convenient and pleasant",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Lecture",
            "topic": "Social Change CommunicationCommunication strategy: Messaging and creative strategiesLearning outcomes:L01, L02, L03, L05",
            "topic_title": "Social Change Communication",
            "topic_description": "Communication strategy: Messaging and creative strategies",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Lecture",
            "topic": "NO LECTURE THIS WEEKSchool-based In-Semester (Examination) held this weekLearning outcomes:L01, L02, L03, L05",
            "topic_title": "NO LECTURE THIS WEEK",
            "topic_description": "School-based In-Semester (Examination) held this week",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L05"
            ]
        },
        {
            "learning_period": "Mid Sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "IN-SEMESTER BREAK",
            "topic_title": "IN-SEMESTER BREAK",
            "topic_description": "",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Lecture",
            "topic": "Ethical considerations in social marketingLearning outcomes:L01, L02, L03",
            "topic_title": "Ethical considerations in social marketing",
            "topic_description": "",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Lecture",
            "topic": "Planning for successMonitoring & Evaluating & Sustaining Behaviour Change interventionsTeam Presentations(Presentation) :Scheduled with tutorial groupLearning outcomes:L01, L02, L03",
            "topic_title": "Planning for success",
            "topic_description": "Monitoring & Evaluating & Sustaining Behaviour Change interventions\nTeam Presentations (Presentation) :\nScheduled with tutorial group",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Lecture",
            "topic": "Strategy Challenges & FailuresEthical debates and implications when social marketing is ineffectiveLearning outcomes:L01, L02, L03",
            "topic_title": "Strategy Challenges & Failures",
            "topic_description": "Ethical debates and implications when social marketing is ineffective",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Lecture",
            "topic": "Social marketing futuresFinal lectureLearning outcomes:L01, L02, L03",
            "topic_title": "Social marketing futures",
            "topic_description": "Final lecture",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03"
            ]
        }
    ]
}