{
    "url": "https://course-profiles.uq.edu.au/course-profiles/RBUS7996-64895-7460",
    "full_course_code": "RBUS7996-64895-7460",
    "course_code": "RBUS7996",
    "class_code": "64895",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 21/06/2025)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Identify and articulate appropriate theroetical frameworks."
        },
        {
            "number": "LO2.",
            "description": "Carry out a literature review."
        },
        {
            "number": "LO3.",
            "description": "Develop testable hypotheses."
        },
        {
            "number": "LO4.",
            "description": "Justify methodology."
        },
        {
            "number": "LO5.",
            "description": "Execute and explain the project."
        },
        {
            "number": "LO6.",
            "description": "Analyse and interpret results."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Research Thesis",
            "special_indicators": [],
            "weighting": "100%",
            "due_date": "30/05/2025 1:00 pm",
            "learning_objectives": "L01, L02, L03, L04, L05, L06",
            "mode": "Written",
            "category": "Thesis",
            "task_description": "The empirical Master’s thesis follows the same basic format as an Honours thesis or PhD thesis. To that end, unless otherwise instructed by the supervisor, the thesis will have a minimum chapter content likely to include:IntroductionLiterature reviewModel and hypothesesMethodology of data collectionAnalysis, results and discussionConclusion.The above structure is an example for an empirical thesis. In cases where a theoretical thesis is undertaken, a different structure would be required. Students are advised to seek direction of their supervisor on the appropriate structure in such cases.Ethical ResearchIt is the responsibility of all research students to ensure research undertaken is ethically sound. Ethics approval must be sought prior to any form of primary data collection. For more information on research ethics process, please see below links:All research involving humans that is not greater thanlow or negligible riskcan be reviewed by one our Faculty-based ethics sub-committees. Please direct all questions regarding low or negligible risk process tobellnr@uq.edu.au.Research involving humans that is greater than low or negligible risk will be reviewed by one of UQ’sHuman Research Ethics Committeein a full committee meeting.Please liaise with your UQ Business School academic supervisor for assistance with ethics application process.The ethics committee meet fortnightly to assess ethics applications. The cut-off date for submissions is one week prior to each scheduled meeting.Thesis Format and Word CountThe thesis must be the lesser of 20,000 words in length or 100 pages of double spaced printing in 12-point Times New Roman font on A4 paper.Note:marking will cease should the research thesis exceed 20,000 words (not including cover page, acknowledgements, disclaimer, and appendices)The fly page must show:The University of QueenslandFaculty of Business, Economics & LawUQ Business School(the title)A thesis submitted to the UQ Business School, The University of Queensland, in partial fulfilment of the requirements for the degree of (program title) [e.g. Master of Business].by (student's name)the dateSupervisor: (name)On a separate page, show ‘Acknowledgements’ which must include a signed disclaimer statement which says:''The work presented in this thesis is, to the best of my knowledge and belief, original, except as acknowledged in the text. The material has not been submitted, either in whole or in part, for a degree at this or any other university.\"The marking guide for your thesis provided by course coordinator. This is also available via Blackboard course site.Research Data and Thesis Submission.The research thesis is to be submitted electronically to Turnitin located in the Blackboard Assessment link. The report will be subject to plagiarism checks through Turnitin.If your research project required ethics approval, you will also be required to upload evidence of this when submitting your thesis electronically. Please refer to the 'Assessment' folder for your research thesis for more information.Business School research students are obligated to submit all research data through theUQ Research Data Manager(UQRDM). Instructions on how to set up your research project are available viaUQ Library. For assistance with this process, please contactBusiness School Librarianat UQ Library.Students whom submit a research thesis are required to submit their final thesis for upload toUQ eSpace.This repository aims to create global visibility and accessibility of UQ's scholarly research. You will have the opportunity to revise your thesis after submission for upload toUQ eSpace.Your Postgraduate Student Liaison Officer will be in contact with you after release of final grades to provide an opportunity to revise your thesis. For any student that does not submit a revised thesis, the School will revert to your original thesis on file (unless an alternative arrangement has been approved by the School).This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI) or Machine Translation (MT). Students are advised that the use of AI or MT technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "The research thesis is to be submitted electronically to Turnitin via Blackboard. The thesis will be subject to plagiarism checks through Turnitin.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Multiple weeksFrom Week 1 To Week 26(22 Jul - 01 Jun)",
            "activity_type": "Not Timetabled",
            "topic": "Independent Research ActivityLearning outcomes:L01, L02, L03, L04, L05, L06",
            "topic_title": "Independent Research Activity",
            "topic_description": "",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04",
                "L05",
                "L06"
            ]
        }
    ]
}