{
    "url": "https://course-profiles.uq.edu.au/course-profiles/TOUR7023-60334-7460",
    "full_course_code": "TOUR7023-60334-7460",
    "course_code": "TOUR7023",
    "class_code": "60334",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "critically evaluate various types of resources in tourism, hospitality and event operations"
        },
        {
            "number": "LO2.",
            "description": "identify and reflect on theoretical and practical considerations associated with managing resources in tourism, hospitality and event operations"
        },
        {
            "number": "LO3.",
            "description": "explain the management process and associated core business concepts related to resource management in the tourism, hospitality and event context"
        },
        {
            "number": "LO4.",
            "description": "critically analyse a complex tourism, hospitality or event business problem or situation relating to resource management practices"
        },
        {
            "number": "LO5.",
            "description": "formulate recommendations for strategic and ethical resource management in tourism, hospitality and event operations"
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Infographic - External Resource Audit: Destination",
            "special_indicators": [],
            "weighting": "45% Individual",
            "due_date": "30/08/2024 2:00 pm",
            "learning_objectives": null,
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Poster",
            "task_description": "Working INDIVIDUALLY, students independently critically evaluate TH&E natural, cultural and support resources of a chosen destination, identify its main management challenges, and provide management strategies for solving (preventing, mitigating, or managing) the issues.The assessment has two parts:Part A (Spreadsheet Audit): You are to conduct anexternal resource audit ofa chosen regional destination(in Australia or overseas - see a list of regional destinations on Blackboard) and critically evaluate the natural, cultural, and support resources for the chosen destination. A spreadsheet template is available on Blackboard to guide the audit process. You are to evaluate each resource's appeal, quality and uniqueness critically. You then identify and reflect on the main management challenges and possible strategies to overcome those. Your completed spreadsheet must be submitted as part of this assessment, and completion provides the foundation for you to complete Part B.Part B (Infographic Poster):Based on your research and resource audit spreadsheet, you will prepare an infographic (usingCanva’sorPiktochart's Infographic function, or similar) that addresses several information aspects as listed below. An infographic is a visual representation and should be succinct, entertaining, and eye-catching. Avoid a text-heavy infographic. It should cite the relevant literature and incorporate informative text and engaging images or graphics to explain your findings to your audiences.Your infographic should address the following aspects:Anoverview of the destination(geographical location, types of attractions, visitor segment and statistics etc);A detailed audit highlightingtwo (2) examples of natural, two (2) examples of cultural, and two (2) examples of support resourcesavailable at this destination. This will require you to inform on the i) resource appeal, ii) uniqueness and iii) quality for 2 x natural resources, 2 x cultural resources, and 2 x social resources;Explain themost relevanttwo (2) resource management challengesfor your destination. Evidence-based justification of the identified challenges is necessary.Addresseach challenge strategically with one (1) possible management strategythat will overcome the challenge.Your research should be based onrecent academic sources(published within the past 10 years). Your reference list can be attached to the spreadsheet tap calledReference list APA, following the APA reference guide.Complex / authentic assessment using AI to support learningArtificial Intelligence (AI) provides emerging tools that may support students in completing this assessment task. Students may appropriately use AI in completing this assessment task. Students must clearly reference any use of AI in each instance. A failure to reference generative AI use may constitute student misconduct under the Student Code of Conduct.Criteria & Marking:Further details will be provided on the course Blackboard Site.Read full task descriptionHide full task description",
            "submission_guidelines": "Your assessment (Part A and B) must be submitted to Turnitin, which is accessed from the Blackboard Assessments link.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Case Study Report",
            "special_indicators": [],
            "weighting": "55% Individual; 2,500 words",
            "due_date": "25/10/2024 2:00 pm",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Essay/ Critique",
            "task_description": "Working INDIVIDUALLY, you are requiredto assess ONE of the two provided scenarios critically, identify TH&E resource management issues/problems, and provide informed consideration of the ethical implications. This assessment requires students to independently and critically evaluate a complex issue in managing THEs resources and, through problem-solving and research skills, provide a researched-informed understanding of the issues and strategic, evidenced, and actionable recommendations for meaningful resolutions to the case. Through the assignment, you will need to demonstrate ethical awareness in evaluating and responding to the identified issues.Prepare a clear and concise2,500-word case study report. The word limit applies to the content and detail of your report. It EXCLUDES title page, appendices, and reference list.Choose ONE scenario(selected from the two that will be made available on Blackboard)Identify thekey ethical resource management issuesDiscuss the ethical issues, drawing on relevant and current literature to inform the analysisCritically analyse the underlying causes and implicationsof the identified issues (provide evidence-based justification of your reasoning)Criticallyassess the consequences from diverse stakeholder perspectives(MORE THAN TWO stakeholders)Formulate TWO strategic, evidenced and actionable recommendations (ONE preventive and ONE reactive)to address key issues raised through problem-solvingProvide a clearconclusionto the report reflecting on sustainable developmentYou are required to include at least10 recent* and relevant academic and non-academic referencesfollowing the APA style to support your analysis and recommendations.* Recent references are those published in the last 10 years.This task has been designed to be challenging, authentic, and complex. Whilst students may use AI technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.A failure to reference AI use may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "It is a course requirement that you submit your case study report via the electronic Turnitin Submission Portal available under the Blackboard Assessment link for this course. Your report should be uploaded in a Word or PDF format and it MUST be successfully submitted prior to the deadline to avoid late submission penalty. Please allow sufficient time to upload your file BEFORE the due hour and date; and ensure you secure a 'receipt' as proof of timely submission.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Seminar",
            "topic": "Introduction to managing THEs resourcesThe tourism destination",
            "topic_title": "Introduction to managing THEs resources",
            "topic_description": "The tourism destination",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Problem-based learning",
            "topic": "Natural Resource AnalysisCritical Evaluation of Tourism Destination Resources",
            "topic_title": "Natural Resource Analysis",
            "topic_description": "Critical Evaluation of Tourism Destination Resources",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Problem-based learning",
            "topic": "Social & Cultural Resource AnalysisCritical Evaluation of Tourism Destination Resources",
            "topic_title": "Social & Cultural Resource Analysis",
            "topic_description": "Critical Evaluation of Tourism Destination Resources",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Fieldwork",
            "topic": "Destination Resource AuditAudit & Marketing Infographic in Practice",
            "topic_title": "Destination Resource Audit",
            "topic_description": "Audit & Marketing Infographic in Practice",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Seminar",
            "topic": "Organisational Resources Analysis in THEsStrategic Critical Evaluation of Organisational Environment",
            "topic_title": "Organisational Resources Analysis in THEs",
            "topic_description": "Strategic Critical Evaluation of Organisational Environment",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Case-based learning",
            "topic": "Dynamic Change in THEsPractice for Complex Problem-Solving",
            "topic_title": "Dynamic Change in THEs",
            "topic_description": "Practice for Complex Problem-Solving",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Seminar",
            "topic": "Managing Human Resources in THEs  - Guest Lecturer TBACulture & Diversity Reflective Practice",
            "topic_title": "Managing Human Resources in THEs  - Guest Lecturer TBA",
            "topic_description": "Culture & Diversity Reflective Practice",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Problem-based learning",
            "topic": "Management, Leadership & Ethics in THEsRole Play & Reflective Practice",
            "topic_title": "Management, Leadership & Ethics in THEs",
            "topic_description": "Role Play & Reflective Practice",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Problem-based learning",
            "topic": "Operations & Performance Management in THEs - Guest Lecturer TBARole Play Critical Incident Analysis",
            "topic_title": "Operations & Performance Management in THEs - Guest Lecturer TBA",
            "topic_description": "Role Play Critical Incident Analysis",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid Sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "In-Semester BreakNo classes during the mid-semester break",
            "topic_title": "In-Semester Break",
            "topic_description": "No classes during the mid-semester break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Case-based learning",
            "topic": "Technology & InnovationPractice for Complex Problem-Solving",
            "topic_title": "Technology & Innovation",
            "topic_description": "Practice for Complex Problem-Solving",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Case-based learning",
            "topic": "Managing Risks & Crisis in THEsPractice for Complex Problem-Solving",
            "topic_title": "Managing Risks & Crisis in THEs",
            "topic_description": "Practice for Complex Problem-Solving",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Seminar",
            "topic": "Climate Change Challenge for THEs ResourcesClimate change mitigation and adaptation in tourism",
            "topic_title": "Climate Change Challenge for THEs Resources",
            "topic_description": "Climate change mitigation and adaptation in tourism",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Seminar",
            "topic": "Bring it all togetherTHE's Resource Management for Sustainable Development & Consultations",
            "topic_title": "Bring it all together",
            "topic_description": "THE's Resource Management for Sustainable Development & Consultations",
            "learning_outcomes": []
        }
    ]
}