{
    "url": "https://course-profiles.uq.edu.au/course-profiles/TOUR1002-60328-7460",
    "full_course_code": "TOUR1002-60328-7460",
    "course_code": "TOUR1002",
    "class_code": "60328",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Have an understanding of the key psychological foundations of visitor experiences."
        },
        {
            "number": "LO2.",
            "description": "Explain how visitor demographics, psychographics and motives influence decision making and behaviour of visitor experiences."
        },
        {
            "number": "LO3.",
            "description": "Develop visitor experience strategies."
        },
        {
            "number": "LO4.",
            "description": "Through the usage of an infographic, redesign an existing visitor experience."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Visitor Experience Appraisal",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "30% 1500 words; Individual",
            "due_date": "23/08/2024 1:00 pm",
            "learning_objectives": "L01, L02",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "Students will select an experience provider and conduct an appraisal of an existing experience which will incorporate demographic, geographics, psychographics and decision making from a visitor perspective to appraise this experience.Visitor Experiences sites can include:·        A theme park, zoo, aquarium, botanic gardens or cultural attraction·        An interpretation centre, museum, art gallery, heritage/historic site·        A winery, brewery, working farm·        A festival or event·        Other (check with Teaching Team).In the experience appraisal, they must identify an experience and explain the reason for the need for its redesign. This could be for reasons such as a changing market; need for refurbishment; change in venue; or growth/decline. It is important to justify why this experience needs to be redesigned, not simply list numerous superficial reasons why it should be redesigned. The redesign does not need to be major or revolutionary. It might be to focus more on a specific market, or the need for a new site management procedure, or an updated promotion.The redesign should be feasible and relevant to both the experience provider and the potential visitors. Using segmentation techniques, students will identify and profile relevant market segments that will be targeted with the redesign. Consideration will also be given as to why these segments would be motivated to experience the redesigned experience. If the segments do not match the redesign, the appraisal is meaningless.Further information will be provided on Blackboard and in Tutorials.Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "This experience appraisal is to be submitted via Turnitin.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Presentation",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "20% 5 mins; Individual",
            "due_date": "9/09/2024 - 13/09/2024In-class presentation",
            "learning_objectives": "L01, L02",
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "This short presentation provides an opportunity for students to present the findings from the Visitor Experience Appraisal and gain some feedback which can be used in the final assignment. It includes a brief overview of the Visitor Experience Appraisal (from Assignment 1) using the Experience Economy Framework to clearly justify why the visitor experience needs to be redesigned.The Presentation should include the following:Part 1: Background·        Describe/introduce the site.·        Where is it?·        What is its purpose?·        Who is the current target market?Part 2: Justification for RedesignRefer to the Experience Economy Framework (Pine & Gilmour, 1999) which includes the ‘experience realms’ of 1) Entertainment; 2) Education; 3) Escape; and 4) Aesthetics to help you explain and justify why you believe this visitor experience needs to be redesigned. You do not need to refer to all four realms, only those that have relevance to your experience redesign justification. Also, briefly note who the target market/s might be for the new redesigned experience.A Photo of the site needs to be submitted and will be displayed during the presentation for the class to view and should enhance the presentation by helping to highlight the site or facility as well as the visitor experience provided.Further information will be provided on Blackboard and in Tutorials.Please Note:The presentation will be recorded for marking purposes.This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "Submit photo via Turnitin",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Visitor Experience Redesign Report",
            "special_indicators": [],
            "weighting": "50% 2000 words; Individual",
            "due_date": "25/10/2024 1:00 pm",
            "learning_objectives": "L03, L04",
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "Assuming the role of a Tourism Consultant, you are now required to redesign the existing experience by providing a structured report to the Manager of the visitor attraction you originally visited. Sections of the report will follow the core concepts covered in the course and should contain the sections outlined below.IntroductionThis section should introduce the existing experience and include an overview of the redesigned concept. Information such as the name, description and location of the experience would be appropriate in this section. You should include a few points justifying why the experience needs to be redesigned. You should briefly summarise your target market segment from your appraisal.Orchestra Model(current) You are to first apply Pearce’s (2011) model to your visitor experience redesign. The orchestra model of tourism experience is very important as it provides the theory that will guide your further changes.Orchestra Model(redesign) Then consider how one or two of these areas of the model can be improved through your experience redesign. Note: You don’t need to change the world, focus on one or two components of the orchestra model that can be considered to redesign your experience. Remember to consider your target market.ExperiencescapeHere you should justify the changing visitor settings and orientation including intangible elements (see Bitner, 1992) servicescape- (ambient conditions, spatial layout).Visitor ManagementYou should consider the management of queues, crowding and capacity issues that may arise. In addition, what steps will you take to ensure that employees are well positioned to provide high quality visitor experiences?InterpretationHow will you design and manage the experiential aspects to ensure that visitors have a memorable time? What orientation aids can be used to assist visitors with navigation and time management?Post-Experience OutcomesYou should also describe how you will monitor and improve experience quality and visitor satisfaction. What will you do to encourage repeat business or to develop an ongoing relationship with visitors? How will you help visitors create, share and recall positive memories of their experiences?Infographicis a visual representation of an idea, and yours should be succinct and eye-catching. These tend to be increasingly used by businesses in tourism, events and hospitality when selling an idea to potential investors. Your infographic needs to be specific and focused and provide a visual summary of your redesign. You should incorporate informative text and engaging images or graphics to appeal and explain your ideas.Further information will be provided on Blackboard and in Tutorials.Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task. Students must clearly reference any use of AI or MT in each instance. A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "This experience design project is to submitted via Turnitin.",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Lecture",
            "topic": "Introduction & OverviewIntroduction to Visitor ExperienceLearning outcomes:L01, L02",
            "topic_title": "Introduction & Overview",
            "topic_description": "Introduction to Visitor Experience",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Lecture",
            "topic": "Understanding the Visitor: DemographicsUnderstanding the key components of demographicsLearning outcomes:L01, L02",
            "topic_title": "Understanding the Visitor: Demographics",
            "topic_description": "Understanding the key components of demographics",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Lecture",
            "topic": "Understanding the visitor: PsychographicsUnderstanding the core constructs of psychographicsLearning outcomes:L01, L02",
            "topic_title": "Understanding the visitor: Psychographics",
            "topic_description": "Understanding the core constructs of psychographics",
            "learning_outcomes": [
                "L01",
                "L02"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Lecture",
            "topic": "Understanding Visitor MotivationsApplying motivation theory to visitor experience designLearning outcomes:L01, L02, L03, L04",
            "topic_title": "Understanding Visitor Motivations",
            "topic_description": "Applying motivation theory to visitor experience design",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Lecture",
            "topic": "Perceptions & Decision MakingHow perceptions influence visitor experience and understanding decision making theoryLearning outcomes:L01, L02, L04",
            "topic_title": "Perceptions & Decision Making",
            "topic_description": "How perceptions influence visitor experience and understanding decision making theory",
            "learning_outcomes": [
                "L01",
                "L02",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Lecture",
            "topic": "Experience Design - Experience EconomyUnderstanding the experience economyLearning outcomes:L01, L03",
            "topic_title": "Experience Design - Experience Economy",
            "topic_description": "Understanding the experience economy",
            "learning_outcomes": [
                "L01",
                "L03"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Lecture",
            "topic": "Experience Design - Orchestra ModelUnderstanding design Models - Orchestra ModelLearning outcomes:L03, L04",
            "topic_title": "Experience Design - Orchestra Model",
            "topic_description": "Understanding design Models - Orchestra Model",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Lecture",
            "topic": "Experience-ScapesApplying Experience-scapes to design and redesigning visitor experiencesLearning outcomes:L03, L04",
            "topic_title": "Experience-Scapes",
            "topic_description": "Applying Experience-scapes to design and redesigning visitor experiences",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Lecture",
            "topic": "Visitor Interpretation & ManagementUnderstanding how visitor interpretation and management improves experiencesLearning outcomes:L03, L04",
            "topic_title": "Visitor Interpretation & Management",
            "topic_description": "Understanding how visitor interpretation and management improves experiences",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Mid Sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "In-Semester BreakBreak",
            "topic_title": "In-Semester Break",
            "topic_description": "Break",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Lecture",
            "topic": "Post-Experience OutcomesUnderstanding post-experience outcomes such as satisfactionLearning outcomes:L03, L04",
            "topic_title": "Post-Experience Outcomes",
            "topic_description": "Understanding post-experience outcomes such as satisfaction",
            "learning_outcomes": [
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "No Lecture - Public HolidayKing's Birthday Public Holiday - Monday 7 Oct 2024 - Check Blackboard for announcements about affected classes.",
            "topic_title": "No Lecture - Public Holiday",
            "topic_description": "King's Birthday Public Holiday - Monday 7 Oct 2024 - Check Blackboard for announcements about affected classes.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Lecture",
            "topic": "Review & ConsolidationCourse ReviewLearning outcomes:L01, L02, L03, L04",
            "topic_title": "Review & Consolidation",
            "topic_description": "Course Review",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "General contact hours",
            "topic": "Consultation - by AppointmentIndividual consultation by appointment.No scheduled lecture/tutorial this week - please see Blackboard for more details.",
            "topic_title": "Consultation - by Appointment",
            "topic_description": "Individual consultation by appointment. \nNo scheduled lecture/tutorial this week - please see Blackboard for more details.",
            "learning_outcomes": []
        }
    ]
}