{
    "course_title": "Industry Research and Consultancy",
    "study_period": "Sem 2 2024",
    "location": "St Lucia",
    "attendance": "In Person",
    "url": "https://course-profiles.uq.edu.au/course-profiles/TOUR7000-60330-7460",
    "full_course_code": "TOUR7000-60330-7460",
    "course_code": "TOUR7000",
    "class_code": "60330",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Develop knowledge of research methodologies commonly used in industry research."
        },
        {
            "number": "LO2.",
            "description": "Design a project to address a research problem in a tourism, hospitality or events context."
        },
        {
            "number": "LO3.",
            "description": "In teams, apply the skills and competencies to successfully develop and manage a client-based project."
        },
        {
            "number": "LO4.",
            "description": "Critically evaluate and reflect on key elements of high-quality research project."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Industry Research Project",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle icon-text--small",
                    "special_indicator_text": "Team or group-based"
                }
            ],
            "weighting": "<dd>60% - Team (40%) Individual (20%) </dd>",
            "due_date": "<dd><p> 20/08/2024</p>\n<p> 15/10/2024</p>\n<p> 22/10/2024</p></dd>",
            "learning_objectives": "L01, L02, L03, L04",
            "mode": "Activity/ Performance, Oral, Written",
            "category": "Participation/ Student contribution, Project, Reflection",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p>Throughout the semester you will be working in teams of 5-6 students to deliver an industry research project. Your team is required to provide high-quality materials, procedures and practices that represent the professional execution of the project. Working collaboratively, your team is responsible for delivering the project according to the specific requirements outlined by the industry client. </p>\n<p>This task is spread across the semester with key milestones and assessment submissions required as detailed below.</p>\n<p><strong>Week 1: </strong>you will receive the project tender brief, which will outline the project’s objectives and expectations </p>\n<p><strong>Week 2 and Week 3: </strong>industry client meetings will be scheduled to discuss and clarify any project-related matters. It is crucial to establish and maintain a professional client relationship throughout the project duration.</p>\n<p><strong>Week 5: Proposal (10%)</strong></p>\n<p><strong>All teams submit a maximum 2-page project proposal </strong>(excluding references). Your team’s proposal must include the following details:</p>\n<p><strong>1. Describing the research problem, and proposing the overall research aim and several objectives </strong></p>\n<p>-         <em>Provide an overview of the research problem discussed by the clients.</em></p>\n<p>-         <em>Propose an overall research aim and several relevant research objectives for your project.</em></p>\n<p><strong>2. A brief literature review on key concepts related to the topic.</strong></p>\n<p><strong>3. A clear research design that could address your research objectives, including a plan for data collection, sampling strategies that are used for data collection, and brief timeline.</strong></p>\n<p><strong>4. Reference list </strong></p>\n<p><em>Note: There is no minimum reference number requirement, but you should have enough references to demonstrate your knowledge of the topic and justify your research design of the report.</em></p>\n<p><strong>Week 12: Report (20%)</strong></p>\n<p><strong>All teams submit a 4000-word written report,</strong> which includes all the details of the project, including project aim and objectives, literature review, methods (data collection and data analysis), results, discussion with the recommendation for clients, limitation, and conclusion.</p>\n<p>It is critical that a concerted effort is made to demonstrate a clear link between the research design, implementation, and data analysis. When preparing your report, ensure it follows a structured format and adheres to the provided sub-headings.</p>\n<p><strong>Week 13: Poster presentation (10%)</strong></p>\n<p>Each team is required to present a poster related to their project during the seminar in Week 13.</p>\n<p>Note: all team members need to be in attendance and participate in this seminar.</p>\n<p><strong>References</strong> should be in <a href=\"https://web.library.uq.edu.au/research-tools-techniques/referencing/referencing-style-guides#apa\">APA style</a> <em>(click the hyperlink)</em></p>\n<p>Be very careful to avoid plagiarism. Information on <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/student-integrity-and-conduct/academic-integrity-and-student-conduct\">Academic integrity and student conduct</a> is available on the Library web site <em>(click the hyperlink)</em></p>\n<p><strong>AI statement:</strong></p>\n<p><em>This task has been designed to be challenging, authentic and complex. Whilst students may use Artificial Intelligence (AI) and/or Machine Translation (MT)technologies, successful completion of assessment in this course will require students to critically engage in specific contexts and tasks for which artificial intelligence will provide only limited support and guidance.</em></p>\n<p><em>A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.</em></p>\n<p><em>To pass this assessment, students will be required to demonstrate detailed comprehension of their written submission independent of AI and MT tools. </em></p>\n<p><strong>Criteria &amp; Marking</strong></p>\n<p>A Marking Guide with criteria and weighting is provided on Blackboard under the Assessment tab. </p>\n<p><strong>Submission</strong></p>\n<p>You will be submitting your proposal and report through <strong>Turnitin</strong>. Further details of the Task, and material to support your work, will be available on our course Blackboard site.</p>\n<p><strong>Teamwork evaluation and reflection</strong> will be assessed at two stages (mid-term review, and final review). Collaborative skills are a basic graduate attribute that all students should enter the workplace with.</p>\n<p>The assessment criteria for collaborative skills are:</p>\n<p>1. <strong><em>Contribution </em></strong>– team member contributed to the process required to complete the assignment.</p>\n<p>2. <strong><em>Knowledge </em></strong>– team member contributed knowledge, opinions, and skills to team discussions and work completion.</p>\n<p>3. <strong><em>Collaboration &amp; Communication </em></strong>– team member collaborated and communicated with others in the team and fulfilled their individual roles within the team.</p>\n<p>4. <strong><em>Responsibility </em></strong>– team member accepted responsibility for the team’s assignment outcome. </p>\n<p>More details will be provided in the blackboard.</p>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You will submit your proposal and final report through the Turnitin link located in the Blackboard Assessment Folder.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>",
            "late_submission": "<p>A <a href=\"https://policies.uq.edu.au/document/view-current.php?id=184\">penalty</a> of 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/applying-assessment-extension\">apply for an extension</a>.</p>"
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Online Quiz",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--engineering-and-computing--laptop icon-text--small",
                    "special_indicator_text": "Online"
                }
            ],
            "weighting": "<dd>40%</dd>",
            "due_date": "<dd><p> 1/10/2024 5:00 pm</p>\n<p>\n</p><p>During seminar.</p></dd>",
            "learning_objectives": "L01, L04",
            "mode": "Product/ Artefact/ Multimedia",
            "category": "Quiz",
            "task_description": "<div class=\"collapsible collapsible--text\">\n<p><strong>Task</strong> <strong>Description:</strong></p>\n<ul>\n<li>This is an open book exam. You will have access to your own notes, seminars, course texts, and other materials. </li>\n<li>This Exam will consist of Single Answer Questions, Multiple Answers Questions, Matching Questions, and Ordering Questions, etc.</li>\n<li>It will cover materials presented in Week 1 to Week 9, including lectures and related chapters from Veal 2018 (or 2011).</li>\n<li>The Exam access will be open <strong>during the Lecture Time in Week 10.</strong></li>\n<li>You will have <strong>60 minutes</strong> to complete all questions. The Exam is set to close after 60 minutes regardless of your beginning time. Please begin the Exam on time if you want to use full 60 minutes.</li>\n<li>You will have <strong>one attempt ONLY</strong>. You will not be able to save your progress and exit once you have started - thus you must complete this assessment in one sitting.</li>\n<li>If you <strong>accidentally close the window or lose your internet connection</strong>, you will be able to go back into the Exam and continue with your questions in the<strong> time remaining</strong>. </li>\n<li>If you experience any <strong><em>technical difficulties,</em></strong> be sure to <strong><em>take screenshots or photographs</em></strong> to show what has happened.</li>\n</ul>\n<p><strong>Practice Quiz:</strong></p>\n<ul>\n<li>A <strong>Practice Quiz</strong> will be available so that you can test the download speed of your device before you do the REAL Exam</li>\n<li>The Practice Quiz is not practice of the context of the REAL Exam, but shows the question types that you can expect</li>\n<li>If the speed or reliability of the Internet at your home is not good or not predictable, It is RECOMMENDED that you plan to do the Quiz on campus, or contact IT for help.</li>\n</ul>\n<p><strong>Academic Integrity:</strong></p>\n<ul>\n<li>The normal academic integrity rules apply - check <strong>Course Help (Academic Integrity Rules)</strong></li>\n<li>You are <strong>NOT permitted to consult any other person</strong> – whether <strong>directly, online, or through any other means</strong> – <strong>about any aspect of the quiz questions or answers during the period that this assessment is available</strong>.</li>\n<li>If it is found that you have given or sought outside assistance with this examination, then that will be deemed to be <strong>cheating</strong>.</li>\n<li>This assessment task evaluates students' abilities, skills and knowledge without the aid of generative Artificial Intelligence (AI). Students are advised that the use of AI technologies to develop responses is strictly prohibited and may constitute student misconduct under the Student Code of Conduct.</li>\n<li>Undertaking this exam deems your commitment to <a href=\"https://itali.uq.edu.au/covid-19-teaching-guidance/assessing#8\">UQ’s academic integrity pledge</a> as summarised in the following declaration:</li>\n<li><em>“I certify that I have completed this examination in an honest, fair and trustworthy manner, that my submitted answers are entirely my own work, and that I have neither given nor received any unauthorised assistance on this examination”.</em></li>\n</ul>\n<button class=\"collapsible__toggle\">\n<span class=\"collapsible__open link--icon icon--standard--arrow-down-1\">Read full task description</span>\n<span class=\"collapsible__close link--icon icon--standard--arrow-up-1\">Hide full task description</span>\n</button>\n</div>",
            "submission_guidelines": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "deferral_or_extension": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>",
            "late_submission": "<p>Exams submitted after the end of the submission time will incur a <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/requesting-late-penalty-exemption-online-exam\">late penalty</a>.</p>",
            "additional_info": "<p>You may be able to <a href=\"https://my.uq.edu.au/information-and-services/manage-my-program/exams-and-assessment/deferring-exam#3\">defer this exam</a>.</p>"
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Intro: Research and consulting project</strong><br><p>This session will provide an introduction to the course and an overview of the growth, value and nature ofindustry research and consultancy.</p></br></p><p><strong>Learning outcomes:</strong> L01</p></div></td>",
            "topic_title": "<strong>Intro: Research and consulting project</strong>",
            "topic_description": "Intro: Research and consulting project This session will provide an introduction to the course and an overview of the growth, value and nature ofindustry research and consultancy.",
            "learning_outcomes": [
                "L01"
            ]
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Research problems and project design</strong><br><p>This session will outline how to conceptualise and refine research problems, including formulating research aims and questions. It also provides an overview of the steps involved in the project process.</p></br></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Research problems and project design</strong>",
            "topic_description": "Research problems and project design This session will outline how to conceptualise and refine research problems, including formulating research aims and questions. It also provides an overview of the steps involved in the project process.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Research methods and secondary data</strong><br/><p>This session will outline the pros and cons of different research methods. It will outline the use of secondary data in research projects and how best to utilise secondary sources of data.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Research methods and secondary data</strong>",
            "topic_description": "Research methods and secondary data This session will outline the pros and cons of different research methods. It will outline the use of secondary data in research projects and how best to utilise secondary sources of data.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Qualitative methods &amp; data collection</strong><br/><p>This session will provide an introduction to the qualitative research methodology, focusing on personal interviews and focus groups as common data collection tools.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Qualitative methods &amp; data collection</strong>",
            "topic_description": "Qualitative methods & data collection This session will provide an introduction to the qualitative research methodology, focusing on personal interviews and focus groups as common data collection tools.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Quantitative methods &amp; data collection</strong><br/><p>This session provides an introduction to the quantitative methodology and surveys as a common data collection tool.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Quantitative methods &amp; data collection</strong>",
            "topic_description": "Quantitative methods & data collection This session provides an introduction to the quantitative methodology and surveys as a common data collection tool.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Research ethics &amp; teamwork evaluation</strong><br/><p>This session will provide an overview of some of the issues and problems in undertaking industry research projects including ethics, codes of conduct and professionalism. Teamwork evaluation will also be discussed.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Research ethics &amp; teamwork evaluation</strong>",
            "topic_description": "Research ethics & teamwork evaluation This session will provide an overview of some of the issues and problems in undertaking industry research projects including ethics, codes of conduct and professionalism. Teamwork evaluation will also be discussed.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Quantitative data analysis &amp; project development</strong><br/><p>This session will provide an overview of quantitative data analysis techniques and appropriate forms to communicate research findings to audience.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Quantitative data analysis &amp; project development</strong>",
            "topic_description": "Quantitative data analysis & project development This session will provide an overview of quantitative data analysis techniques and appropriate forms to communicate research findings to audience.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Qualitative data analysis &amp; project development</strong><br/><p>This session will provide an overview of qualitative data analysis techniques and appropriate forms to communicate research findings to audience.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Qualitative data analysis &amp; project development</strong>",
            "topic_description": "Qualitative data analysis & project development This session will provide an overview of qualitative data analysis techniques and appropriate forms to communicate research findings to audience.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Reporting &amp; project management</strong><br/><p>This session will provide an overview of project reporting, and discuss project management.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Reporting &amp; project management</strong>",
            "topic_description": "Reporting & project management This session will provide an overview of project reporting, and discuss project management.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Mid Sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Semester Break</strong><br/></p><p><strong>Learning outcomes:</strong> L04</p></div></td>",
            "topic_title": "<strong>Semester Break</strong>",
            "topic_description": "Semester Break",
            "learning_outcomes": [
                "L04"
            ]
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Quiz &amp; Project development</strong><br/><p>This session has an online quiz and a session for project development.</p></p><p><strong>Learning outcomes:</strong> L01, L04</p></div></td>",
            "topic_title": "<strong>Quiz &amp; Project development</strong>",
            "topic_description": "Quiz & Project development This session has an online quiz and a session for project development.",
            "learning_outcomes": [
                "L01",
                "L04"
            ]
        },
        {
            "learning_period": "Week 11",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Lab experiment in tourism research</strong><br/><p>This session will discuss lab experiment in tourism research.</p></p><p><strong>Learning outcomes:</strong> L01, L03, L04</p></div></td>",
            "topic_title": "<strong>Lab experiment in tourism research</strong>",
            "topic_description": "Lab experiment in tourism research This session will discuss lab experiment in tourism research.",
            "learning_outcomes": [
                "L01",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Preparation for final delivery</strong><br/><p>This session prepares for the project final delivery to industry partners.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Preparation for final delivery</strong>",
            "topic_description": "Preparation for final delivery This session prepares for the project final delivery to industry partners.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Seminar",
            "topic": "<td data-title=\"Topic\"><div><p><strong>Poster presentation and industry feedback</strong><br/><p>Team project final delivery.</p></p><p><strong>Learning outcomes:</strong> L01, L02, L03, L04</p></div></td>",
            "topic_title": "<strong>Poster presentation and industry feedback</strong>",
            "topic_description": "Poster presentation and industry feedback Team project final delivery.",
            "learning_outcomes": [
                "L01",
                "L02",
                "L03",
                "L04"
            ]
        }
    ]
}