{
    "url": "https://course-profiles.uq.edu.au/course-profiles/TOUR7021-60332-7460",
    "full_course_code": "TOUR7021-60332-7460",
    "course_code": "TOUR7021",
    "class_code": "60332",
    "semester_code": "7460",
    "semester_details": "Semester 2, 2024 (22/07/2024 - 18/11/2024)",
    "learning_outcomes": [
        {
            "number": "LO1.",
            "description": "Evaluate tourism, hospitality and event management from a service management perspective"
        },
        {
            "number": "LO2.",
            "description": "Explore the critical role of managing the employee-customer interface in the delivery of service"
        },
        {
            "number": "LO3.",
            "description": "Recognise, evaluate and recommend key service management systems and processes to improve or solve problems in complex service environments"
        },
        {
            "number": "LO4.",
            "description": "Understand current best practice in relation to measuring business performance for service-related businesses"
        },
        {
            "number": "LO5.",
            "description": "Demonstrate the capacity to critically evaluate self and others."
        }
    ],
    "assessments": [
        {
            "assessment_detail_section_id": "assessment-detail-0",
            "assessment_title": "Service Experience Oral Pitch",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "20% Individual",
            "due_date": "26/08/2024 12:00 pmHeld during class.",
            "learning_objectives": null,
            "mode": "Oral",
            "category": "Presentation",
            "task_description": "There are many concepts, ideas and principles which underpin service management. This task requires you to reflect upon your own service experiences on a daily basis, from a customer perspective, and then critically analyse one of these experiences through the lens of a relevant service management principle.This will be a 3-minute individual presentation delivered live during our class. It should provide sufficient description of a service experience that you have recently experienced. One photo taken by you is required to help explain the service experience to the rest of the students. This will be shared on the screen during your pitch.Your pitch should cover three vital aspects:Date, time and place of the service experience.A brief description of the service experience (so that the audience can understand enough to know if the link to the service concept is appropriate).A justification of the relevance between the experience and the assigned service management concept. These topics will be allocated in class. (eg. every student will be given a concept on which to base their presentation).There is no written component, but you must submit your Photo to Turnitin.This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "Submit via Turnitin",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-1",
            "assessment_title": "Service Experience Report",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "40% Individual",
            "due_date": "11/10/2024 2:00 pm",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Paper/ Report/ Annotation",
            "task_description": "There are many concepts, ideas and principles which underpin service management. This assignment requires you to reflect upon your own service experiences on a daily basis, from a customer perspective, and then critically analyse one of these experiences through the lens of a relevant service management principle. The service management principles that can be used will be discussed in class and include: Service Characteristics, Service Quality and Dual Value Creation.Students will share their individual service experience (from Assignment 1) through a 2000 word Report, including an Executive Summary, Service Experience Overview, Literature Review and Recommendations. This should provide sufficient description of a service experience that you have recently experienced. However, the main emphasis should be on the clear connection between ‘what happened’ and a relevant service principle. Using the principle, you should critically analyse the experience, and depending on the context, offer insights, draw a conclusion and/or offer recommendations. Develop this Report with industry (managers / leaders) being your target audience who should learn/benefit from your insights.The main emphasis is on your ability to apply service management principles in a real life context.Artificial Intelligence (AI) and Machine Translation (MT) are emerging tools that may support students in completing this assessment task. Students may appropriately use AI and/or MT in completing this assessment task.. Students must clearly reference any use of AI or MT in each instance.A failure to reference generative AI or MT use may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "Submitted via Turnitin",
            "deferral_or_extension": "You may be able toapply for an extension.",
            "late_submission": "Apenaltyof 10% of the maximum possible mark will be deducted per 24 hours from time submission is due for up to 7 days. After 7 days, you will receive a mark of 0.",
            "additional_info": "You may be able to\napply for an extension\n."
        },
        {
            "assessment_detail_section_id": "assessment-detail-2",
            "assessment_title": "Final Exam",
            "special_indicators": [
                {
                    "special_indicators_class": "icon--how-youll-learn--multiple-circle-1 icon-text--small",
                    "special_indicator_text": "In-person"
                }
            ],
            "weighting": "40% Individual",
            "due_date": "End of Semester Exam Period2/11/2024 - 16/11/2024Examination Period",
            "learning_objectives": null,
            "mode": "Written",
            "category": "Examination",
            "task_description": "Task Description:This is a problem-based assessment whereby students will have to apply service management principles, theories and approaches to address real-world situations and challenges facing all service industries - with a focus on the tourism, hospitality and events sectors. The assessment will assess your understanding of the content from all modules we have covered this semester.This is a 2 hour exam paper with 10 minutes reading time. The format of the assessment includes short answer questions.More details will be provided in class, as well as preparation advice.If you have extenuating circumstances which prevent you completing this assessment within the timeframe given, please apply for an extension of assessment via my.UQ (not a deferral) as outlined in 5.3.Criteria & Marking:Further information will be provided on Blackboard and in class.This assessment task is to be completed in-person. The use of generative Artificial Intelligence (AI) or Machine Translation (MT) tools will not be permitted. Any attempted use of AI or MT may constitute student misconduct under the Student Code of Conduct.Read full task descriptionHide full task description",
            "submission_guidelines": "You may be able todefer this exam.",
            "deferral_or_extension": "You may be able todefer this exam.",
            "late_submission": null,
            "additional_info": "You may be able to\ndefer this exam\n."
        }
    ],
    "learning_activities": [
        {
            "learning_period": "Week 1",
            "activity_type": "Seminar",
            "topic": "TOPIC 1: INTRO/BACKGROUND (IMPORTANT SESSION)Introduction to course, philosophy of course coordinator and team, expectations of students, review of assessment, clarify timelines, summary of course journey, how it fits into wider program and business foundational courses.",
            "topic_title": "TOPIC 1: INTRO/BACKGROUND (IMPORTANT SESSION)",
            "topic_description": "Introduction to course, philosophy of course coordinator and team, expectations of students, review of assessment, clarify timelines, summary of course journey, how it fits into wider program and business foundational courses.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 2",
            "activity_type": "Seminar",
            "topic": "TOPIC 2: FOUNDATIONS OF SERVICE MANAGEMENTHow management theory has developed and evolved, evolution to service economy, The Engle Curve, foundation definitions and concepts, service dominant logic, value co-creation, differences in management practices and requirements. Assessment Information will be provided.",
            "topic_title": "TOPIC 2: FOUNDATIONS OF SERVICE MANAGEMENT",
            "topic_description": "How management theory has developed and evolved, evolution to service economy, The Engle Curve, foundation definitions and concepts, service dominant logic, value co-creation, differences in management practices and requirements. Assessment Information will be provided.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 3",
            "activity_type": "Seminar",
            "topic": "TOPIC 3: SATISFACTION, LOYALTY, QUALITYDifferences in quality perceptions in service/product management; connections to satisfaction, definition of quality, satisfaction, and loyalty; different types of loyalty and links to service; how to measure service quality; differences between process and outcome dimensions. Case Study: Gronroos Article.",
            "topic_title": "TOPIC 3: SATISFACTION, LOYALTY, QUALITY",
            "topic_description": "Differences in quality perceptions in service/product management; connections to satisfaction, definition of quality, satisfaction, and loyalty; different types of loyalty and links to service; how to measure service quality; differences between process and outcome dimensions. Case Study: Gronroos Article.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 4",
            "activity_type": "Seminar",
            "topic": "TOPIC 4: CUSTOMER ORIENTATION (PART 1)Customer Orientation. Importance for service organisations to have a customer centred approach. Different types of customers, examples of customer vs. product centered management.",
            "topic_title": "TOPIC 4: CUSTOMER ORIENTATION (PART 1)",
            "topic_description": "Customer Orientation. Importance for service organisations to have a customer centred approach. Different types of customers, examples of customer vs. product centered management.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 5",
            "activity_type": "Seminar",
            "topic": "TOPIC 4: CUSTOMER ORIENTATION (PART 2)Customer Orientation Part 2 - continued - Customer listening systems, mystery shoppers, employee surveys, focus groups. Case Study: Parasuraman et al Article.",
            "topic_title": "TOPIC 4: CUSTOMER ORIENTATION (PART 2)",
            "topic_description": "Customer Orientation Part 2 - continued - Customer listening systems, mystery shoppers, employee surveys, focus groups. Case Study: Parasuraman et al Article.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 6",
            "activity_type": "Seminar",
            "topic": "TOPIC 5: SERVICE ENCOUNTER & CUSTOMER JOURNEYDefining the employee-customer-organisational interface, the service encounter 'triad', challenges and solutions. Case Study: Shah et al Article.",
            "topic_title": "TOPIC 5: SERVICE ENCOUNTER & CUSTOMER JOURNEY",
            "topic_description": "Defining the employee-customer-organisational interface, the service encounter 'triad', challenges and solutions. Case Study: Shah et al Article.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 7",
            "activity_type": "Seminar",
            "topic": "TOPIC 6: SUPPLY, DEMAND & PSYCHOLOGY OF WAITINGChallenges of unmatched supply and demand, management strategies,how to manage supply and demand variances, Managing real/perceived waits, psychology of waiting.Oral Pitch Presentations!",
            "topic_title": "TOPIC 6: SUPPLY, DEMAND & PSYCHOLOGY OF WAITING",
            "topic_description": "Challenges of unmatched supply and demand, management strategies,how to manage supply and demand variances, Managing real/perceived waits, psychology of waiting.\nOral Pitch Presentations!",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 8",
            "activity_type": "Seminar",
            "topic": "TOPIC 7: SERVICE VALUES & VISIONDifferences in vision, mission, strategy and values for service organizations. Challenges for service organizations. Creating service oriented values.Exercise on Customer Journey Mapping.",
            "topic_title": "TOPIC 7: SERVICE VALUES & VISION",
            "topic_description": "Differences in vision, mission, strategy and values for service organizations. Challenges for service organizations. Creating service oriented values.\nExercise on Customer Journey Mapping.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 9",
            "activity_type": "Seminar",
            "topic": "TOPIC 8: SERVICE PROFIT CHAIN AND CULTUREReviewing history and conceptual development of the SPC and all the elements of the chain. Probing internal service quality, organisational psychology for service firms, employee engagement. Report Workshop",
            "topic_title": "TOPIC 8: SERVICE PROFIT CHAIN AND CULTURE",
            "topic_description": "Reviewing history and conceptual development of the SPC and all the elements of the chain. Probing internal service quality, organisational psychology for service firms, employee engagement. Report Workshop",
            "learning_outcomes": []
        },
        {
            "learning_period": "Mid Sem break",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "In-Semester Break",
            "topic_title": "In-Semester Break",
            "topic_description": "",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 10",
            "activity_type": "Seminar",
            "topic": "TOPIC 9: SERVICE GUARANTEESJustification for implementing guarantees in service contexts, nature and characteristics of effective guarantees. Lecture Review",
            "topic_title": "TOPIC 9: SERVICE GUARANTEES",
            "topic_description": "Justification for implementing guarantees in service contexts, nature and characteristics of effective guarantees. Lecture Review",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 11",
            "activity_type": "No student involvement (Breaks, information)",
            "topic": "Public Holiday",
            "topic_title": "Public Holiday",
            "topic_description": "",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 12",
            "activity_type": "Seminar",
            "topic": "TOPIC 10: SERVICE FAILURE/RECOVERYDefine service failure and recovery. How great service firms use this as competitive advantage; recovery paradox.",
            "topic_title": "TOPIC 10: SERVICE FAILURE/RECOVERY",
            "topic_description": "Define service failure and recovery. How great service firms use this as competitive advantage; recovery paradox.",
            "learning_outcomes": []
        },
        {
            "learning_period": "Week 13",
            "activity_type": "Seminar",
            "topic": "OVERVIEW AND SUMMARYFinal review and reflections for course. Final Assignment Preparation.",
            "topic_title": "OVERVIEW AND SUMMARY",
            "topic_description": "Final review and reflections for course. Final Assignment Preparation.",
            "learning_outcomes": []
        }
    ]
}